[
  {
    "blob_name": "Copilot in Power Automate - Whitepaper (3).PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:54:59+00:00",
    "size": 1829944,
    "content": "Copilot \nin Power \nAutomate\nAI-powered experiences that boost \nproductivity and save time\nT able of \ncontents\n02\nRefocus your \nefforts and get to \ninnovation, faster04\nWork smarter \nwith Copilot in \nPower Automate05\nDiscover and \noptimize with task \nand process mining \n07\nAutomate cloud \napps, services, \nand data with \ncloud flows 10\nAutomate legacy \nsystems and UI \nwith desktop flows14\nOrchestrate and \nautomate at scale\n16\nAI isn’t taking jobs, \nit’s enhancing them\nCopilot in Power \nAutomate 2\nRefocus your efforts and \nget to innovation, faster\nWith the ever -increasing rate of change and \nbusinesses incorporating AI across an array of \nproducts and services, organizations need to be able \nto keep pace with —or even get ahead of —their \ncompetition. In 2023, Microsoft introduced Copilot, an \nAI-powered agent, across a range of experiences.\nUsing generative AI, Copilot empowers its users to \naccelerate innovation and increase proficiency. While \nit continues to be integrated across Microsoft 365 products and services, such as Microsoft Teams, \nSharePoint, Excel, Word, and more, it has also been \nintegrated into business applications like Dynamics \n365 and Microsoft Power Platform, a suite of products \npowered by low code and AI that enable app \ndevelopment, analytics and insights, chatbots, process \nautomation, and more.\nWith Copilot…\n77%\nof people don’t want to go \nback to working without it 70%\nsaid they were more \nproductive 22%\nof users reported saving more \nthan 30 minutes per day.1\nCopilot in Power Automate 3\n3Refocus your efforts to get to \ninnovation, faster\nMicrosoft Power Automate —part of Microsoft \nPower Platform —is the engine that connects \nprocesses across multiple systems to streamline \noperations. Power Automate is your centralized, \ncomprehensive automation platform that allows \nyou to simplify complex processes and tasks with \nthe power of low -code and AI. You and your \norganization can utilize Power Automate to \nachieve several core capabilities"
  },
  {
    "blob_name": "Copilot in Power Automate - Whitepaper (3).PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:54:59+00:00",
    "size": 1829944,
    "content": ", including:\nImprove processes\nBy optimizing your processes with Power \nAutomate, you can more easily uncover \nautomation opportunities and more that take \nyour processes to the next level. \nIncrease efficiency\nBoth digital process automation (DPA) and \nrobotic process automation (RPA) allow you to \nstreamline productivity across modern and \nlegacy systems. \nIntegrate seamlessly\nBuilt -in governance and data loss prevention \n(DLP) ensures your automations run securely \nand at scale across your organization.\n93%\nof Fortune 500 companies \nuse Power Automate.2\n\nCopilot in Power Automate 4\nWork smarter with \nCopilot in Power \nAutomate\nNow, Copilot has been weaved into Power Platform, \nincluding Power Automate. With this new integration, \nyou can use Copilot to discover, automate, \norchestrate, and optimize processes more efficiently \nand intelligently than before. This empowers users, \nbusiness analysts, developers, and admins to increase \nproficiency and have more time to do even \ngreater work. \nCopilot in Power Automate allows people and \nmachines to work together by using a language that is \nnaturally understood by both, eliminating the need \nfor special knowledge. This helps make automation \nmore intelligent and reimagines the traditional \nexperience through the broad initiatives of generative AI. These experiences have been integrated to enable \nbusinesses to save even more time, money, and \neliminate frustrations on a day -to-day basis. \nUsers can engage Copilot in Power Automate across \nmultiple experiences. They can use natural language \nto describe what they want to accomplish and then \nmove on to next steps by leveraging its responses. For \ninstance, Copilot can be utilized when creating \nautomations, known as flows, in Power Automate\nand even for process optimization with process \nmining. These are only a couple of examples, as you’ll \nlearn more about its extensibility in the rest of this \nwhitepaper. \n\nCopilot in Power Automate 5\n Copilot in Power Automate "
  },
  {
    "blob_name": "Copilot in Power Automate - Whitepaper (3).PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:54:59+00:00",
    "size": 1829944,
    "content": "5\nDiscover and\noptimize with task \nand process mining \nPower Automate Process Mining utilizes data from \nvarious sources, such as IT systems and desktop \ncapture, to visualize the actual process, extract \ninsights, and identify inefficiencies and improvement \nopportunities. It gives the ability to drill down into \nyour data and the processes that it follows, such as \nthe automation you’ve created. There are two ways to \ndo this: process mining and task mining. The core \nfunction of process mining involves extracting \ndata from systems of records (SOR) or other sources. \nOn the other hand, task mining captures user \ninteraction or desktop data, enabling businesses to \nanalyze and enhance their work processes. Users \ninitiate the recording of small processes or tasks, \noften in conjunction with process mining for a \ncomprehensive perspective. \nBy gaining what you could call an x -ray of your \nbusiness, you gain insights into what those processes \nlook like and most importantly, where bottlenecks \nexist and where rework is happening. Once \nbottlenecks and inefficiencies are identified, a plan can \nbe prepared to address and alleviate these issues. \nHowever, the process of data analysis and reporting \ncan be lengthy —often a period of three -to-four months —to understand what’s happening in the \nexisting processes using traditional techniques. By \nleveraging Copilot in Power Automate Process \nMining, you can achieve the same results in just three -\nto-four clicks.\nLooking at a standard scenario, we can outline it \nthis way: \n•Organization A opens a purchase order within \ntheir system of 30,000 chairs. This order needs to \nbe approved. \n•Once this order is approved, the supplier \nwill need to receive the approved purchase \nrecognition. \n•When the supplier receives this, an invoice will be \ngenerated and sent back to Organization A for \nanother approval process. \nYet, within this process there are several pieces that \nneed to be tailored, dependent on factors like varying"
  },
  {
    "blob_name": "Copilot in Power Automate - Whitepaper (3).PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:54:59+00:00",
    "size": 1829944,
    "content": " \ntax codes in different areas that may create the need \nfor the process to deviate. This is just one example of \nprocess mining and the types of details that need to \nbe identified and drilled down into. \nCopilot in Power Automate 6\nDiscover and optimize with task and \nprocess mining \nUse Copilot in \nPower Automate \nProcess Mining\nIdentifying opportunities in your business to optimize \nyour automation and workflows is crucial to gaining \nefficiency and driving higher results. We can look at an \naccounting department as an example. Being able to \nfind out how much time is being spent on and the \ndollar amount of invoices that get stuck —or \nbottlenecked —at certain times or steps, helps you \nlearn where you may be losing money and \nincreasing work. \nYou can quickly and easily identify opportunities such \nas this simply by selecting the provided prompt, “Top \ninsights,” or type it in on your own in the chat box. \nExamples of top insights Copilot can provide are: \n•The longest running activity or bottleneck in \nthe process \n•The activities with the most repetitions \n•And the mean, median, and max duration \nof cases.\nThe overarching benefits of leveraging Copilot in \nprocess mining can be explained as follows: \nExpedite your process mining time \nor experience.\nThe average length of time it takes to perform process \nmining —without the help of AI tools like Copilot —can \nbe anywhere between three -to-four months. \nHowever, when you prompt Copilot within your \nprocess mining actions, you gain a significant amount \nof time.\nSeamless solutioning against bottlenecks.\nBy leveraging Copilot, process mining data analyses \ncan not only identify broken processes easier and faster, but also create solutions to those bottlenecks at \nan even an even faster rate than ever. When prompted \nto identify the inefficient processes, Copilot will then \nautomatically offer an app or flow to be implemented \nvia Microsoft Power Apps or Power Automate (these \nwill be discussed later). \nBeing ab"
  },
  {
    "blob_name": "Copilot in Power Automate - Whitepaper (3).PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:54:59+00:00",
    "size": 1829944,
    "content": "le to effectively measure ROI of \nautomation or process changes.\nGoing back to our accounting example, being able to \nquickly identify where bottlenecks are happening \nallows businesses to identify opportunities to make \nalterations to their existing processes. They can take \nwhat they’ve found and implement the suggested \nflow from Copilot, and handle invoices at a faster rate. \nProcess mining is just the tip of the spear though, \nmaking way for you to better identify how to leverage \nthe rest of the Power Platform to optimize the way \nyou work. \nLearn more about using Copilot in Power Automate \nprocess mining.\n\nCopilot in Power Automate 7\nAutomate cloud apps, \nservices, and data \nwith cloud flows \nCloud flows, powered by digital process automation (DPA), is a core automation \ncapability of Power Automate. With cloud flows, users can leverage over 1,000 API \nconnectors or even create their own API connector to automate with logic -based \nautomatio . And with built -in integration across the Microsoft ecosystem, like in \nSharePoint, Microsoft Teams, OneDrive, and even Dynamics 365, automation is available \nin the flow of work. \nThere are almost limitless ways to use cloud flows —it just depends on the need\nand your imagination. However, there are some common use cases and groupings that \nwe can consider, especially if you’re just getting started with cloud flows and need \nsome inspiration.\nCopilot in Power Automate 8\n8Automate cloud apps, services, and \ndata with cloud flows\nPersonal productivity\nMost employees spend a large portion of their day just \ncommunicating, whether it’s through chat or email. Cloud flows can \nhelp unburden some of the more repetitive and perfunctory \ncommunication. For instance, you can use cloud flows to \nautomatically respond to any calendar invite that doesn’t have an \nagenda and request an agenda for the meeting. You can also \nautomate sign -off requests such as needed approvals for vacation \nrequests or expense reports. This allows you"
  },
  {
    "blob_name": "Copilot in Power Automate - Whitepaper (3).PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:54:59+00:00",
    "size": 1829944,
    "content": " to spend less time doing \nthe repetitive and more time focused on essential work and tasks. \nBusiness approvals\nWithin SharePoint, you can create cloud flows that allow for \nautomated document approval. You can easily create a cloud flow \nthat establishes a process for when either any document or a certain \ndocument type is uploaded to SharePoint, it is sent for approval to \nthe appropriate recipients. \nBack -office automation\nOrganizations often need to manage a large volume of clerical but \nessential documents, such as invoices and claims. The process of \nmanaging these essential documents can often be both \noverwhelming and disorganized. Cloud flows eliminate the \ncomplexity, allowing the automated processing of any document \ntype. Besides over 1,000 different connectors, including Adobe, \nGoogle Drive, Salesforce and SAP, cloud flows also include AI Builder, \nwhich allows you to embed AI directly within the automation. This \nmeans, regardless of where your document types need to go or be \nprocessed through, cloud flows can help assist and automate \nthis process.\nCopilot in Power Automate 9\n9Automate cloud apps, services, and \ndata with cloud flows\nUse Copilot in\ncloud flows\nBy utilizing Copilot in cloud flows, users can use \nnatural language to describe what automation \nthey want to create, and Copilot will build it for \nthem. Additionally, once an automation is built, \nusers can continue engaging Copilot to refine \nwhat they’ve created and gain insights into their \nautomation. Regardless if you are a professional \ndeveloper or non -coder, using Copilot simplifies \nthe experience and helps you focus on building \nsolutions faster.\nThere are a few ways you can engage Copilot in \ncloud flows: \n•Create a flow: Relay what you’d like to \naccomplish with your flow or describe a \nscenario and a flow will be created. If you’re \nunsure of how to engage Copilot in this way, \ncheck out these best practices on “How to \nwrite a good prompt.” \n•Modify a flow: Update flows bas"
  },
  {
    "blob_name": "Copilot in Power Automate - Whitepaper (3).PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:54:59+00:00",
    "size": 1829944,
    "content": "ed on what \nyou tell Copilot you’d like to see change \nabout the flow. \n•Understand a flow: Dig deeper into the flow \nby asking Copilot questions about the flow \nitself, like what the flow accomplishes. Extend your cloud \nflow automation \nwith custom \ncopilots\nThe new Microsoft Copilot Studio lets makers \ncreate custom copilots that can trigger cloud \nflows to run, enabling extensions of your \nworkflows and automations —without even \nwriting any code. To learn more, visit Microsoft \nCopilot Studio . \nOverall, Copilot in cloud flows is designed so you \ncan start automating faster and easier and ensure \nyou’re receiving value from the automations that \nCopilot assists in building. \nLearn more about how to get started with Copilot \nin cloud flows .\n\nCopilot in Power Automate 10\n Copilot in Power Automate 10\nAutomate legacy \nsystems and UI with \ndesktop flows\nDesktop flows —powered by robotic process \nautomation (RPA) —are another essential part of the \ncore automation capabilities of Power Automate. With \ndesktop flows, users can automate the UI of a desktop \nby acting as if an actual human user was interacting \nwith it. Users create and refine desktop flows in Power \nAutomate for desktop, which is available in the \nMicrosoft Store for Windows 10 and comes out -of-\nthe-box in Windows 11. Desktop flows are ideal for \nsystems that are not reinvesting in a re -architecture \neffort to modernize, or if there is too much difficulty \nto lift and shift for a migration to the cloud. \nDesktop flows can be run in either attended or \nunattended mode. Attended mode executes the \nautomation when manually triggered, while \nunattended mode executes when a certain event or \ntime takes place. Users can even choose to run a \ndesktop flow from within a cloud flow, enabling \ngreater synergy between API and UI -based \nautomation (we’ll share some more later in this \nwhite paper). \nThere are some standard use cases when it would be \ngood to bring desktop flows into play. For instance, the us"
  },
  {
    "blob_name": "Copilot in Power Automate - Whitepaper (3).PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:54:59+00:00",
    "size": 1829944,
    "content": "e of a web form in which data is being \nmanipulated. Desktop flows can assist with data: \n•Entry \n•Extraction \n•Migration \n•Synchronization \n•Backup and restore \n•Cleansing \n•Analysis \nWhen considering attended versus unattended \ndesktop flows, a clear example of attended \nautomation would be a receptionist wanting to \nautomate the process of checking in for a client or \ncustomer. They can offload this task to a bot, having \nthe bot collect credit card information, see if they are \nenrolled in a loyalty program, etc. This collection of \nimportant data is easily taken over by the bot, \nallowing the receptionist to expedite the process and \ngain valuable time back. \nCopilot in Power Automate 11\n Copilot in Power Automate 11Automate legacy systems and UI with \ndesktop flows\nProcess in real time and focus on \nthe strategic\nA prime example of the power of desktop flows is when United States \ntelecommunications company T -Mobile needed to integrate a key application with \nSprint’s back -end system, following a merger of the two companies. \nT-Mobile had already been using Power Automate cloud flows, but they wanted to use \nPower Automate for desktop to roll out a solution, which they were able to do in just \nweeks. This resulted in quickly eliminating data lags and moving the integration of \nT-Mobile and Sprint forward. As a result, they were able to improve processing time and \ndata accuracy. Some key numbers from the update include: \n11xmore requests processed in real time \n12ximprovement of the averaging \nprocessing time\n0%human data entry errors\nAll of this meant that data analysts now had more time to focus on strategic projects, \nultimately improving their job satisfaction. \nRead the full Power Platform customer story . \nCopilot in Power Automate 12\n12Automate legacy systems and UI \nwith desktop flows\nUse Copilot in Power \nAutomate for desktop\nCopilot functionality is also available for desktop flows \nin Power Automate for desktop, enabling natural \nlanguage capabili"
  },
  {
    "blob_name": "Copilot in Power Automate - Whitepaper (3).PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:54:59+00:00",
    "size": 1829944,
    "content": "ties so makers can more proficiently \nbuild desktop flows. \nThere are two important elements to Copilot in Power \nAutomate for desktop:\nGenerative answers\nIn both the console and designer, users can ask \nCopilot product -related questions right from within \nthe product, so they do not need to switch context. \nThis puts the question -and-answer functionality right \nin front of the user and helps streamline the creation \nand updating of flows. \nNatural language to code in scripting and \ndatabase actions\nCopilot is included in five of the scripting actions —\nRun PowerShell, Run VBScript, Run JavaScript, Run \nDOS command, Run Python, and Execute SQL \nstatement —meaning that natural language prompts \ncan be used to generate code in each one of these \nscripts. While not all languages are supported \ncurrently by Copilot, more are being continuously \nintroduced.\n\nCopilot in Power Automate 13\n Copilot in Power Automate 13Automate legacy systems and UI with \ndesktop flows\nAutomation is not an island\nUsing cloud flows and desktop flows together\nWhile the distinction has been made between cloud flows and desktop flows, the goal for \nboth is the same —automation and efficiency. And of course, the real elevated \nautomation happens when the two forms of automation are combined, creating \nhyperautomation, ensuring that processes are as automated and orchestrated as much\nas possible. \nFor automation to be truly beneficial, it needs to not exist in a bubble but connect to the \ndata that informs what it does, as well as connect to the processes that need updating \nand efficiency. Ultimately, it’s important to bring automation to where the user is \noperating and working. That’s why we have integrated automation experiences into \nMicrosoft Teams, SharePoint, Excel, and even third -party services like Adobe Acrobat \nSign, so that users can set up workflows right in the context of their work.\nLet’s look at an example of extensibility in action.\nKomatsu Australia, an Australian subsidiary "
  },
  {
    "blob_name": "Copilot in Power Automate - Whitepaper (3).PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:54:59+00:00",
    "size": 1829944,
    "content": "of Komatsu, an industry -leading \nmanufacturer of construction, forestry, and mining equipment, needed to streamline \nmanual processes involving almost 52,000 invoices annually . The manual process \nrequired review by one of three team members, manual entry into Excel, validation \nagainst other Excel spreadsheets, uploading into a web portal, and then finally entered \nonce more into a mainframe system. If there were any hiccups along this process, it \nwould cause a ripple effect that ultimately impacted the customer experience.\nFortunately, cloud flows were able to take the process off the employee’s hands, moving \nthe necessary documents from Outlook to a SQL database, and even connect to desktop \nflows. This resulted in approximately 1,100 invoices processed in just 3 weeks and an \nestimated 300 work hours saved per year . \nRead the full Power Platform customer story here . \nCopilot in Power Automate 14\n Copilot in Power Automate 14\nOrchestrate and \nautomate at scale\nAs you scale adoption of the platform, you’ll need to \nensure your system is managed and governed \naccording to your organization’s priorities. This is \nwhere an Automation Center of Excellence (CoE)  \ncomes in. \nThe Automation CoE is dedicated to overseeing, \nenabling, managing, and optimizing the deployment \nof automation technologies and processes, so that \nautomations can be run safely and efficiently. It’s able \nto accomplish this by employing: \nGovernance\nSecurity, data integrity, auditing. This ensures that only \nthe right people have access to specific data that's \ngoverned in a specific way to avoid unnecessary risk to \nthe organization. \nRepeatable patterns and templates\nError -handling, instrumentation, components. This \nhelps to avoid duplication and rework and enables \neveryone to reap the benefits of automation with the \nleast amount of effort. \nConsistent benefits realization\nKPIs/tracking/metrics, process rationalization . These \ndefine strategic benefit indicators, track and measure \n"
  },
  {
    "blob_name": "Copilot in Power Automate - Whitepaper (3).PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:54:59+00:00",
    "size": 1829944,
    "content": "return on investment, and ensure processes being automated are optimized. \nWithin the Power Automate portal, there is a specific \ndesktop flow activity section where you can view and \nmanage dashboards, tables, and graphs to monitor \nyour desktop flows, see how effective they are, and \nidentify any potential issues. Ultimately, desktop flow \nactivity allows you to dig deeper into your data, \nincluding last runs, where you can see the number of \nruns, the percentage of errors, and the run modes. \nThere are several scenarios we can look at to help best \nunderstand how orchestration and automation within \nthe organization works. These include: \n•Desktop flow run queues \n•Work queues \n•Hosted machines \nDesktop flow run queue orchestration is a process that \nmanages the execution of multiple desktop flows in a \ncoordinated manner, resulting in increased efficiency \nand productivity. Orchestrating multiple desktop \nflows can help increase efficiency of resource \nallocation. Users also will experience reduced wait \ntimes of critical tasks, increased scalability for large \nvolumes of desktop flows, and enhanced visibility with \nreal-time monitoring of the desktop flows that are \nrunning for immediate action if needed.\nCopilot in Power Automate 15\n Orchestrate and automate at scale\nWork queues help to improve efficiency, scalability, \nand resiliency of automations. These benefits are \naccomplished by decoupling different areas of a \nprocess, prioritizing work, and allowing asynchronous \ncommunication between digital workers, human \nworkers, and integrations. \nWith hosted machines , developers are provided with a \nway for quick and simple builds, testing, and the \nability to run desktop flows without physical machines. \nYou can connect or link work or school accounts that \nare set up with Microsoft 365, SharePoint, or Azure; \nyour own virtual network to communicate with each \nother, the internet, or on -premises networks; or \npersonalize your hosted machines with vanilla or \n"
  },
  {
    "blob_name": "Copilot in Power Automate - Whitepaper (3).PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:54:59+00:00",
    "size": 1829944,
    "content": "custom virtual machine images. \nThis all stacks up and lends to application lifecycle \nmanagement (ALM). ALM can be supported through \nthe entire suite of Power Platform solutions, as proper \nALM requires many moving parts and a great deal of \nsynchronicity. Power Platform solutions are what drive \nALM and what allow you to effectively implement \nALM. Power Automate flows, like desktop flows, are a \ncomponent of the Power Automate solution that you \ncan customize, and also a component that can be \nmanaged by ALM by having it reviewed and then \npushed to production. \nLearn more about ALM with Power Platform . \nUse Copilot for \norchestration\nCopilot helps Automation CoEs  and individuals on \ntheir journey to operational excellence by securely \nand responsibly democratizing access to automation \ninsights. Users can ask Copilot about desktop flow \nactivity -specific questions in natural language, \npotentially uncovering bottlenecks, trends, and \nopportunities for improvement that might otherwise \nhave gone unnoticed.With Copilot in Power Automate, Automation \nCoEs  are experiencing the above benefits, while \ncapabilities are heightened for ultimate efficiency and \nexperience by: \n•Democratized access to insights at scale \n•Improved troubleshooting experience and\ntime to fix \n•Reduced ad -hoc user inquiries and custom \nreport requests \n•Accelerated time to insights \n•Driven innovation and improvement \nLearn more about analyzing desktop flows .\n\nCopilot in Power Automate 16\n Copilot in Power Automate 16\nAI isn’t taking jobs, it’s \nenhancing them\nAcross each of these experiences of Copilot in Power \nAutomate, it may feel like AI is eliminating essential \nwork previously done by humans. However, utilizing \nthese incredible technologies to run more efficient \nprocesses doesn’t mean computers are taking over the \nworld. Rather, the world of AI and Copilot empowers \nusers to do more with the time their getting back. \nCopilot isn’t just a fast way to get technical answers to \ny"
  },
  {
    "blob_name": "Copilot in Power Automate - Whitepaper (3).PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:54:59+00:00",
    "size": 1829944,
    "content": "our most pressing questions, but it’s also a learning \ntool. For example, someone working within Power \nAutomate Process Mining may want to pull a \nsummary report, but they may also want to \nunderstand how that summary report was generated. \nUtilizing natural language, the user can ask Copilot \nhow to achieve something, and the produced \nresponse will be a step -by-step guide on how that \nperson can manually achieve the same results. Overall, using Copilot in Power Automate can help \nyou discover and optimize your processes with \nprocess mining, create automation across API \nconnectors and your desktop’s UI, and orchestrate \nand manage those automations faster than before \nwith insightful analytics. This is just the start of what \nCopilot can do. Microsoft continues to innovate and \nimprove Copilot to ensure your organization is \nequipped with the latest capabilities.\nVisit make.powerautomate.com to get started with \nCopilot in Power Automate today! To learn more, visit \nthe resources on the next page.\nCopilot in Power Automate 17\nLearn more\nWatch these videos:\nCopilot in Power Automate\nMicrosoft Copilot\nCheck out this documentation:\nCopilot in cloud flows\nCopilot in Power Automate for desktop\nCopilot in Power Automate Process Mining\nCopilot in orchestration\nCopilot in Power Automate 18\nCitations\n12023 Work Trend Index Special Report\nhttps://www.microsoft.com/en -us/worklab/work -trend -index/copilots -earliest -users -\nteach -us-about -generative -ai-at-work\n2Microsoft research, September 2023"
  },
  {
    "blob_name": "POWER BI.pptx",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:47:44+00:00",
    "size": 33202,
    "content": "POWER BI"
  },
  {
    "blob_name": "Power Automate - Infographic (2) (6).PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:54:59+00:00",
    "size": 816597,
    "content": "Be more productive. Automatically.  \nGrow your business productivity by automating repetitive,  \ntime-consuming ta sks with Microsoft Power Automate . \n \n\n \n \n  \n2. \nAccelerated productivity  \n 1. \nAutomation at scale  \n \n \n\n \n 4. \nIntelligent automation with AI  \n 3. \nSeamless, secure integration  \n \n \nUsing Power Automate, you can get started quickly with prebuilt \nconnectors to hundreds of on -premises and cloud apps and services. \nAutomate processes  within the apps you use every day with seamless \nintegration across Dynamics 365, Microsoft 365, and Azure.  \nFor more information, visit:  powerautomate.com  \n \n© 202 1 Microsoft Corporation. All rights reserved.  \nThis document is for informational purposes only. MICROSOFT MAKES NO WARRANTIES , EXPRESS, IMPLIED, OR STATUTOR Y, AS TO THE INFORMATION IN THIS DOCUMENT. \nSome examples are for illustration only and are fictitious."
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "Power Pl atform \nLicensing FAQ  \n \n \n \nMICROSOFT CONFIDENTIAL: INTERNAL USE ONLY  \n \nThis document is a compilation of multiple FAQ , including documents that were previously available as separate files.  \n \nLast updated on June 26, 2024  \n \nContents  \nPower Platform Subscription Licenses  ................................ ................................ ........................  3 \nMicrosoft Copilot Studio ................................ ................................ ................................ ................  3 \nPower Apps Premium  ................................ ................................ ................................ .....................  8 \nPower Automate Premium  ................................ ................................ ................................ ..........  10 \nPower Automate Process  ................................ ................................ ................................ .............  10 \nPower Automate Hosted Process  ................................ ................................ ...............................  12 \nPower Automate Process Mining add -on ................................ ................................ .................  15 \nPower Automate per user  ................................ ................................ ................................ ............  17 \nPower Automate per flow  ................................ ................................ ................................ ............  17 \nPower Automate unattended RPA add -on ................................ ................................ ...............  17 \nPower Automate Technical Enforcement  ................................ ................................ .................  18 \nPower Pages Authenticated users  ................................ ................................ ..............................  21 \nPower Pages Anonymous users  ................................ ................................ ................"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "................ .. 22 \nMicrosoft Dataverse  ................................ ................................ ................................ ......................  23 \nAI Builder Capacity add -on ................................ ................................ ................................ .........  25 \nAI Builder Rate Card ................................ ................................ ................................ ......................  26 \nAI Builder Technical Enforcement  ................................ ................................ ..............................  28 \nPower Platform use rights with Dynamics 365 and Microsoft/Office 365.  ........................  29 \nGeneral Power Platform Licensing Questions  ................................ ................................ ..........  31 \nPower Platform pay -as-you-go meters  ................................ ................................ .....................  32 \n\n2 \n Power Apps per app pay -as-you-go meter  ................................ ................................ ..............  32 \nPower Pages pay -as-you-go meters  ................................ ................................ ..........................  33 \nDataverse capacity pay -as-you-go meters  ................................ ................................ ...............  33 \nPromotions, Lead Status and Limited Time Offers  ................................ ................................ . 37 \nPower Apps and Power Automate Lead Status Offers  ................................ ...........................  37 \nPower Apps Basic to Premium Lead Status Offer (April 1, 2024)  ................................ .........  37 \nPower Automate Premium Attach to Power Apps Lead Status Offer (April 1, 2024)  .......  38 \nFrequently asked promotions and special offers questions  ................................ ..................  44 \nPower Platform Pricing and Discounting Changes  ................................ .............."
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": ".................. . 45 \nAI Builder and Copilot Studio Discounting Changes (April 1, 2024)  ................................ .... 45 \nLicense Transitions  ................................ ................................ ................................ ........................  48 \nMicrosoft Copilot Studio (December 1, 2023)  ................................ ................................ ..........  48 \nPower Platform Simplification (August 1, 2023)  ................................ ................................ ...... 51 \nPower Apps portals transition to Power Pages (October 1, 2021)  ................................ ........  52 \nPower Apps Pricing and Licensing Changes (October 1, 2021)  ................................ .............  56 \nPower Platform Licensing Changes (October 1, 2019)  ................................ ............................  57 \nEvolution of the Microsoft Dataverse (December 1, 2019)  ................................ ....................  60 \nPower Platform Licensing Resources  ................................ ................................ .........................  61 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n3 \n Power Platform Subscription  Licenses  \n \n \n \nFor Power BI and Fabric licensing information, refer to Power BI service per user and capacity -based licenses .  \n \nMicrosoft  Copilot Studio  \n \n1. What is Copilot Studio?   \nCopilot Studio is an end-to-end conversational AI  platform  that empowers you to create \nand customize copilots  using natural language or a graphical interface. With Copilot \nStudio, you can easily design, test, and publish copilots that suit your specific needs for \ninternal or external scenarios across your industry , department, or role. Technical details \nare available here: https://aka.ms/copilotstudiodocs .  \n \n2. What are the licensing entitlement  details for Copilot Studio?  \nCustomers who purchase the new Copilot Studio receive the following entitlements.  \n• Messages - 25,00"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "0 messages per tenant/month    \n• Billed messages definition:  Copilot Studio messages are the common currency \nacross Copilot Studio capabilities. A billed message is a request or message sent to \nthe copilot triggering an action and/or response. Examples: a) user asks copilot \nwhen a store is open, and copilot replies with store hours = 1 billed message b) \ncopilot proactively greets the user on a website = 1 billed message, c ) user asks \ncopilot for store hours for the upcoming holiday, copilot responds using \nGenAnswers = 2 billed messages . \n• Message Consumption rates : 1) Regular (Non -generative AI) = 1 message, 2) \nGenerative AI (Gen AI) answers over your data = 2 messages. Customers can use a \nmix of Regular and Generative AI messages.  \n• Gen AI – AI-enabled conversations  \n(Consumption rate of 2 messages  when Generative AI  is used ) \n\n4 \n • Copilot – Create and iterate chatbot topics using expanded natural language \ncapabilities .  \n• Power Automate for Copilot Studio - Create cloud flows (Automated, instant and \nscheduled flows) within the context of Microsoft Copilot Studio bots.    \n• Connectors - Standard, Premium and Custom connectors    \n• Dataverse for Copilot  Studio  \nDataverse default capacity    \no 5 GB Database Capacity    \no 20 GB File Capacity    \no 2 GB Log Capacity    \n \n3. How is Copilot Studio priced?  \nCopilot Studio capabilities are licensed via capacity packs, (1 capacity pack = 25,000 \nmessages/month). Capacity packs are priced at $200 per tenant/month. For additional \ncapacity, more capacity packs should be added.  \n \nCustomers will be charged according to the consumption of “billed messages,” the \ncommon currency across Copilot Studio capabilities. A billed message is a request or \nmessage sent to the copilot triggering an action and/or response.  \nMessage Consumption rates  \n• Regular (Non -generative AI) = 1 message  \n• Generative AI (Gen AI) answers over your data = 2 messages  \n \nExamples  \na. User asks copilot when a store"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": " is open, and copilot replies with store hours = 1 \nbilled message  \nb. Copilot proactively greets the user on a website = 1 billed message  \nc. User asks copilot for store hours for the upcoming holiday, copilot responds \nusing GenAnswers = 2 billed messages  \n \nCustomers can use a mix of Regular and Generative AI messages.  \n \nPlease see the AI Builder and Copilot Studio Discounting changes located here. \n \n4. When were  customers able to transact Copilot Studio ? \n \n• December 1, 2023 - Public GA  \no Customer Audience: Commercial, WW Govt (VL) GCC, GCC High, EDU - \nFaculty, Charity   \no Channels: VL, CSP, Web Direct   \n \n• November 15, 2023  – Rebranding: New product name “Copilot Studio” \nannounced at Ignite (formerly Power Virtual Agents)  \n• October 1, 2023  - Lead status  (VL) SKUs  \no Customer Audience: Commercial, Pub Govt, EDU  \n5 \n o Channels: VL  \n \n5. What are  the Copilot Studio VL and CSP SKUs?  \n  VL Part Number  CSP Product ID -SKU ID  \nCopilot Studio Sub (Messages)  YFI-00001  CFQ7TTC0LH1F -00001  \nCopilot Studio Legacy USL Sub Per User  SYS-00001  CFQ7TTC0LH1F -000P  \n \n6. What are the new Gen AI enabled conversations feature s of the new Microsoft \nCopilot Studio?  \nGenerative answers can be used as primary information sources in your chatbot, or as \nfallback when authored topics are unable to address a user's query. As a result,  you can \nquickly create and deploy a functional bot, without having to manually author multiple \ntopics that may not address your customer's questions.  \n(Note: Consumption rate of 2 messages applies when Generative AI is used. )   \n \n7. What is the difference between Copilot Studio Generative Answers and prior Power \nVirtual Agents bots capabilities?  \nPower Virtual Agents capabilities and features are now part of Copilot Studio following \nsignificant investments in generative AI and enhanced integrations across Microsoft \nCopilot  Studio . Read the blog here:  https://aka.ms/M CSblog2  \n \nIn the past, when a bot could"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "n't determine a user's intent, it asked the user to rephrase \ntheir question. If, after two prompts, the bot still couldn't determine the user's intent, the \nbot escalated to a live agent by using the  system  Escalate  topic .  \n \nNow, before involving a live agent, the bot uses natural language processing (NLP) to:  \n• Parse what a user types to determine what they are  asking . \n• Find, collate, and parse relevant information from a specified source (for example, \nyour company's website) or from multiple sources, including SharePoint and \nOneDrive for Business.  \n• Summarize  search results into plain language that is delivered to the bot user . \n \n8. Will customers licensed for the old Power Virtual Agents SKU have rights to \ngenerative answers?  \nNo, generative AI -enabled conversations are only available to customers licensed with \nCopilot Studio.  \n• Customers who purchased the Power Virtual Agents lead status SKU after October \n1, 2023,  will be licensed for Copilot Studio and have rights to Gen AI enabled \nconversations.  \n• Customers who purchase the new Copilot Studio SKU starting December 1, 2023, \nwill have rights to Gen AI enabled conversations.  \n• See the Copilot Studio transitions  section of this documents for more information.  \n \n9. What were the old Power Virtual Agents offer  entitlements, for comparison?  \n6 \n Customers licensed with  Power Virtual Agents  subscriptions, purchased prior to October 1, \n2023, have the following Power Virtual Agents  license entitlements.  \n \n10. What happened to the Power Virtual Agents add -on? \nThe new Copilot Studio offers a single capacity SKU, removing the need for a different \ncapacity add -on. End of Sale for the Power Virtual Agents capacity add -on was January 1, \n2024 . Please see Transitions > Microsoft Copilot Studio  for more information.  \n \n11. What options are available to customers with existing agreements that include \nPower Virtual Agents licenses and are priced higher than the new Copilot Stu"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "dio \npricing?  \nCustomers with the old Power Virtual Agents SKU need to work with their Commercial \nExecutives (CEs) to understand their options to move to the  new SKU at anniversary or at \nrenewal based on the terms of their current contract.  \n \n12. Will partners be able to sell the new Copilot Studio  offer ? \nPartners have been  able to transact these offers through CSP since GA,  December 1, 2023.  \n \n13. What is the main difference between Copilot Studio full licenses, Copilot Studio in \nCopilot for Microsoft 365 and Copilot Studio for Teams?  \nThe main difference among the different Copilot Studio Plans is with the channels where \nyou publish your conversational experience.  \n• With the full  Copilot Studio license,  you can publish on any channel (internal or \nexternal) and build standalone business to customers (B2C) or business to \nemployees’ (B2E) copilots. The full Copilot Studio offer is sold in capacity packs \npriced at $200 per tenant/month. Each capacity pack inc ludes 25,000 messages \nper tenant/month.  \n• With  Copilot Studio in Copilot for Microsoft 365 you cannot build standalone \ncopilots , you can only customize and publish plugins for the M365 Copilot \nchannel.  These limited Copilot Studio  use rights are included in Copilot for \nMicrosoft 365 licenses ($30 per user) and no additional purchase is required. Both \n\n7 \n the full Microsoft Copilot Studio and Copilot Studio in Copilot for M365  come \nwith standard, premium and custom Power Platform connectors.  \n• With  Copilot Studio for Teams,  you can publish in the Teams channel only. This \nis a light seeded license that does not include generative AI or premium \nconnectors and is typically used for simple conversational experiences only. Use \nrights are a benefit of select  M/O365 licenses.  \n \n14. If a customer has licensed their users with Copilot for M icrosoft 365, are these users \nlicensed to use Copilot Studio in Copilot for Microsoft 365 ? \nYes, users licensed with Copilot for Microso"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "ft 365 can create plugins for Copilot in \nMicrosoft 365.  \n \n \nSummary of Copilot Studio Licensing  \n \nSee the License Transitions  section of this FAQ for details on license transitions to \nMicrosoft Copilot Studio for customers with existing Power Virtual Agents licenses.  \n \n15. What are some scenarios for how these different types of licenses can be used?  \nBelow are some  licensing scenarios . \n  Copilot Studio Use rights included in  \nPlans  Microsoft Copilot Studio  \n$200 per tenant/month  Copilot Studio in Copilot \nfor Microsoft 365  Copilot Studio for Teams \n(Previously PVA for Teams)  \nThe output \nyou create \nis… Your own copilot  Plugins for Microsoft \nCopilot  Teams chatbot  \n\n8 \n Example \nScenarios  Host your own copilot on \nany channel for employees:  \n• HR Copilot on \nSharePoint to help with \nonboarding, benefits etc.  \n• IT Services copilot on \ncustom IT employee \nwebsite.  \n \nCustomer facing copilots \non web, social media etc.  \n• Account Management  \n• Order management  \n• Find your product  \n• Manage bookings  Only consumed via \nMicrosoft Copilot UI  \nHorizontal Workflows \nbacked with automation:  \n• Expense management  \n• Vacation requests  \n• Reset my password  \n• and much more  \nAlso, specifically \ndesigned responses \nfor scenarios like:  \n• Legal requests  \n• HR sensitive topics  \n• Finance/compliance \nrequests  Simple chatbot published to a \nTeams Channel or Chat.  With \nstandard connectors.  \nExamples:  \n• Chatbot that can call a \nSharePoint table and retrieve a \nresponse (Standard connector)  \n• Ask the chatbot to send an \nemail and a meeting request \n(Standard connector)  \n \n \n16. Are there any changes to the existing Copilot Studio for Teams (previously PVA for \nteams) ?  \nThere are no changes in entitlements to Copilot Studio for Team (previously known as PVA \nfor Teams). Copilot Studio for Teams is a light seeded license that does not include \ngenerative AI or premium connectors and is typically used for simple conversational \nexperienc"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "es. Use rights are included in : \n• Office 365 E1,  E3, E5, F3 \n• M365 Business Basic, \nStandard, Premium  • Microsoft 365 F3, E3, E5  \n• Office 365 A3, A5  \n• Microsoft A3, A5  \n \n \nPower Apps Premium  \n17. What are the pricing and licensing details for  Power Apps Premium ? \n• List price  (USD) : $20 per user/month , (or $12 per user/month with 2,000 or more \nnew Power Apps Premium licenses ). \n• Entitlements: Licensed per user, Power Apps Premium e ntitles the licensed user to \nbuild, modernize, and run unlimited custom applications and access unlimited \nwebsites.  \n \n18. What is the difference between the legacy Power Apps per user offer and the Power \nApps Premium  offer ? \nThere is no difference between these two offers, Power Apps per user has simply been \nrenamed “Power Apps Premium. ” \n \n19. Is Power Apps Premium  still available for $20 and $12 with 2,000+ new per user \nlicenses?  \nYes, this pricing is still available.  \n \n20. Is there special  EDU: Faculty and Student pricing for Power Apps  Premium ? \n9 \n Yes, here are  the offer details . Note that  the Dataverse entitlements are less than with the \ncommercial Power Apps Premium offer . \n• Faculty offer  - $4 per user/month, with a minimum of 300 new seats  \n(50MB Dataverse Database capacity , 400MB Dataverse File capacity ) \n• Student  offer - $1 per user /month, with a minimum purchase of 500 new seats  \n(20MB Dataverse Database capacity , 160MB Dataverse File capacity )  \n \n21. Is Power Apps per app still available?  \nYes, Power Apps per app entitles licensed users to 1 app or 1 website  in a specific \nenvironment . It is available for $5 per user/month via CSP , VL and Direct (via the M365 \nadmin center ).  \n \n22. Is there a Frontline  Worker (FLW) version of Power Apps  available to customers ? \nYes, there is a special  Power Apps FLW per user offer .  \n \n23. Are there specific requirements for eligibility to purchase this FLW license?   \nYes, these are the requirements.  \na. Licensed FLW user must"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": " meet the requirements for License Eligibility for Frontline \nWorker (FLW) Licenses  per the Microsoft Product Terms .  \nb. Customer must  own equivalent amounts of the F-SKU licenses (MF1/MF3/OF3) . \nc. A minimum purchase of 2,000 licenses is required . \n \n24. Is there Dataverse and AI Builder capacity included in the Power Apps FLW license?  \nNo, there is no Dataverse or AI Builder capacity included in this license.  \n \n25. How does the Power Apps FLW per user license compare to the Power Apps \nPremium license?  \nPlease see the comparison table below.  \n \n\n10 \n Power Automate Premium  \n \n26. What are the pricing and licensing details for Power Automate  Premium ? \n• List Price  (USD) : $15 per user/month  \n• Entitlements: Licensed per user, Power Automate Premium e nables licensed users \nto automate modern applications via API -based digital process automation , DPA  \n(cloud flows) and legacy applications via UI -based robotic process automation \n(desktop flows) in attended mode . It also includes full Process Mining desktop \nfunctionality and a limited amount of Process Mining data storage (50MB per \nuser license up to 100GB per tenant ). 5,000 AI Builder service credits are included \nwith this offer.  \n \n27. What happens to customers that currently have the $15 per user SKU today? Do they \nautomatically get this new Premium SKU?  \nNo, customers with the $15 per user SKU need to work with their CEs to  understand their \noptions to move to the new SKU at anniversary or renewal based on the terms of their \ncurrent contract.  \n \n28. Does a user need additional Premium licenses to work in dev, test and production \nenvironments?  \nNo, a Premium license is a per user license that licenses the user to work in dev, test and \nproduction environments.  \n \n29. How does the Power Automate Premium offer compare to the Power Automate per \nuser with attended RPA offer ?  \nThis new Power Automate Premium offer  includes all the benefits of Power Automate per \nuser with attended "
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "RPA (which includes DPA and attended RPA capabilities ), plus Process \nMining visualize and analyze processes capabilities  and 50 MB of Process Mining data \nstorage . Power Automate Premium  is offered at $15 per user/month  compared to the \nprevious $40 per user/month cost .  \n \n30. Does this offer  allow for unattended  RPA?  \nNo, this offer  only includes attended  RPA. For unattended RPA, please license  Power \nAutomate Process.  \n \nPower Automate Process  \n \n31. What are the pricing and licensing details for Power Automate Process ? \nList Price (USD): $150 per bot/month  \nEntitlements: Licenses an autonomous bot that runs unattended robotic process \nautomation, or a core business process (e.g., invoice processing or HR onboarding) that \ncan be accessed org -wide without licensing individual users.   \na. 5,000 AI Builder service credits  \nb. 50MB Dataverse database capacity  \n11 \n c. 200MB Dataverse file capacity  \nNote: Any software automated with an unattended  bot may require additional licensing \nper software terms. For example, unattended RPA scenarios incorporating M/O365 require \nthe Microsoft 365 - Unattended License. Please see the Product Terms  for more info.  \n \n32. How is a “core business process ” defined?  \nCore  business processes  are mandatory to the normal operation of the business.   \nSome examples are invoice processing, employee onboarding, purchase order s etc.  \nThese processes can vary in size and complexity, ranging from small -scale initiatives to \nlarge -scale endeavors spanning multiple flows interconnected by shared data sources. For \nexample, the invoice processing process has multiple flows from  handling an invoice to \ncreation through approvals to payment. All the se flows are part of one business process  \nand require one process license . \n  \nBy obtaining a process license, organizations will ensure that all the flows within the \nbusiness process are appropriately licensed. This enables the deployment and \nmanagement of inter"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "connected flows as a cohesive unit, facilitating Application Lifecycle \nManagement (ALM) and optimized performance.  \n \n33. My process has multiple flows. Will I need multiple process licenses?  \nNot necessarily. A core business  process may have multiple flows . So long as the flows are \nin context of the process , as described below, they are covered by the process license.  The \ninvoice processing  example above describes  multiple flows  involved in  handling an invoice \nfrom creation through approvals to payment. All the flows are part of one business \nprocess as they are all handling an invoice through multiple steps to closure. You only \nneed one process license for a core business process.  Flows that are not in context of a \ngiven process will require a separate license.   \nFor a single process - Identify the top-level flow that starts the process and assign the \nprocess license to that flow. Tag all  other flows  for that process  as in context of the flow \nwith the process license. Flows for a single process can be organized as parent flows \n(triggering a child flow), child flows (triggered by a parent flow) .  \nNote: Ability to tag flows as in -context to a process  is coming soon in the Power Automate \nmaker portal.  \n34. My solution has multiple processes. Do I need multiple process licenses?  \nYes, every process requires a single process license . A single  solution  can have multiple \nprocesses each process needs  to be licensed separately .  \n \n35. How many process licenses do I need?  \na. If your process only needs cloud flows ( Digital Process Automation ): \nUnderstand h ow many core business processes you want to automate .  \nPurchase one process for every core business process. Some examples of core \n12 \n business processes are invoice processing, HR onboarding etc. All cloud flows related \nto the same business process are included in the license  per the explanation above . \n \nb. If your process needs  unattended RPA (which generally  also requ"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "ires  cloud \nflow s but not vice versa ):  \nPurchase one Process license for each machine. You can add more Process licenses if \nyou need concurrent execution on the machine. All unattended  desktop flows  (RPA) \nrunning on the machine and cloud flows  (DPA) that are part of the business process \nare covered by the Process license . \n \nPlease note : Any software automated with an unattended bot may require additional \nlicensing per software terms. For example, unattended RPA scenarios incorporating \nM/O365 require the Microsoft 365 - Unattended License. Please see the Product \nTerms  for more information . \n  \n36. Are there minimum purchase requirements for Power Automate Process ? \nNo, there are no minimum purchase requirements.  \n \n37. Are there licensing prerequisites required for eligibility to purchase Power Automate \nProcess?  \nNo, there are no licensing prerequisites required for eligibility to purchase Power \nAutomate Process.  \n \n38. In what  other scenarios might  I need this process license , other than for unattended \nRPA or for core business processes / cloud flows that need to be accessed by multiple \nusers in an organization?   \na. Your flows are running under Application user, where the flow 'owner' is a Service \nprincipal account . \nb. Your Flow uses premium connectors, and your organization has many guest users \nusing the flow, but you do not  know if the guest users' home tenant provides \nthem with premium licenses.  \n \nPower Automate Hosted Process  \n \n39. What are the pricing and licensing details for Power Automate Hosted Process?  \n• Offer overview : Power Automate Hosted Process offer replaces the Power \nAutomate Hosted RPA add -on. It has all the capabilities of the Power Automate \nProcess license but also includes a virtual machine managed and hosted by \nMicrosoft. Unlike the Hosted RPA offer, the Hosted Process offer is not an add -on \nand has no prere quisites . \n• List Price:  $215 per bot/month  \n• Cloud flows (DPA), Business Process fl"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "ows , Unattended desktop flows (RPA) and a \nMicrosoft hosted machine.  \n13 \n • Sharing and collaboration : Other users can view, edit or run automations.  \n• Power Platform c onnectors : Standard, Premium and Custom connectors    \n• AI Builder service credits : 5,000 service credits/month (Cap on accrued capacity \n1,000,000 credits per tenant. Additional AI Builder capacity can be purchased per \n1M service credits for $500/month via the AI Builder capacity add -on.) \n• Dataverse Accrued capacity:  Dataverse Database 50 MB, Dataverse File 200 MB  \n• Managed Environments : Manage Power Platform at scale with more control, less \neffort, and more insights.  \n \n40. When will Hosted Process be available to purchase?  \nPower Automate Hosted Process will be generally available on May 1, 2024 . \n \n41. Is the Hosted Process offer available worldwide?  \nYes, the Hosted Process is  available to all geographies worldwide. Please see specific \ngeographical availabilities/restrictions for hosted machine group s and hosted \nmachines . \n \n42. For which customer segments is Hosted Process available?  \nHosted Process is available to Comm ercial, GCC, GCC High, PubGov, GOVCON, Faculty  \nand Student segments.  \n \n43. How is Hosted Process different from the Hosted RPA Add -on? \nHosted Process is a full license with no license prerequisites, and it is a brand -new SKU  \nthat will replace the Hosted RPA SK U. Pricing is the same for both SKUs, $215 per \nbot/month USD ERP.  \n \nHere is a list of entitlements that will be included with both licenses.  \n• Cloud flows  \n• Other users can view, edit or run automations  \n• Standard, premium and custom connectors,  \n• On prem and cloud services data transfer,  \n• Dataverse use rights  \n• Dataverse accrued capacity  \n• Managed environments  \n \n44. The license entitlements for the Power Automate Hosted Process license are \nalmost identical to the Power Automate Process license except Hosted Process \nincludes a Microsoft hosted machine. Can the Host"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "ed Process license be used as a \nProcess license to allo cate a bot to a customer machine?  \nYes, Hosted Process can be used as a Process license to allocate a bot to a customer \nmachine.  \n \n45. How are the bots hosted?  \nThere are two Hosted Process scenarios supported.  \n14 \n • For the hosted machine group  scenario, the bots are hosted with Azure virtual \nmachines leveraging  Virtual Machine Scale Sets  (VMSS). VMSS is an  Azure \nCompute  resource which can be used to deploy and manage a set of identical \nVMs providing  (up to 1000 VMs) by spreading VMs across fault domains in a \nregion or within an Availability Zone.  \n• For the hosted machine  scenario the bots are hosted by  Windows 365 , \nproviding remote desktop connectivity, VM image and virtual network support, \nand integration with Microsoft Intune.  \n \n46. Is there a trial version of Hosted Process?  \nYes, trial users with the 90 -days self -assisted premium trial can have:  \n• For hosted machine group scenario, up to two bots running in parallel in a \ngiven environment  \n• For hosted machine scenario, one hosted machine in a given tenant  \nTo start a trial, customers can go to the Power Automate  pricing page  and select \nthe Try free  link or navigate to the Microsoft Power Automate Free page  here.  \n \n47. What action is required of  Hosted RPA add -on customers who need to obtain the \nvalue of the Hosted Process license?  \nThere is no action required , the Hosted RPA add -on will be treated as a Hosted Process \nlicense.  \n \n48. With removal of the prerequisite requirement, do customers still need the \nPremium user license when using Hosted Process?  \nYes, the  Premium user license is still required to run attended desktop flows , develop \ndesktop flows using Power Automate desktop, and for other capabilities mentioned \nhere Premium RPA features - Power Automate . The general recommendation is that \nyou should purchase a Premium user license for each person using attended RPA , for \nevery RPA develop"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "er and for every RPA tester  on the team.  \n \n49. When Hosted Process is used by businesses for production use, is automatic \nscaling and dynamic load balancing  included ? \nYes, Hosted Process includes Automatic scaling to manage peaks with machines that \nspin up and down to optimize efficiency . In addition,  Hosted Process includes  Dynamic \nload balancing to optimize resources between processes, teams and organizations  for \nhigher efficiency and lower cost.  \n \n50. Are Power Automate per user, and the Power Automate unattended RPA add -on \nstill available?  \nYes, these licenses are available at this time, but will be removed at a date TBD. There \nare existing licenses that offer the same and additional value at the same price point.  \n \n• Power Automate per user $15 per user/month  \n• Power Automate Premium $15 per user/month  \n15 \n • Unattended RPA Add -on $150 per bot/month  \n• Power Automate Process $150 per bot/month  \n \n \nPower Automate Process Mining  add-on \n \n51. What are the pricing and licensing details for the Process Mining  add-on? \n• List Price  (USD) : $5,000 for 100  GB of data stored/month  \n• Qualifying prerequisite:  Power Automate Premium. Multiple add -ons can be \napplied to a single pre -requisite.  \n• Additional Entitlements per capacity pack:  \no Dataverse Database capacity 2 GB/capacity pack  \no Dataverse File capacity 1 TB/capacity pack  \n \n52. When will Process Mining be available to purchase?  \nProcess Mining became generally available on August 1, 2023 .  \n \n53. For which audiences is this offer available?   \nProcess Mining subscriptions are available  to Commercial, GCC, GCC High, DOD, \nGOVCON (VL only), Non -profit, Faculty and Students.  \n \n54. Will this offer be available worldwide?  \nYes, Process Mining is available to all geographies worldwide.  \n \n55. What field empowerment is available for Process Mining?  \nAs an add -on, Power Automate Process Mining is eligible for Standard Field \nEmpowerment # 947. \n \n56. Does Process Min"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "ing qualify for the BizApps Sponsored Offer Program?  \nAs of GA on 8/1 /23, the Power Automate Process Mining add -on was included in the \nBizApps Sponsored Offer Program. For customers with an MSX Opportunity ID and a \nminimum  Annual Contract Value  (ACV) of $35K (USD), the program unlocks an \nadditional process mining capacity for up to 250 users, provides  100 GB of data stored  \nfor 60 or 90 days . There is a limitation of one add -on per tenant. Customers can be \nnominated using this form  Sponsored  Offer  Program  (sharepoint.com) . \n \n57. Are there any limits to the number of users per tenant?  \nNo, there is no limit to the number of users per tenant.  \n \n58. Will Process Mining use rights come with any other Power Platform or Dynamics \n365 licenses?  \nProcess Mining Desktop capability and limited amount of Process Mining data storage \ncapacity is included with the Power Automate Premium per user offer. We will update \nthe Process Mining use rights as product truth matures in other Power Platform and \nDynamics 365 products.  \n16 \n 59. Are Power BI Pro, Power BI Per User or Power BI premium capacity licenses \nrequired for this solution? If so, do any Power BI limitations come into play or is \nthere a package price?  \nPower BI licenses are not included in Power Automate Process Mining. In order to \ncustomize and analyze your process mining results further, you may want to acquire \nadditional Power BI Pro*, Power BI per user or Power BI premium capacity licenses if \nyou hav e not already done so. Pricing & Product Comparison | Microsoft Power BI  \n*Please note, Power  BI Pro is included  in Microsoft  365 E5 and Office 365 E5  \n \n60. Can customers use the Power Platform Admin Center (PPAC) to assess their \nhighest monthly Process Mining usage?  \nYes, customers can assess their highest monthly Process Mining usage to understand \ncapacity needed. Current and past usage data are available in the Power Platform \nAdmin Center (PPAC) . \n \n61. How much capacity shoul"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "d I purchase if my company has occasional spikes?  \nCapacity should be purchased for the peak utilization over a 12 -month contract period. \nIf customers experience monthly or seasonal spikes, they must purchase enough \ncapacity to allow for this high \"watermark” when estimating the amount of capacity \nneeded per month.  \n \n62. How much process mining capacity is included in the Power Automate Premium \nlicense?  \nCustomers that purchase the Power Automate Premium license will be able to use \nentitlements for task mining and limited data storage for process mining ( up to 50 MB , \nwith an accrued capacity cap of 100 MB per tenant ) at no additional charge.   \n63. Is there a trial version of Power Automate Process Mining?  \nYes, Process Mining offers a free 30 -day trial giving access to many of the key features \nof Process Mining. The free Process Mining trial is included in the Power Automate trial \navailable here.  \n \n64. How much Process Mining capacity is included in the Power Automate Premium \ntrial?  \nThe Power Automate Premium trial will include 100 MB of Process Mining stored data \nper process. For more storage capacity purchase the Process Mining license.  \n \n65. Can dashboards be created in the Power Automate trial?  \nTo be able to build a dashboard, a Power BI Premium license is required.  \n \n66. Is this information externally facing? Where can customers find more \ninformation?   \nThis is an internal FAQ, not to be shared with customers or partners.  Customer facing \ninformation is available on the Power Automate pricing page at Pricing | Microsoft \nPower Automate .  \n17 \n Power Automate per user  \n \n67. What are the pricing and licensing details for Power Automate per user? \n• List Price (USD): $1 5 per user/month  \n• Entitlements:  equips licensed  users to create and run unlimited workflows and \nbusiness processes based on their unique needs. The per user license is intended \nto support the broad adoption of an automation culture in an organization. \nSh"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "ould the entire organization be licensed with the  Power Automate per user, \nadmins will have minimal overhead with tracking how many flows are being \nactivated and used within the organization.  \n \nPower Automate per flow  \n \n68. What are the pricing and licensing details for Power Automate per flow ? \n• List Price  (USD) : $100 per flow/month  (minimum purchase 5 licenses)   \n• Entitlements: Licensed by flow allowing  customers to implement critical business \nprocesses with capacity that serves teams, departments, or the entire organization \nwithout individually licensing each end user that triggers the licensed flow   \no Multiple hosted RPA add -on licenses can be added with a single qualifying \nbase license.  \no Multiple hosted RPA add -on licenses can be added with a single qualifying \nbase license.  \no All types of enabled top -level flows need to be licensed (scheduled flows, \nautomated flows, instant flows, and business process flows). Flows that are \nonly used as “child” flows (triggered by another flow) do not need to be \nadditionally licensed.  \no Should customers wish to license more top -level flows, they should \npurchase more units of the “Power Automate per flow.”  \nNote: scheduled flows may be configured to trigger every minute, irrespective \nof license type. There are no limits on the frequency of flow runs beyond what \nthe connector supports . \n \nPower Automate unattended RPA add -on \n \n69. What are the pricing and licensing details for Power Automate Unattended RPA \nadd-on? \n• List Price  (USD) : $150 per bot/month   \n• Entitlements:  Enables a bot to run autonomously, i.e., independent of a user. \nUnattended bots can be deployed on a local, remote desktop, or other virtualized \nenvironment. 5,000 AI Builder service credits are included with this offer.  \n• Power Automate Premium  or Power Automate per flow qualify as  base licenses for \nthe unattended RPA add -on. Multiple unattended RPA add -on licenses can be \nadded with a single qualifying bas"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "e license.  \n18 \n 70. Can these Power Automate licenses be used in any environment and any tenant \nor are there limitations?  \n• Power Automate Premium and Power Automate per user  - one license allows \nuser or capacity to use in any environment in the tenant.  \n• Power Automate Process, Power Automate per flow, Power Automate Hosted \nRPA add -on and Power Automate unattended RPA add -on - One license allows \nthe bot or process to be used in a single environment. An additional license is \nrequired if the same bot or process is deployed in a different environment.  \n• Process Mining  - is a capacity -based license  per tenant.  \n• Power Automate unattended desktop flow run meter and Cloud flow or \nattended desktop flow run meter  - Flow runs are per pay -as-you-go environment  \n \n \nPower Automate Technical Enforcement  \n \n71. How is  technical enforcement for Power Automate  changing ? \nWe will begin fully implementing technical enforcement for subscriptions , starting from \nthe following two major categories of non -compliance:  \n \nPower Apps or Dynamics seeded context  \nPower Apps licenses and Dynamics licenses include a limited set of Power Automate \ncapabilities that allow the users to run flows that are in context of the Power App. \nPlease review the Power Automate Use Rights for proper usage scenarios (see   \nMicrosoft Power Platform Licensing Guide for details ).  \nWith the upcoming technical enforcement, admins and makers get notifications and \ncan view reports of premium flows  created outside of the context of Power Apps or \nDynamics. They can purchase Power Automate licenses within the grace period to stay \ncompliant. In cases where the flow is  created to support the Power App  and follows \nthe below guidance  that makers or admins can associate the flows to be in the Power \nApp to stay compliant .  \n \nPower Automate use rights included with Power Apps licenses  \nPower Apps Premium and Power Apps per app  include Power Automate use rights for \nthe purpose"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": " of automating workflows associated with Power Apps application s.  \n \nPower Automate use within Power Apps is limited to the context of the Power Apps \napplication. What this means is that for both triggers and actions, flows included \nwithin a Power Apps application connect to:  \n• Any data source within the use rights of the Power Apps application  \n• Directly with the Power Apps application (via built in trigger/action)  \n \nPower Automate use rights with Dynamics 365 licenses  \nDynamics 365 licenses include Power Automate use rights for the purpose of \ncustomizing and extending Dynamics 365 application(s). Power Automate use within \n19 \n Dynamics 365 is limited to the context of the embedding Dynamics 365 application. For \nboth triggers and actions, flows included within the Dynamics 365 application can \nconnect:  \n• To any data source within the use rights of the Dynamics 365 application  \n• Directly with the Dynamics 365 application (via built in trigger/action)  \n \nIf the embedded flow is not within the context of the Dynamics 365 application, then \nPower Automate licenses will need to be purchased.  \nAfter enforcement, the following are considered in context and will not be charged:  \n• Flow owner has Dynamics 365 license, and the flow was using Dynamics 365 \nentities  with a Dataverse connector  or using first party connectors  and the \nenvironment has a Dynamics 365 app installed  \n• Flow owner has Dynamics 365 app license and using first party connectors  \n• Flow was associated with a Dynamics 365 app either via admin power shell or \nPower Automate maker portal.  \n \nThe following is not considered in context , and any flow runs will be charged:  \n• The Flow owner has a Dynamics 365 app license, the flow is an \nautomated/scheduled flow and is not associated with a Dynamics 365 app  either \nvia admin power shell or Power Automate maker portal  \n \nAs we move forward with technical enforcement of the Power Automate changes in \nFY23, please be aware of the fol"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "lowing upcoming dates and milestones .  \nNote: These enforcements are deployed a geo region at a time . Dates below  are for \nthe earliest region s. \n• Starting September 15, 2023  – Admin notification of upcoming enforcement for \nnew and existing flows: customer tenant admins will start getting notifications in \nPower Platform Admin Center ( PPAC ) explaining the licensing enforcement. \nAdmins will be able to view reporting on their usage in the PPAC and \nnoncompliant flow reports. Admins can view the reports from a power shell \ncommand .   \n• Starting October 15 , 2023  – Maker Notification of upcoming enforcement for new \nand existing flows:   \no Any new noncompliant prepaid flows created on and after October  15th \n(either are out of the context of Power Apps/Dynamics or are running without \nproper paid licenses) will be saved and stopped until proper licenses are \napplied.  \no For existing noncompliant prepaid flows that are out of the context of Power \nApps/Dynamics and are created before October 15th, flow makers and co -\nowners will start seeing in -product and email notifications on non -compliance \non October 15th  and will have a grace period of 90 days until February 15th \n(adjusted  to avoid business interruptions during holiday time) , to review and \npurchase additional licenses. Makers will also have the option to request a \nlicense from their admin.   \n20 \n o For existing noncompliant prepaid flows that are running without proper paid \nlicenses and are created before October 15th , flow makers and co -owners will \nstart seeing in -product and email notifications on non -compliance on \nNovember  1st and will have a grace period of 15 days to review and purchase \nadditional licenses. Users will also have the option to request a license from \ntheir admin.   \no We encourage customers with noncompliant Power Automate usage to \nevaluate their licenses need to ensure compliance and purchase additional \nlicenses,  as necessary.  \n \n72. What is the customer  "
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "impact ? \nAll flows running outside of the context of Power Apps or Dynamics and  all premium \nflows created by users but without assigned licenses will be impacted by this change.  \n• Customers should be aware that any new flow created outside of the context of \nPower Apps or Dynamics and any new flow without premium licenses will be \ncharged or stopped.  \n• Customers with existing noncompliant flows will need to re -evaluate their licensing \nfootprint and potentially purchase valid Power Automate licenses. If admins fail to \ndo this, under different grace periods, the noncompliant flows will be charged or \nstopped .  \n \nTo prepare for this, admins can view telemetry on noncompliance usage reporting \nthrough Power Shell  and PPAC. Additionally, we recommend that customers review the \nPower Automate Use Rights (see  Microsoft Power Platform Licensing Guide  for details) \nto re -evaluate their licensing footprint.  \n \n73. How is a flow categorized as “in context” vs. “out of context”?   \n“In context” means the flow talks to the same data sources of a Power App or the flow \nis directly invoked by a Power App.   \n  \n74. When a customer sees a noncompliant maker notification in the Power Automate \nflow, and creates a new Power App connecting to the same data source , will this \nflow be compliant now?  \nIf a Power App is created to bypass Power Automate licensing, it is not viewed as \ncompliant. But if the Power App is actively used, it is considered to be compliant.  \n  \n75. What should customers do right now?  \nCustomers should first determine if their flows are compliant or not . Customers should \nlook at the usage in the  Power Platform admin center  and the noncompliant report in \nthe Power Platform admin center  and Power Shell  to understand the impact (i.e. \nidentify any Power Automate licensed users who are not in compliance with the  \nMicrosoft Power Platform Licensing Guide ). \n \n21 \n For any non-compliant  users, customers should re -evaluate their licensing "
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "footprint \nimmediately to potentially step them up to the corresponding Power Automate license. \nOnce the license enforcement is turned on, users running non -conformant flows will \nrun into charges after th e given grace period expires (if the scenario applies).   \n \n76. What happens to new flows after technical enforcement?  \nAny new flows  created outside of the context of Power Apps/Dynamics or without \npremium licenses will be charged or stopped . For subscription users, new non -\ncomplaint flows created on and after October 15th  will be saved and turned off until \nproper licenses are applied.  \n \n77. What happens to existing noncompliant flows?  \nFor existing noncompliant prepaid flows created before October 15th that are out of the \ncontext of Power Apps or Dynamics, flow makers and co -owners will start seeing in -\nproduct and email notifications on non -compliance on October 15, 2023,  and will have \na grace period of 90 days until February  15, 2024 (time adjusted to avoid interruptions \nduring holidays) to purchase additional licenses. Makers will also have the option to \nrequest a license from their admin.   \n \nFor existing noncompliant prepaid subscription flows created before October 1 5, 2024, \nthat are running without proper paid licenses, flow makers and co -owners will start \nseeing in -product and email notifications on non -compliance on October 15th  and will \nhave a grace period of 15 days to purchase additional licenses. Users will also have the \noption to request a license from their admin.   \n78. How can an admin or maker associate a flow to a Power App?  \nAdmins and makers have a  power shell command  to associate flows to the \ncorresponding Power Apps.  \n \n \nPower Pages  Authenticated user s \n \n79. What are the pricing and licensing details for Power Pages  Authenticat ed user s? \n• List Price  (USD) : Sold in capacity packs with tiered pricing   \n• Number of users per capacity pack:  1 capacity pack = 100 users  \n• Entitlements:  License"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "d by Authenticated users, the Power Pages authenticated \nusers license can be purchased for the anticipated number of unique, \nauthenticated users ( employees or non -employees ) accessing a website in a \nmonth  \n \n \n \n \n \n \n22 \n Authenticated per user/website capacity                                                                      Pay -as-you-go   \nCapacity Pack \nTiers  Minimum Purchase \nRequired  Number of users  \n(1 capacity pack = 100 users)  Price per capacity \npack/month  \nTier 1  1 capacity pack  100+ users  $200  \nTier 2  100 capacity packs  10,000+ users  $75 \nTier 3  1,000 capacity packs  100,000+ users  $50 \n \n80. How are Authenticated users defined?  \nAuthenticated users are users who obtain secure access to a website by logging in \nthrough an authentication provider on the website.  \n \n \nPower Pages Anonymous user s \n \n81. What are the pricing and licensing details for the Power Pages  Anonymous user \nlicense ? \n• List Price:  Sold in capacity packs   \n• Number of users per capacity pack:  1 capacity pack = 500 users  \n• Entitlements: Licensed by anonymous users, the Power Pages Anonymous users \nlicense can be purchased for the anticipated number of Anonymous users \naccessing a website in a month.  \nAnonymous per user/website capacity                                                                                                 Pay-as-you-go \nCapacity Pack \nTiers  Minimum Purchase \nRequired  Number of users  \n(1 capacity pack = 500 users)  Price per capacity \npack/month  \nTier 1  1 capacity pack  500+ users  $75 \nTier 2  20 capacity packs  10,000+ users  $37.50  \nTier 3  200 capacity packs  100,000+ users  $25 \n \n82. How are Anonymous users defined?  \nAnonymous users are users who access a website and do not log in.  \n \nNote: For Anonymous users, uniqueness is determined through a unique Anonymous \nuser ID stored in a browser cookie. This may result in counting the same physical users \nmultiple times because, if the user accesses the site using di"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "fferent browsers or devices \nor cleans up browser cookies, then a new unique Anonymous user ID is generated.  \n \n83. Are these offers available worldwide?  \nYes, Power Pages will be available to all geographies worldwide.  \n \n23 \n 84. Is there a tool to help sellers or customers determine how much Power Pages \ncapacity is needed?   \nCustomers  can assess their highest monthly (Power Pages/Power Apps portals) usage \nto understand capacity needed.  Current and past usage data are available in the Power \nPlatform Admin Center (PPAC) . \n \n85. What are the Power Pages use rights included with Power Apps and Dynamics \n365 enterprise licenses?  \nAuthenticated users licensed with Power Apps or Dynamics 365 enterprise licenses, are \ngranted use rights for Power Pages as described below.  \n• Power Apps Premium  licensed users – Unlimited Power Pages websites  \n• Power Apps per app licensed users - 1 Power App or 1 Power Pages website  \n• Dynamics 365 enterprise licensed users – Power Pages websites must map to the \nlicensed Dynamics 365 application context and map to the same environment as \nthe licensed Dynamics 365 application.  \n \n86. Is there a trial version of Power Pages?  \nYes, Power Pages offers a free 30 -day trial available here.  \n \n \nMicrosoft Dataverse  \n \n87. What are the differences between Dataverse default subscription capacity, \nDataverse accrued subscription capacity?  \n• Dataverse Default subscription capacity  - A tenant’s one -time Dataverse default \ncapacity entitlement is equal to the Dataverse default capacity entitlement* for \nfirst Power Apps, Power Automate, Power Virtual Agents or Power Pages \nsubscription license purchased. Additional subscriptions do not add to the \ntenant’s default capacity.  \n• Dataverse Accrued subscription capacity  - Accrued capacity is added to the \ntenant for every Power Apps, Power Automate and Power Pages subscription \nlicense purchased. This accrued capacity* is pooled across the tenant and shared \namongst relevant app"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "lication workloads.  \n \n88. What are the subscription capacity entitlements and list prices for Dataverse \nDatabase, Dataverse File and Dataverse Log Capacity add-ons? \nAdditional capacity can be added  via the Dataverse capacity add -ons. Subscription \nadd-ons apply across the tenant and are not tied to a specific user.  \n \nSubscription Capacity/tenant  Additional Increment  Minimum Quantity  Price  \nDataverse Database capacity add -on  1 GB  1 $40 USD ERP  \nDataverse Database capacity Tier 2 add-on 1 GB  1,000  $30 USD ERP  \nDataverse File capacity add -on 1 GB  1 $2 USD ERP  \n Dataverse Log capacity add -on 1 GB  1 $10 USD ERP  \n  \n24 \n 89. What are the Dataverse subscription capacity entitlements for the Power Apps \nPremium  offers for Education?  \n• Power Apps Premium  offer for Faculty  \no Offer is available with a minimum purchase of 300 licenses.  \no Dataverse Database Capacity – 50 MB per User Subscription License (USL)  \no Dataverse File Capacity – 400 MB per USL  \n• Power Apps Premium  offer for Students  \no Offer is avai lable with a minimum purchase of 500 licenses.  \no Dataverse Database Capacity – 20 MB per USL  \no Dataverse File Capacity – 160 MB per USL  \n \n90. What are the Dataverse default capacity for Power Platform pay -as-you-go \nenvironments ? \nEnvironments configured to use Power Platform pay-as-you-go, receive a one -time \nentitlement of 1GB of Dataverse Database and 1GB of Dataverse File capacity per \nenvironment. These entitlements do not change based on the number of users using \napps or custom websites in an environment. These pay -as-you-go environments do \nnot consume tenant -wide Dataverse capacity.  \nPay-as-you-go environments  Included per  \npay-as-you-go environment  \nDataverse Database capacity  1 GB  \nDataverse File capacity  1 GB  \nDataverse Log capacity  N/A \n \n91. How do Dataverse capacity meters work?  \nWith a pay -as-you-go enabled environment, Dataverse capacity meters can be used to \npay-as-you-go for Dataverse usage as al"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "ternatives to the existing subscription capacity \nadd-ons for overages. Dataverse pay -as-you-go capacity is billed based on the amount \nof capacity used in the environment, beyond the 1GB Dataverse Database capacity and \n1GB Datavers e File capacity entitlements per environment. No capacity is allocated for \nDataverse Logs.  \nDataverse Capacity/environment  Additional Increment  \nDataverse Database capacity  1 GB  \nDataverse File capacity  1 GB  \nDataverse Log capacity  1 GB  \n \n92. What are the Dataverse capacity entitlements for each Process Mining license ? \n \nEach license receives:  \n \nProcess Mining: $5,000 per GB of data stored /month  \nDataverse Database capacity/ license  2 GB  \nDataverse File capacity/ license  1 TB \n \n93. What are the Dataverse storage capacity entitlements  for Power Pages?  \n \n25 \n Power Pages Authenticated and Anonymous users  - Dataverse Database and \nDataverse File capacity is included with the Authenticated per user/website and the \nAnonymous per user/website licenses.  \n \nDataverse Default Capacity - Subscriptions     \nCapacity Type    Dataverse Database \nstorage  per tenant  Dataverse Database \nstorage per user  Dataverse File  \nstorage per user  Dataverse Log  \nstorage per user  \nAuthenticated  \nper users  5 GB    2 GB    16 GB    1 GB  \nAnonymous  \nper users   5 GB    500 MB    4 GB    250 MB  \n \nPower Apps and Dynamics 365 enterprise users  - Users with Power Apps and \nDynamics 365 enterprise licenses can use a Power Pages website on demand without \nrequiring any Authenticated user capacity.  \n \nAI Builder  Capacity add -on \n \n94. How is AI Builder licensed ? \nAI Builder is offered as a capacity add -on to Power Apps, Power Automate, and \nDynamics 365 Finance subscription licenses. The capacity add -ons are sold as capacity \npacks with three levels of tiered pricing.  \n \nEach capacity pack includes 1 million AI Builder service credits. Service credits are \npooled across the tenant and available service credits are deducted when"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": " AI Builder \nservices are used; (e.g. , if a customer requires 4.7 million service credits per month \nbased on anticipated usage, they should purchase 5 capacity packs.)  \n \n95. What is a \"service credit\" and how does it work?  \nAI Builder capacity is expressed in the form of “service credits”. Service credits serve as \nthe single (common) currency  across all the scenarios supported by AI Builder.  \nAvailable service credits are deducted when AI Builder services are used. AI capabilities \nconsume service credits. The amount of capacity consumed varies based on the AI \ncapability, size and complexity of the data set. See the AI Builder AI Builder rate card .  \n \n96. What are the tiered pricing levels for the AI Builder capacity packs?  \nCapacity Pack \nTiers  Capacity Packs  \nMinimum purchase  Price per capacity  \npack/month (USD)  \nTier 1  1 capacity pack  $500  \nTier 2  10 capacity packs  $375  \nTier 3  50 capacity packs  $250  \nSee the AI Builder and Copilot Studio Discounting changes located here. \n \n97. What are the license prerequisites for purch asing the AI Builder add -on? \nAI Builder requires a Power Platform environment which can be created using the \nfollowing subscription licenses.  \n• Power Apps Premium  • Power Automate Premium  \n26 \n • Power Automate Hosted RPA \nadd-on \n• Power Automate unattended \nRPA add -on • Dynamics 365 Finance  \n \n \n98. How do you purchase AI Builder capacity add -ons?  \nTo purchase the AI Builder service credit add -ons in the  Microsoft 365 admin center : \na. Select  Billing  > Purchase services . (Must be tenant billing administrator  to access ) \nb. On the  Purchase services  page, follow these steps:  \nc. Search for  AI Builder  > Select  Details  of the  AI Builder Capacity add -on tile \nd. Follow the purchase process.  \n \n99. How are the different capabilities in AI Builder priced?  \nEach AI Builder capability consumes service credits at different rates , see rate card.  \nAI Builder Rate Card  \nCapability  Operation  Type"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "  Service Credit  \nConsumption Rate  $ Equivalent Price per \nOperation1  \nAI prompts, Create \ntext with GPT 3.5  Real-time Prediction  Prebuilt  6 credits/1k tokens2 $0.003 / 1k tokens   \nDocument \nprocessing  Training  Custom  Free    \nReal-time Prediction  Custom  100 credits/Page  $0.05 / Page   \nReceipt, Invoice, \nIdentity document \nor Business card \nanalysis  Real-time Prediction  Prebuilt  32 credits/Page  $0.016 / Page   \nText translation  Real-time Prediction  Prebuilt  22 credits/1k chars  $0.011 / 1k chars   \nText analysis   \nSentiment analysis, \nLanguage detection,  Key \nphrase extraction  Real-time Prediction  Prebuilt  2 credits/1k chars  $0.001 / 1k chars   \n \nText analysis   \nCategory classification, \nEntity extraction  Training  Custom  Free    \nReal-time Prediction  Custom  20 credits/1k chars  $0.01 / 1k chars   \nReal-time Prediction  Prebuilt  20 credits/1k chars  $0.01 / 1k chars   \nText recognition \n(OCR)  Real-time Prediction  Prebuilt  3 credits/Image  $0.0015 / Image   \nImage classification  Training  Custom  Free (performed on -\npremises)     \nReal-time Prediction  Custom  4 credits/Image  $0.002 / Image   \nObject detection  Training  Custom  Standard: 10 \ncredits/Image  \nDomains: 160 \ncredits/Image for first 500 \nimages, then 10 \ncredits/Image  Standard: $0.005 / Image  \nDomains: $0.08 / Image for first \n500 images, then $0.005 / \nImage   \n \nReal-time Prediction  Custom  8 credits/Image (standard \nand domains)  $0.004 / Image   \nPrediction  Training  Custom  Free    \n27 \n Scheduled Prediction  Custom  1 credit/5 rows  $0.0005 / 5 rows   \nReal-time Prediction  Custom  10 credits/1 row  $0.005 / 1 row   \n \n \n \n100. How should a business determine how many capacity add -ons/service credits are \nneeded ? \nAI Builder capacity add -on units should  be purchased based on the anticipated usage \nof various AI Builder services.  Capacity should be purchased for the peak utilization \nover a monthly period. Unused service credits do not carry over mont"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "h to month.  \n \n101. Is there a tool to help a business understand consumption levels?  \nAdministrators can download an Excel capacity consumption report for the tenant  here. \n \n102. Can a tenant use the AI Builder capacity in any environment?  \nWhen a tenant has purchased AI Builder capacity, corresponding credits are by default \nunallocated and available as a pool in the tenant. In this state, credits can be used in \nany environment. The administrator can then restrict usage by allocating credits to \nspecific environments or to specific users. Alternatively, the admin can l eave part or all \nof the purchased capacity unallocated at the tenant level so that all environments \nwithout allocated capacity can consume these tenant -level unallocated credits.  \n \nAllocation  (assignment) of purchased capacity to appropriate Power Automate, Power \nApps applications and Dynamics 365 workloads is managed via the Power Platform \nadmin center  (PPAC) . Allocation  helps ensure capacity for critical AI models. The \nminimum capacity to be allocated  is 1 service credit.  In September  2023, t enants will  be \nable to block use of unallocated credits by modifying a setting PPAC .  \n \n103. Can AI Builder capacity be added to the P1 and P2 offers for Power Apps and \nPower Automate that are being retired?  \nYes, AI Builder capacity can be added to the P1 and P2 offers for Power Apps and Power \nAutomate for customers who haven’t yet transitioned to the Power Apps and Power Automate \noffers.  \n \n104. Which Microsoft products include AI Builder service credits*?  \n• Power Apps per app  – 250 service credits/month  \n• Power Apps Premium  - 500 service credits/month  \n• Power Automate Premium  – 5,000 service credits/month  \n• Power Automate Process  – 5,000 service credits/month  \n• Power Automate  Unattended RPA add -on - 5,000 service credits/month  \n• Power Automate Hosted RPA add -on - 5,000 service credits/month  \n• Dynamics 365 Finance  – 20,000 service credits/month  \n* Additio"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "nal AI Builder capacity can be purchased per 1M service credits for \n$500/month via the AI Builder capacity add -on.   \n 1 Disclaimer: Pricing based on Tier 1 pricing. $ Equivalent price per operation shown only for guidance based on List Price.  \n2 This includes both input tokens (customer + system prompts) and output tokens (result). For common English text, 1000 tokens = ~700 words.  \nSee https://platform.openai.com/tokenizer.   \n \n \n28 \n More information on integrating AI Builder with Power Apps and Power Automate is \navailable  at https://learn.microsoft.com/en -us/ai -builder/overview#add -intelligence -to-\nyour-business .  \n105. Are there caps on accrued AI Builder service credits capacity?  \nYes, there is a cap of 1,000,000 service credits /tenant  for Power Apps and Power \nAutomate . \n \n106. What can I do with the 5,000 AI credits included in Power Automate  Premium ? \nEach user license grants 5,000 credits, to assess the capabilities in AI Builder.  \ne.g., T hese service credits can be used to extract data from a few documents with  form \nprocessing  or perform hundreds of basic Optical Character Recognition ( OCR ) extractions \nwith  text recognition . \n \n107. Is a trial available for AI Builder?  \nCustomers with no AI Builder service credits can test AI Builder and start a free trial ; \n200K AI Builder service credits are included with each trial. The AI Builder free trial can \nbe renewed  a limited numb er of times.  \n \nPower Apps and Power Automate users  \nExisting Power Apps and Power Automate users can access AI Builder trial capacity for \n30-days by signing into the respective service and accessing AI Builder in the left \nnavigation pane.  \n \nNon-Power Apps and Power Automate users  \nUsers without an existing Power Apps or Power Automate license can access AI Builder \ntrial capacity for 30 days by signing up for either a Power Apps trial or Power Automate \ntrial.  \n \nAI Builder Technical Enforcement  \n \n108. How is technical enforcement for AI Build"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "er changing?  \nWe have  changed  how we enforce capacity overage  in AI Builder environments. \nFollowing this change when  environments reach their capacity  (consumption > initial \ncapacity) : AI Builder makers will be unable to create or edit models.  \n \nIn addition,  once utilization exceeds capacity by a large margin  (consumption > 2x \ninitial capacity – this ‘2x’ is not communicated externally and is subject to change) , AI \nBuilder models will be blocked with “Quota Exceeded” or \"All AI Builder credits in this \nenvironment have been consumed” error messages. It means flows using AI Builder \nmodels will fail and AI Builder actions within Power Apps will fail.  \n \n109. What action s do customers need to take?  \nTo prevent impact from this change in enforcement, customers need to  review the \nconsumption and allocated capacity of each of their  environments and adjust capacity \nby purchasing and allocating AI Builder credits as needed.  \n29 \n 110. How do customers review their capacity and consumption reports for \nenvironments?  \nTo review the capacity and obtain an AI Builder consumption report  for their \nenvironments, customers should:  \na. Sign-in to the Power Platform admin center . \nb. Expand Resources  in the left menu and choose Capacity . \nc. Under the Summary tab, click on Download reports  in the Add -ons tile for the \nconsumption report.  \nd. Select the Add-ons tab. This page will display environment capacity data.  \n \n111. Will there be any advance notifications to customers?  \nYes, customers have received advance notifications, they will receive email notifications \nof capacity remaining when it is ≤ 15% remaining and they will see banners notifying \nthem of overages in the Power Platform admin center.  \n• Advance communications : Customers were informed via the AI Builder licensing \ncapacity overage enforcement message sent to them via the Microsoft 365 admin \ncenter  (also viewable in the Power Platform admin center (PPAC ).  \n• Notifications  on"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": " capacity remaining : Power Platform admins and makers  will \nreceive email notifications indicating 15%, 5% and 0% capacity remaining.  \n• Banners warning of overages: Banners will be displayed in the Power Platform \nadmin center notifying customers of overages.  \n \n112. Will customers who have exceeded AI Builder capacity ultimately be blocked?  \nYes. Existing models will continue to run beyond capacity, as we allow a large margin, \nand then ultimately, they will be blocked.  \n \n113. Where can I find more information?  \nPlease review the AI Builder licensing documentation  for more information regarding \ncredit allocation and consumption.  \n \n114. Which D365, O/M365 and Windows products offer seeded Power Platform use \nrights?  \nPlease refer to the chart below for details.  \n \nPower Platform use rights  with Dynamics 365 and \nMicrosoft/Office 365.  \n    Dynamics 365  \nQualifying License  Limited Use Rights Included with Qualifying License  \nPower Apps  Power Automate  Power Pages  \nDynamics 365 Sales Premium     \nDynamics 365 Sales Enterprise     \nDynamics 365 Sales Professional     \nDynamics 365 Customer Service Enterprise     \nDynamics 365 Customer Service Professional     \nDynamics 365 Field Service     \nDynamics 365 Project Operations     \n30 \n Dynamics 365 Team Members     \nDynamics 365 Finance     \nDynamics 365 Supply Chain Management     \nDynamics 365 Commerce     \nDynamics 365 Human Resources     \nDynamics 365 Operations – Activity     \nDynamics 365 Business Central     \nDynamics 365 Business Central Team Members     \nDynamics 365 Intelligent Order Management     \n \nMicrosoft 365, Office 365, and Windows  \nQualifying License  Limited Use Rights Included with Qualifying License  \nPower Apps  Basic  Power Automate  Basic  Dataverse for Teams   \nCloud flows  Desktop  flows   \nOffice 365 E1  ○ ○   ○  \nOffice 365 E3  ○ ○   ○  \nOffice 365 E5  ○ ○   ○  \nOffice 365 F3  ○ ○   ○  \nM365 Business Basic  ○ ○   ○  \nM365 Business Sta"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "ndard  ○ ○   ○  \nM365 Business Premium  ○ ○ ○ ○  \nMicrosoft 365 F1          \nMicrosoft 365 F3  ○ ○ ○ ○  \nMicrosoft 365 E3  ○ ○ ○ ○  \nMicrosoft 365 E5  ○ ○ ○ ○  \nWindows 10 Pro      ○   \nWindows Enterprise E3      ○   \nWindows Enterprise E5      ○   \nOffice 365 A1  ○ ○     \nOffice 365 A31 ○ ○   ○  \nOffice 365 A51 ○ ○   ○  \nMicrosoft 365 A12 ○ ○     \nMicrosoft 365 A31 ○ ○ ○ ○  \nMicrosoft 365 A51 ○ ○ ○ ○  \nWindows Education A31     ○   \nWindows Education A51     ○   \n \n \n \n \n \n \n115. What is the difference in Power Apps Premium and Power Automate Premium  use \nrights that come with qualifying M/ O365 licenses  vs the premium use rights  that \ncome with the Power Platform licenses ? \nPower Platform licenses include  standard, premium and customer connectors allowing \nbusinesses to connect to their existing, internal data and point solutions , AI Builder \nservice credits  and much more storage capacity. The limited Power Apps and Power \nAutomate use rights that come with qualifying M/O 365 licenses are for use  in Dataverse \nfor Teams only. Many customers start with the seeded value before investing  in premium \nuse rights .  \n 1 Also included in Student Use Benefit  \n2 Included via accompanying Office 365 A1  \nMicrosoft 365 is governed by the License Terms of the individual products and services comprising Microsoft 365, as \nmodified by the License Terms in the Microsoft 365 Product Entry. For more information on Microsoft 365 and Office \n365 Suites licensing chan nels and segment availability, refer to the Product Terms . \n \n31 \n  General Power Platform Licensing Questions  \n \n116. For which audiences are Power Platform  offers typically available?  \nPower Platform products  are typically  available to Commercial, Non profit, EDU  (Faculty \nand Students) , US Govt. (GCC, GCC High, DoD), PubGov, GOVCON (VL only), WWGov \nand China sovereign audiences.  \n \n117. Through what channels are Power Platform subscription offers typically \navailable?  \nCustomers can typically lic"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "ense Power Platform subscription offers through Volume \nLicensing (VL), the Cloud Solution Provider program (CSP), and/or Web Direct (MOSP) \nprograms. In Volume Licensing, Power Platform subscription offers are available \nthrough:  \n• Enterprise Agreement (EA)  \n• Enterprise Agreement Subscription (EAS)  \n• Server and Cloud Enrollment (SCE)  \n• Enrollment for Education Solutions (EES), (under the Campus and School \nAgreement)  \n \n118. What is the term length available for an Enterprise Agreement?  \nAn Enterprise Agreement  is typically  a 3-year agreement.  \n \n119. What field empowerment is typically available for Power Platform products?  \nThe following Empowerment Guide concessions can be used for Power Platform \nproducts : \n• Concession 947 - Field  empowerment (for VL: EA/EAS/SCE)  \n• Concession 2319  - Expanded field empowerment for Biz Apps  \n• Concession 1911  - Biz Apps Only SCE field empowerment  \n \n120. Who is entitled to use  Power Platform Connector s? \nEntitlements to Power Platform connectors are determined by license type. See \nentitlement summary tables in the Power Platform Licensing Guide  for Power Platform \nconnector entitlements by product.  \n• Standard Connectors  \n• Premium Connectors  \n• Custom Connectors  \n \nPower Platform subscriptions SKU list  \nProduct  Offer  Volume \nLicensing   \nAI Builder  AI Builder Capacity add -on SDQ-00001  \nCopilot Studio  Copilot Studio Sub (Messages)  YFI-00001  \nDataverse  Database  Dataverse Database Capacity add -on PRX-00002  \nDataverse  File Dataverse File Capacity add -on PSG-00002  \nDataverse  Log Dataverse Log Capacity add -on PSM-00002  \n32 \n Power Apps  Power Apps Premium (2,000 Seat Min.) SEJ-00016  \nPower Apps  Premium  Power Apps Premium  per user  SEJ-00002  \nPower Apps  per app  Power Apps Per App Sub 1 App or Website  J8Q-00005  \nPower Apps  Power Apps per user Frontline Worker   XNS-00001  \nPower Automate  \nPremium  Power Automate Premium Per User  1O4-00001  \nPower Automate  \nProcess  Power Aut"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "omate Process  8F5-00001  \nPower Automate  Process Mining add -on Y1K-00001  \nPower Automate  Hosted RPA add -on WLN -00001  \nPower Pages  Power Pages Anonymous Users  T1 (500 User/Site/Mo)  VQN -00002  \nPower Pages  Power Pages Authenticated Users  T1 (100 User/Site/Mo)  VQQ -00002  \n \nPower Platform pay-as-you-go meters  \n \n121. Which Power Platform services offer  pay-as-you-go meters ?  \nThe following Power Platform services are available with pay -as-you-go option s: \n• Power Apps  \no Power Apps per app  - A measure of the number of unique, active users who \nopen a single pay -as-you-go enabled app one or more times in a month  \n• Power Pages  \no Power Pages Authenticated user meter  - Power Pages Authenticated meter \ndefinition: A measure of the number of unique authenticated users per \nwebsite /mo . \no Power Pages Anonymous user meter - Power Pages Anonymous pay -as-\nyou-go meter definition: A measure of the number of unique anonymous \nusers per website /month   \n• Dataverse  \no Dataverse Database capacity meter  - 1GB database capacity and 1GB of file \ncapacity per environment. No capacity is allocated for Dataverse Logs  \no Dataverse File capacity meter  - 1GB database capacity and 1GB of file \ncapacity per environment. No capacity is allocated for Dataverse Logs  \no Dataverse Log capacity meter  - 1GB database capacity and 1GB of file \ncapacity per environment. No capacity is allocated for Dataverse Logs  \n \nPower Apps per app pay -as-you-go meter  \n \n122. How is the Power Apps per app pay-as-you-go meter  licensed?  \nPower Apps per app pay -as-you-go covers authenticated users of internal apps.  \n• Meter definition: A measure of the number of unique, active users who open  a \nsingle pay -as-you-go enabled app one or more times in a month.  \n• Users with a Power Apps per user license are not counted as “active users.” All \nother users are counted.  \n• See documentation for specific guidance on how monthly activity is calculated.  \n• Entitlements: Dataverse"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": " Database (1 GB) and Database File (1 GB) capacity  \n33 \n • Requests (6,000 requests/24 hrs.) entitlements are applied to each environment \nwith pay -as-you-go billing enabled and are not granted for each monthly active \nuser. Therefore, these entitlements do not change based on the number of users \nusing apps in an en vironment.  \n• Billing frequency: Monthly  \n• Audience: Commercial  \n• Geographies: Worldwide  \nFor more information, please visit documentation .  \n \nPower Pages pay -as-you-go meters  \n \n123. How is Power Pages licensed ? \nPower Pages licensing is based on two user types, Authenticated users per \nwebsite/month and Anonymous users per websit e/month. Each end user that accesses \na Power Pages website needs to be licensed appropriately.  \na. Authenticated Users *  \nThe Authenticated user pay-as-you-go meter  enables customers to pay -as-you-\ngo based on the actual number of Authenticated users who have accessed a \nwebsite in a month.  \nb. Anonymous Users * \nThe Anonymous user  pay-as-you-go meter  enables customers to  pay-as-you-go \nbased on the actual number of Anonymous users who have accessed a website in \na month.  \n Note: For Anonymous users, uniqueness is determined through a unique \nanonymous user ID stored in a browser cookie. This may result in counting the \nsame physical users multiple times because, if the user  \n \nDataverse capacity pay-as-you-go meters  \n \n124. How are the Dataverse Capacity meters  licensed?  \nDataverse Database, File and Log capacity meters are licensed as follows.  \n• Dataverse meters : \no Dataverse Database capacity meter  \no Dataverse File capacity meter  \no Dataverse Log capacity meter  \n• Meter definitions: Amount of capacity used in the environment beyond any \nentitled amounts (1GB database capacity and 1GB of file capacity per environment. \nNo capacity is allocated for Dataverse Logs .) \n• Measurement Frequency: Usage is measured every 8 hours. Fractional usage is \ncalculated by dividing usage by 90 (since there"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": " are approximately 90 8 -hour \nperiods in a month). Then fractional usage is multiplied by the price and then \nadded to the bill.  \n• Billing Frequency: Monthly  \n• Audience: Commercial  \n34 \n • Geographies: Worldwide  \nFor more information, please visit documentation .  \n \n125. Is the Power Apps  meter ACD, MACC and Azure Prepayment eligible? Can \ncustomers apply their existing discounts to pay -as-you-go offers ? What about \nfield empowerment?  \n• The Power Apps  meter is eligible for:  \no Azure Commitment Discount (ACD).  \no Microsoft Azure Consumption Commitment (MACC).  \n• The Power Platform meters is not eligible for Azure Prepayment.  \n• These meters can be discounted through a SKU level discount at GA.  \no The SKU level discount is 5% -15% depending on empowerment level.  \n• If there is a SKU -level discounted price at the same time as an ACD, then the \nsystem will compare the prices and pick the lower of the two.  \n• ACD and SKU level discount are not stackable.  \n• This empowerment is documented in Empowerment Guide Concession 2319  - \nExpanded field empowerment for Biz Apps . \n \n126. What discounting is available for Power Platform meters?  \nField capabilities  \n  Power Apps pay -as-\nyou-go \nMACC  Yes \nAzure Prepayment (MC)  N/A \nACD (Field)  5%-15% \nSKU Level Field Empowerment  5%-15% \nComp  Biz Apps - Azure (PPCR)  \n \n127. Do customers receive volume discounts e.g., Level A, B, C or D pricing, on these  \nmeter s? \nNo, there are no volume level discounts for these  meter s. However, any Azure contract \ndiscounts a customer has will be applied.  \n \n128. Can a customer use the free $200 Azure starter credit?  \nCustomers cannot use the Azure starter credit or MSDN credit  for Power Platform pay -\nas-you-go. \n \n129. How does  this affect new customers?  \nNew customers have the option to license Power Apps  via prepaid subscriptions or \ntransact the Power Apps per app meter.  \n \n130. Which Product Terms apply to th is pay-as-you-go offer, Azure or Power \nPlat"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "form?  \n35 \n The Power Platform Product Terms still apply even though these are offered on Azure. \nIn addition, the Azure Purchasing Services and the Azure Payment and Fees sections \nmay apply as detailed in the Product Terms.  \n \n131. Is there a tool that would help us determine the most cost -effective licensing \nmodel based on parameters like number of users, number of apps and/or storage \nneeds?  \nThere isn’t a tool, but you can refer to this internal deck to understand the scenarios \nwhere pay -as- you-go makes more sense compared to the subscription models.  \n \n132. Why did we introduc e pay-as-you-go meters ? \nWe introduced meters  to provide flexible, consumption -based licensing options for \nPower Platform customers.  \n \n133. For which audiences are these offers available?  \nThese offers are available to Commercial customers.  \n \n134. Are GCC, GCC High, DoD, Public Sector, EDU and China sovereign customers be \nable to transact these offers?  \nThese c ustomers can use the commercially available meters if needed.  \n \n135. What SKUs do I need to add to a customer’s agreement to enable Power Platform \npay-as-you-go? \nNo SKUs need to be added to the customer’s agreement to enable Power Platform \npay-as-you-go. A customer simply needs to get an Azure subscription  and link it to an \nenvironment. Step by step instructions can be found here: \nhttp://aka.ms/PowerPlatformPAYG . \n \n136. Are the Power Apps and Dataverse pay -as-you-go SKUs available in the APT tool \ntoday?  \nYes, these SKUs can be found in these PFAMs within the APT tool  \n• MCA Power Apps per app pay -as-you-go \n• MCA Dataverse pay -as-you-go \n• Non-MCA pay -as-you-go SKUs for Power Apps per app, Dataverse, and Power \nPlatform Requests  \n \n137. How can customers purchase the Power Apps per app, Dataverse capacity and \nPower Platform Requests meters?  \nTo use these meters customers simply need to link a Power Platform environment \n(which contains the apps they want to move to the pay -as-you-go model) "
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "to an Azure \nsubscription. Once an environment is linked, these meters will automatically start being \ncount ed based on usage of Power Apps, Dataverse and Power Platform requests in the \nenvironment. Any environments that are not linked to an Azure subscription will not be \n36 \n affected. Step by step instructions can be found here  \nhttp://aka.ms/PowerPlatformPAYG .  \n \nLinking an environment to an Azure subscription can be done either in Power Apps or \nin the Power Platform admin center. A user must be an Environment admin of the \nenvironment in question, or a Power  Platform admin, D365 admin, or Global admin to \nlink an environment. The user must also have sufficient permissions in the Azure \nsubscription they are linking the environment to. Please visit our documentation at Set \nup pay -as-you-go - Power Platform  to learn how to set up pay -as-you-go for Power \nPlatform environments, and pay for usage of Power Apps, Dataverse, and Power \nPlatform requests in those environments using an Azure subscription.  \n \nNote that unlike other Azure services, customers do not provision and pay for these \nmeters in the Azure portal. Instead, customers must first link an environment to their \nAzure subscription (which can either be done in the Power Platform admin center or in  \nPower Apps). At that point all of the meters noted above will be enabled for that \nenvironment, and usage of those meters will be billed to the Azure subscription.  \nPricing: To view the pricing of these meters customers can visit the docs page at Pay -\nas-you-go meters - Power Platform. Note that any Azure Consumption Discounts (aka \nACD) the customer has will be applied to the published prices of these meters.  \n \n138. What is the process for signing up for an Azure subscription?  \nCustomers can Sign up for an Azure subscription here. \n \n139. If a customer has a Power Apps per app license,  can they trade  it for pay -as-you-\ngo?  \nEA customers can report license reductions as part of the true -u"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "p order process, reduce \ntheir Power Apps per app subscription count to zero and start using the Power Apps \nper app pay -as-you-go meter. However, we would advise that customers consider the \ncost implications of such a change, based on their usage scenarios.  \n \n140. When can customers choose Power Apps  pay-as-you-go meters instead of \nstandard  subscription s?  \nThere is no limitation. It's going to be up to the customer/sales team based on what \nmakes the most sense. Since it's a consumption/billing model within the month, \nconverting in any following month would make the most sense, but should be \nscheduled/structu red based on customer needs. Remember, customers can move back \nand forth as required or configure separate environments differently.  \n \nPower Apps  \nPower Apps Premium  subscription licenses can be used in tandem with Power Apps per \napp pay -as-you-go meters in the same environment. Per user license holders can \naccess an unlimited number of apps across multiple environments including pay -as-\nyou-go environments. When per -user licensed users access apps in pay -as-you-go \nenvironments their usage of thos e apps will not be counted as “active users” of the \n37 \n Power Apps per app pay -as-you-go meter, and hence their usage will not be billed to \nthe Azure subscription linked to the environment.  \n \nPower Automate  \nCustomers can use the following Power Automate subscriptions in a pay -as-you-go \nenvironment and not incur Power Automate flow run meter charges when they use \nthese subscriptions within their license entitlements:  \n• Power Automate Premium  \n• Power Automate Process  \n \nFor example, if a user with a Power Automate Premium  license runs a cloud flow in a \npay-as-you-go environment, that flow run will not be charged as it is part of the Power \nAutomate per user license entitlement.  \n \nPlease note when determining whether a flow run should be charged or not:  \n• The flow owner’s license entitlements are applied for automated or sche"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "duled \nflows  \n• The flow user’s license entitlements are applied for instant,  or Power Apps \ntriggered flows  \n \nPower Platform pay -as-you-go meters SKU list  \nProduct  Offer  Pay-as-you-go \nmeters  \nPower Apps  Power Apps per app Active User  AAL-23111  \nPower Pages   Authenticated users  AAN-16257  \nPower Pages  Anonymous users  AAN-16245  \nDataverse  Dataverse Database capacity  AAL-24311  \nDataverse  Dataverse -File Capacity  AAL-24175  \nDataverse  Dataverse Log capacity  AAL-24369  \n \n \nPromotions, Lead  Status and Limited Time \nOffers  \n \nPower Apps and Power Automate Lead Status Offers  \n \nPower Apps Basic to Premium Lead Status Offer (April 1, 2024)  \n \nMany Microsoft 365 customers have built their Power Apps solutions using Power Apps \nBasic (Power Apps use rights included with select M/O365 licenses). These customers may \nexperience security and governance issues as their usage grows. Some customers resist  \nmoving to a Power Apps Premium license as they view the pricing as prohibitive ($20 per \nuser/month and $12 for 2k+ users/month).  \n \n38 \n We believe this compelling promotion will encourage these customers to move to the \nPower Apps Premium license. We have targeted a set of 262 customers who have high \nPower Apps Basic  usage and at least 1 application  with 1,000+ monthly active users \n(MAU). Through this Lead Status Offer , our goal is to:  \n1. Upsell these customers by demonstrating the business value of enterprise -wide Power \nApps adoption across their enterprise and  \n2. Accelerate renewals and EA customer deals by utilizing  this promotional offer in \nconjunction with program tactics to motivate these customers to purchase at scale . \n \n \nOffer Details  \n \n• Pricing: Power Apps  Premium $6 per user/month  (down from $20 per user/month \nor $12 per user/month for 2K+ users USD ERP)  \n• SKU Number : EP2-07673  (Lead Status)  \n• Availability:  Available in Lead Status April 1, 2024 – September 30, 2024  \n• Audiences:  VL: Commercial  \n• Licensi"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "ng:  Power Apps Premium is best for businesses that want one license for \nusers, regardless of the number of apps they need to run. Power Apps Premium \nenables licensed users to run unlimited custom applications and access unlimited \nPower Pages websites. Addition ally, Power Apps Premium includes access to AI \nBuilder capacity (500 service credits/month) in support of scenarios like forms \nprocessing, object detection, prediction, text classification and recognition.  \n \n \nPower Automate Premium Attach to Power Apps Lead Status Offer (April 1, 2024)  \n \nPower Apps and Power Automate are the most in demand products in Power Platform. For \na customer to license a user for both, the cost can be $35 per user/month (or $27 per \nuser/month with 2k+ Power Apps Premium seats).  To activate the advanced security and \ngovernance features available through Power Platform Managed Environments, all Power \nApps and Power Automate usage in that environment must be covered by full Power Apps \nand Power Automate licenses.  \n \nFor Q4, there are 130 deals (separate from the 262 Power Apps promo accounts) that \nrepresent $2M in potential seats to upsell. Through this Lead Status offer, our goal is to \nincrease the attach rate of Power Automate to Power Apps deals. With this new offer, we \nwill be able to :  \n1. Increase average revenue per customer and  \n2. Strengthen the adoption of different Power Platform products  \n \n \n \nOffer Details  \n \n39 \n • Pricing: Power Automate  VL Lead Status promotion $6 per user/month  (down \nfrom $15 per user/month USD ERP)   \n• SKU Number:  EP2-07573  (Lead Status)  \n• Availability:   Available in Lead Status April 1, 2024 – September 30, 2024  \n• Audiences:  VL: Commercial  \n• Licensing:  Power Automate Premium spans modern and legacy applications \nenabling licensed users to create and run unlimited cloud flows using digital \nprocess automation (DPA), plus automate legacy applications with desktop flows \nthrough robotic process automation (RPA ) in a"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "ttended mode.  \n• Power Automate Premium includes  full Process Mining desktop functionality and a \nlimited amount of Process Mining data storage (up to 50 MB). Additionally, Power \nAutomate Premium includes access to AI Builder capacity (5,000 service \ncredits/month) in support of scenarios like forms proce ssing, object detection, \nprediction, text classification and recognition, and provides the ability for a user to \nrun an attended RPA bot on a workstation.  \n  \n \n141. When and how will these  promos be available to purchase?  \nStarting April 1, 2024, and through September 30, 2024, customers will be able to \npurchase the Power Apps Premium Lead Status offer and the Power Automate Attach \nto Power Apps Promotion through VL only. These promos are lead status and are not \nvisible on the price lists.  \n \n142. Will these promo offers  be available worldwide?  \nYes, these promos  will be available to targeted customers in all geographies worldwide.  \n \n143. What if I have a customer who might be eligible for  these promos  but is not on \nthis list?  \nIf a customer isn’t on the target list, p lease continue working your CE. \n \n144. Can these promos be used together?  \nYes, these promos can be used together   \n \n145. If my customers wants to buy more Power Automate Premium Attach  promo \nlicenses  than Power Apps Basic to Premium promo licenses, can they do that or \ndo they have to buy at least an equal number of Power Apps Basic to Premium \npromo licenses?  \nCustomers can buy less, equal to or more of either Power Apps or Power Automate \npromo licenses if they meet the following criteria:  \na. For the P ower Apps promo, customers should buy a minimum of  2k Power \nApps promo seats  and should be using Power Apps Basic (Power Apps use \nrights with Microsoft/Office 365 licenses .)  \nb. For the Power Automate promo, customers should have a minimum of  2k MW \nseats.  \n \n40 \n 146. Will the promos  be promoted on our website s? \nNo, promos will not be promoted on our websi"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "tes. These promos will be in Lead Status \nand are limited to only targeted customers . \n \n \n147. Are the SKUs for the promo offer  the same as the existing Power Apps Premium \nand Power Automate Premium SKUs or will there be new promotional SKUs?  \nThey are different, please use these new SKUs for these offers.  \n• Power Apps Basic to Premium Promotion: Power Apps Basic to Prem Promo  \nSKU Number : EP2-07673 (Lead Status)  \n• Power Automate Premium Attach to Power Apps Promotion: Power Automate \nAttach to Apps Promo  \nSKU Number:  EP2-07573 (Lead Status)  \n \n148. Is there a minimum quantity of licenses that customers need to purchase?  \n• For the Power Apps Basic to Prem ium Promo , customers need to buy \nminimum of 2k licenses of this promo SKU  \n• For the Power Automate Attach to Apps Promo , there is no minimum \nrequirement.  \n \n149. Are the promo SKUs  in Lead Status? Does a CE need to be involved?  \nYes, the promo SKUs are in Lead Status so please involve the CE to transact these promos . \n \n150. Do customers qualify for additional volume discount s for different pricing levels?  \nThese promos have a flat price irrespective of the level of purchasing volume (level A, B, \nC, D). Customers don’t get additional discounts or empowerments.  \n \n151. What field empowerment is available for these offers ? \nNo additional field empo werment is available for these promos. Pric ing for these \npromos is final and nonnegotiable. If a customer asks for more discount ing, please use \nPower Apps Premium and Power Automate Premium SKUs and reach out to CEs  \n \n152. Can these offers  be added to the Future Pricing Table (FPT)?  \nPower Apps Basic to Prem ium Promo and Power Automate Attach to Power Apps \nPromo cannot be added to the FPT.  \n \n153. Can either of these offers be ramped?  \nThe Ramp Program aims to provide customers the following benefits:  \n1. Ability to scale Power Apps solutions in an organization over time  \n2. Discount ing on these paid seats per customer needs (f"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "lat or ramped discount)  \n3. Option to scale sooner using the $0 provisioned licenses in case of higher \ndemand  \nThese are promos and cannot be ramped. These promos can be purchased only once \nand last for the duration of the contract . \n \n41 \n 154. What happens at the end of the contract? Can customers renew at the same \nprice?  \nSince these are promos, customers will be able to get this price only once. At renewal, \ncustomers will have to engage and negotiate with the field to buy Power Apps \nPremium and Power Automate  Premium .  \n \n155. Are the existing Power Apps Premium and Power Automate Premium license \nentitlements the same as with the Power Apps Premium and Power Automate \nPremium entitlements that come with these two offers?  \nYes, the entitlements for the licenses that come with these offers are the same as the \nentitlements with the non -promotional premium licenses.  \n• Power Apps Premium users will get 500 AI Builder service credits, 250 MB \nDataverse Database and 2 GB Dataverse File accrued capacity.  \n• Power Automate Premium users will get 5,000 AI Builder service credits, 250 MB \nDataverse Database and 2 GB Dataverse File accrued capacity.  \n \n156. What entitlements come  with Power Apps Premium compared to Power Apps \nBasic ? \nPower Apps Basic ( limited Power Apps use rights included with select Microsoft 365 \nand Office 365 licenses ) allow users to customize and extend Microsoft 365 and Office \n365 for productivity scenarios, and to deliver a comprehensive low -code extensibility \nplatform for Microsoft Teams  only. \n \nPower Apps Premium enables licensed users to run unlimited custom applications and \naccess unlimited Power Pages websites.  Power Apps Premium users are entitled to : \n• Unlimited Power Pages websites  \n• 500 AI Builder  service credits ( AI Builder is a turnkey solution that brings the \npower of Microsoft AI through a point -and-click experience and is directly \nintegrated into Power Apps)  \n• Premium  and custom  connectors  \n"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "• Microsoft Dataverse - Full Dataverse access (M/O 365 customers get Dataverse \nfor Teams only)  \no Dataverse Database, and Dataverse File accrued capacities  \no Dataverse Database, File and Log default capacities  \n• AI Builder (500 service credits per licensed user/month)  \n• On premises and cloud services data transfer  \n• The ability to create and access custom tables (For Power Apps use rights with \nrestricted tables and exceptions for case tables, see Restricted tables requiring \nDyna mics 365  licenses .) \n• Managed Environments  - When Managed Environments is activated in a specific \nenvironment, all Power Apps, Power Automate, Power Pages or Copilot Studio \nusage in that environment requires full Power Apps, Power Automate, Power \nPages, Copilot Studio or Dynamics 365 licenses. Please  review Power Platform \nManaged Environments  for details.  \n42 \n  \n    Power Apps \nPremium  \n$20 per user/month  \n(or $12 per user/month \nfor 2k+ users)  Power Apps Basic  \n(use rights with select  \nMicrosoft 365  \nand Office 365 licenses )  \n \n \nPlans  Capabilities     \nPower Apps  Run custom apps  Unlimited apps  Unlimited   \nRun custom Power Pages websites  Unlimited websites    \nRun workflows within the custom app1 ⚫2 ⚫  \nAI Builder  Service credits3 500 credits    \nPower Platform \nconnectors  Standard connectors  ⚫ ⚫  \nPremium  and custom  connectors  ⚫   \nOn premises and cloud services data \ntransfer  ⚫   \nDataverse  Full Dataverse access  ⚫ Dataverse for Teams \nonly  \nCreate and access custom tables4,5 ⚫   \nDataverse Database capacity  (Accrued)  250 MB6   \nDataverse File capacity (Accrued)  2 GB6   \nManaged Environments  Admin and governance at scale7 ⚫   \n \n \n \n \n \n \n \n \n \n \n \n157. How do the entitlements with the Power Automate Premium license differ from \nthe limited Power Automate use rights that come with Power Automate Basic?  \nPower Automate Basic  (limited Power Automate use rights included with select M/O365 \nlicenses ) allow users to customize and extend M/O"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "365 for productivity scenarios, and \nto deliver a comprehensive low -code extensibility platform for Microsoft Teams  only. \n \nPower Automate Premium enables users to create and run unlimited cloud flows using \ndigital process automation (DPA), create and run Business Process flows plus automate \nlegacy applications with desktop flows through robotic process automation (RPA) in \nattended mode . Full Process Mining desktop functionality and a limited amount of \nProcess Mining data storage  (up to 50 MB) is included. Furthermore, Power Automate \nPremium includes access to AI Builder capacity in support of scenarios like forms \nprocessing, object detection, prediction, text classification and recognition, and Power Apps Entitlements Comparison  \n1 Power Automate use rights included with Power Apps do not include RPA functionality, which requires a separate purchase of Power \nAutomate Premium.  \n2 Within app context  \n3 Cap on accrued capacity: 1,000,000 credits per tenant. For more AI Builder service credits, use the AI Builder capacity add -on.  \n4 For Power Apps use rights with restricted tables and exceptions for case tables, see Restricted tables requiring Dynamics 365 licenses .  \n5 For exceptions to Dynamics 365 Field Service use rights for Power Apps users, refer to the Dynamics 365 Licensing Guide . \n6 Dataverse Database and Database File capacity entitlements accrue at the tenant level. Additional Dataverse Database, Dataver se File and \nDataverse  Log subscription capacity can be purchased in increments of 1 GB via the Dataverse capacity add -ons.  \n7 When Managed Environments is activated in a specific environment, all Power Apps, Power Automate, Power Pages or Copilot Stud io \nusage in that environment requires full Power Apps, Power Automate, Power Pages, Copilot Studio or Dynamics 365 licenses. Ple ase review \nPower Platform Managed Environments  for more details.  \n \n \n \n43 \n provides the ability for users to run an attended RPA bot on a workstation.   \n"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "Power Automate  Premium users are entitled to : \n• Business Process flows and Attended Desktop flows  \n• Process Mining including Task mining, Could flows process mining integration \nand Visualizing and Analyzing processes  \n• 5,000 AI Builder  service credits ( AI Builder brings the power of Microsoft AI \nthrough a point -and-click experience , directly integrated into Power Apps)  \nPremium  and custom  connectors  \n• Microsoft Dataverse - Full Dataverse access (M/O 365 users  get Dataverse for \nTeams only)  \no Dataverse Database, and Dataverse File accrued capacities  \no Dataverse Database, File and Log default capacities  \n• On premises and cloud services data transfer  \n• Managed Environments  - When Managed Environments is activated in a specific \nenvironment, all Power Apps, Power Automate, Power Pages or Copilot Studio \nusage in that environment requires full Power Apps, Power Automate, Power \nPages, Copilot Studio or Dynamics 365 licenses. Please  review Power Platform \nManaged Environments  for details.  \n \nAdditionally, limited Power Automate use rights are included with select Windows licenses \nto create and execute personal desktop automation for attended RPA capabilities in Power \nAutomate Desktop.  \n \n   Power \nAutomate \nPremium  \n$15 per \nuser/month1 Power \nAutomate Basic  \n(use rights with \nselect  Microsoft 365  \nand Office 365 \nlicenses ) Windows  \n \n Plans  Capabilities   \n   \nPower Automate2  Cloud flows (Automated, instant, \nand scheduled flows)  ⚫ ⚫   \nBusiness process flows  ⚫    \nAttended desktop flows  ⚫  ⚫3  \nUnattended desktop flows   \n   \nProcess Mining  Task Mining  ⚫    \nCloud flows process mining \nintegration  ⚫    \nVisualize and analyze processes  ⚫4,5    \nShare and  \ncollaborate  Other users can view, edit, or run \nautomations  ⚫ ⚫   \nPower Platform \nconnectors  Standard  connectors  ⚫ ⚫   \nPremium  and custom  connectors  ⚫6\n    \nOn prem & cloud svcs. data transfer  ⚫    Power Automate Entitlements Comparison  \n44 \n AI Builder  Serv"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "ice credits7 5,000     \nDataverse  Dataverse use rights  ⚫ Within \nTeams only    \nDatabase capacity (Accrued)  250 MB8    \nFile capacity (Accrued)  2 GB8    \nManaged Environ s. Admin. and governance at scale9 ⚫    \n \n \n \n \n \n \n \n \n \n \n \nFrequently asked promotions and special offers questions  \n \n158. Can a promotional  offer be added to the future pricing table ?  \nA promotional SKU  cannot be added to the FTP.  \n \n159. Are empowerment discounts available for promotions?  \nNo, the empowerment guide does not permit discounting for promotion al SKUs.  \n \n160. I’m not familiar with Lead Status SKUs and how to transact them, where can I go \nfor help?  \nThe Lead Status designation is used to restrict sales of a product to CE/LEs when the \nproduct should not be sold broadly. Lead Status SKUs are not on the public pricelists \nwhich prohibits their sale by Microsoft Partners.  \n \n161. Can customers add Limited Time Offers to their current EA on the anniversary or \nmidterm?  \nCustomers can add products at any point during the term of their existing agreement \nor in a new agreement, but to qualify for a limited time offer, they must purchase  the \nnew licenses between the required dates . 1 Per tenant/month, one license allows user or capacity to use in any environment in the tenant.  \n2 See technical documentation  for definitions of each flow type.   \n3 Via Power Automate desktop  only; a free application not intended for business -critical functions, with no SLA or Microsoft \nsupport. cloud flows, standard/premium connectors, orchestration (scheduled or automatic triggers for desktop flows, attended  or \nunattended, combine cloud flow s + desktop flows in a single automation), sharing desktop flows, developing in a different \nenvironment than the default, Automation Lifecycle Management (ALM), monitoring, execution logs are not included.  \n4 The Power Automate Premium license includes the Process Mining desktop app with advanced analytics and optional Power BI \ncustomizat"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "ion with a separate purchase of Power BI. Process Advisor that comes with Power Automate Premium licenses includes \nout of th e box process mining capabilities (pre -built templates) with very limited customization.  \n5 50 MB of Process Mining data storage per user license, cap on accrued capacity: 100 GB per tenant.  \n6 Desktop flow connector is included. (This desktop flow connector is not included in Windows licenses.)  \n7 Cap on accrued capacity 1,000,000 credits per tenant. Additional AI Builder capacity can be purchased per 1M service credits for \n$500/month via the AI Builder capacity add -on. \n8 Dataverse Database and File subscription capacity is pooled at the tenant level. Additional Dataverse Database, Dataverse Fil e and \nDataverse Log subscription capacity can be purchased in increments of 1 GB.  \n9 When Managed Environments is activated in a specific environment, all Power Apps, Power Automate, Power Pages or Copilot \nStudio usage in that environment requires full Power Apps, Power Automate, Power Pages, Copilot Studio or Dynamics 365 \nlicenses. Please  review Power Platform Managed Environment s for more details.  \n \n \n \n45 \n Power Platform Pricing and Discounting \nChanges  \nAI Builder and Copilot Studio Discounting Changes  (April 1, \n2024)  \n \n162. What are the discounting changes planned for Copilot Studio?  \nAcross Microsoft we are taking a unified approach to programmatic discounts, discount \nempowerment, and seller margins for our AI products. We have made this decision to \nlive up to our customer promise of simplification and to create a consistent buying \nexperience.  \n \nTo align our approach across all AI products, we are reducing the CSP margin for \nCopilot Studio from 25% to 10%. The 10% field empowerment for Copilot Studio will \nbe maintained. These changes will take effect May 1, 2024.  \n \nSummary of changes  \n  Current approach   Future State   Status   \nField empowerment    10% for \nCommercial   \nVaries for Gov and \nEdu  10%  Live May 1"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "   \nCSP Margin Impact   25%  10%  Live May 1   \nWaterfall pricing   No  No  Live May 1   \n \n163. When do these changes take effect?  \nThese changes take effect on May 1, 2024, see below for details.  \n \nGA Date/Comments  \n  Field emp.  CSP margin  VL: Waterfall pricing  \nCommercial   No changes  5/1  No waterfall today   \nUS Gov   \n(GCC, GCC High, DoD, US Sec, US Nat)   5/1   5/1  No waterfall today   \nCharity   5/1  N/A No waterfall today   \nEdu  5/1  N/A No waterfall today  \n \n164. How should we position these Copilot Studio discounting changes to customers?  \nTo align our approach across all AI Products, we are reducing the CSP margin for \nCopilot Studio from 25% to 10%. The field empowerment of 10% is maintained and \nthere is no waterfall pricing for Copilot Studio today.  \n \n46 \n 165. How does this announcement impact Partners and Customers who are \ntransacting Charity offers?  \n• Field empowerment does not apply to Charity customers given we instead \nstandardize on the best discount possible as the official price.  \n• Charity price list impact:  \no Nonprofits continue to have a charity audience discount of 75% in Legacy \nDirect and Legacy VL. This is being reviewed and subject to change in the \nfuture, but there will be no change for 5/1.  \no Copilot Studio is not available in Modern CSP with a charity audience \ndiscount. Customers choosing to buy now need to pay commercial rates in \nModern CSP or purchase via an alternative channel to get the charity \naudience discount.  \n \n166. How does this announcement impact Partners and Customers who are \ntransacting Education offers?  \n• Partner margin for EDU customers is reduced to 10%.  \n• Waterfall discounts do not apply to EDU customers.  \n• Field empowerment of 10% will be applied.  \n• Education price list impact:  \no Education Faculty customers continue to have an audience discount of 45% \nin Legacy Direct and Legacy VL. This is being reviewed and subject to \nchange in the future, but there will be no change for "
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "5/1.  \no Copilot Studio is not available in Modern CSP with an education audience \ndiscount. Customers choosing to buy now need to pay commercial rates in \nModern CSP or purchase via an alternative channel to get the education \naudience discount.  \n \n167. What are the empowerment and discounting changes planned for AI Builder?  \nAcross Microsoft we are taking a unified approach to programmatic discounts, discount \nempowerment, and seller margins for our AI products. We have made this decision to \nlive up to our customer promise of simplification and to create a consistent buying \nexperience.  \nWe are making the following changes to our empowerment and partner approach for \nall AI products.  To get there, we will need to update not only the waterfall pricing , but \nalso the  field empowerment and CSP margin for AI Builder and Copilot Studio as \nfollows.  \n• Empowerment:  Previously no field empowerment was available for AI Builder, \nbut we now are enabling a field empowerment of 10%.  \n• CSP Margin:  The current 25% CSP margin is reduced to 10%.  \n• Legacy waterfall pricing:  VL discounts for pricing levels B, C and D are no \nlonger available.  \n \nSummary of changes  \n  Current approach   Future State   \nField empowerment   0% for commercial  10% \n47 \n Varies for Gov and Edu  \nCSP Margin Impact   25% 10% \nWaterfall pricing**  \n(Legacy VL only)   EA /MPSA/GCC/GCon  \n6-12% level A – D No Waterfall Discounts  \n**There will be a two -phased approach to waterfall discounting changes starting with a \n10% reduction in discounting on May 1, 2024, and a 3.2% reduction on May 1, 2025. This \nwill be applicable to GCC and GCC High customers only.  \n \n168. When do these changes take effect?  \nThese changes will begin to take effect on May 1, 2024, see below for details.  \n \nGA Date/Comments  \n  Field \nemp.  CSP margin  VL Waterfall pricing  \nCommercial   5/1 5/1  5/1  \nUS Gov  (GCC, GCC High, \nDoD, US Sec, US Nat)   5/1  5/1 5/1/24 (reduce by 10%) and  \n5/1/25 (reduce by 3.2%)   "
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "\nCharity   5/1  5/1  5/1 (customers can transact commercial offers)  \nEdu  5/1  5/1  \n  No waterfall today  \n \n169. What are the AI Builder Add -on capacity pack pricing tiers and associated \npricing?  \n(Each capacity pack includes 1 million AI Builder service credits per month.)  \n \n \nCapacity \nPack Tiers  AI Builder Add -on \nSKU Names  Capacity Packs  \nMinimum  Purchase  Capacity Pack  \nPrice/Month  \n \nTier 1  AI Builder Capacity T1 add -on 1 capacity pack  $500/capacity pack   \nTier 2  AI Builder Capacity T2 add -on 10 capacity packs  $375/capacity pack   \nTier 3  AI Builder Capacity T3 add -on 50 capacity packs  $250/capacity pack   \n \n170. What are the changes in CSP margin for AI Builder?  \nThe partner margin for AI Builder is changing from 25% to 10%.  \n \n171. How should we position these AI Builder discounting changes to customers?  \nWe have adjusted pricing for the underlying AI Builder burn rates; they are now on \naverage 5x cheaper. We have added tiered pricing to scale with volume. We are \nenabling field empowerment up to 10%. And now, AI Builder includes Generative AI \nand GPT powere d capabilities.  \nWhile we are removing the price waterfall and there will be some customers that are \ndirectly affected by these changes when they renew, that is marginal compared to the \nbenefits off all of these recent changes:   \n48 \n • We have adjusted the underlying burn rates on average, and they are cheaper \nby 5x for our customers    \n• We have added tiering to AI Builder and now our pricing scales with volume    \n• We have added new GPT powered capabilities   \n \n172. How does this announcement impact CSPs and Customers transacting Charity \noffers?  \n• CSP margin for Charity customers remains unchanged at 10%.  \n• Field empowerment does not apply to Charity customers given we instead \nstandardize on best discount possible as the official price.  \n• Charity price list impact:  \no Nonprofits continue to have a charity audience discount of 30% on AI \nBuilder Tier 1 in"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": " Legacy Direct, Modern CSP, and Legacy VL. This is being \nreviewed and subject to change in the future, but there will be no change \nfor 5/1.  \no There has not been a charity discount on Tier 2 and Tier 3 capacity packs \nsince the launch of those offerings, and that will continue to be the case. \nCustomers need to buy the commercial offers if they need additional \ncapacity .  \n \n173. How does this announcement impact CSPs and Customers transacting Education \noffers?  \n• CSP margin for EDU customers is reduced to 10%.  \n• Waterfall discounts do not apply to EDU customers.  \n• Field empowerment of 10% will be applied.  \n• Education price list impact:  \no Education Faculty offers continue to have an audience discount of 30% on \nAI Builder Tier 1 in Legacy Direct, Modern CSP, and Legacy VL. This is \nbeing reviewed and subject to change in the future, but there will be no \nchange for 5/1.  \no There has not been an education sector discount on Tier 2 and Tier 3 \ncapacity packs since the launch of those offerings, and that will continue \nto be the case. Customers need to buy the commercial offers if they need \nadditional capacity .  \n \nLicense Transitions  \n \nMicrosoft Copilot Studio  (December 1, 2023 )  \n(This section details licensing transitions to Microsoft Copilot Studio for customers \nwith existing Power Virtual Agents licenses .)  \n \n174. When did the new Microsoft Copilot Studio  offer be come generally  available?  \n49 \n • General Availability (GA): Microsoft Copilot Studio became generally available in VL, \nCSP and Direct on December 1, 2023.  \n• Lead Status:  The new Microsoft Copilot Studio was originally available via VL Lead \nStatus October 1, 2023 - November 30, 2023.  \n \n175. What is the transition timeline for the new Microsoft Copilot Studio offer?  \n \n176. If a customer has a subscription with the old SKUs, will their “meter” be \nautomatically transitioned from the “sessions” to “messages?”  \n• Old - Power Virtual Agents  \no No, we will not automaticall"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "y transition the meter from “sessions” to \n“messages.” The old PVA subscription license will retain “sessions.”  \no Additionally, Generative AI is not available in the old SKUs.  \nPlease note : AI-enabled conversations  will be blocked in environments that still \nhave sessions.  \n• New - Microsoft Copilot Studio  \no Gen AI end user features are only available to customers that purchase the \nnew SKU  \no Customers can transact on Gen AI features via messages per our business \nmodel  \n \n177. What are the purchasing options  for existing  Power Virtual Agents customers  \nwith the old session -based  licenses  who want to purchase the new message -\nbased  licenses ?  \nCustomers with old  Power Virtual Agents licenses  are able to purchase the new \nMicrosoft Copilot Studio  licenses . Their options depend on the ir purchasing  timeframe  \nand license type  as detailed below.  \n\n50 \n December 1, 2023: The new Microsoft Copilot Studio  SKU launche d in GA via VL, CSP \nand Direct.  \n• All customers can purchase  the new Microsoft Copilot Studio licenses.  \n• Existing c ustomers in all channels (VL, CSP and Direct) can p urchase the new \nMicrosoft Copilot Studio licenses or continue to purchase the old licenses .  \n• New customers in all channels  can purchase the new Microsoft Copilot Studio \nlicenses or the old Power Virtual Agents licenses.  \n \nJanuary 1, 2024 : The old Power Virtual Agents SKUs  are in discontinued status . \n• New Microsoft Copilot Studio customers can only purchase the new Microsoft \nCopilot Studio SKUs. (New Microsoft Copilot Studio customers can no longer \npurchase the old Power Virtual Agents SKUs. ) \n• Existing VL customers with the old SKUs can continue to true up or true down at \nanniversary until their agreement expires.  \n• Existing CSP customers with old SKUs can continue to increase their counts until \ntheir agreement expires.  \n \n178. What are existing customers'  other migration options for transitioning to the \nnew SKUs?  \n• Existing custome"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "rs can purchase  the new Microsoft Copilot Studio SKU per the \ntransition timeline guidelines.   \n• Existing VL customers can wait until anniversary or renewal to true down old PVA \nSKUs  and then purchase the new Microsoft Copilot Studio  SKUs . \n \n179. If an existing tenant purchases t he new Microsoft Copilot SKU and has not \nmigrated the old Power Virtual Agents SKUs, can they have both the old PVA SKU \nand the new Microsoft Copilot Studio SKU at the same time?  \nYes, a tenant  can have both the old Power Virtual Agents SKUs (chat sessions) and the \nnew Microsoft Copilot Studio  SKUs (messages) at the same time .  \n \n180. Can a tenant have both sessions and messages in the same environment ? \nWhile a tenant  can have both chat sessions and messages, an environment  cannot . You \ncan only assign messages OR chat sessions to a particular environment .  \n• Old Power Virtual Agents  \no No, we will not automatically transition the meter from “sessions” to \n“messages.” The old PVA subscription license will retain “sessions.”  \no Additionally, Generative AI is not available in the old SKUs.  \nPlease note: Gen AI: AI -enabled conversations will be blocked in \nenvironments that still have sessions.   \n• New Microsoft Copilot Studio  \no Gen AI end user features are only available to customers that purchase \nthe new SKU  \no Customers can transact on Gen AI features via messages per our \nbusiness model  \n51 \n 181. Will PPAC see both messages and sessions for a tenant?  \n• PPAC will see messages and sessions  \n• Messages or sessions can be assigned to one environment  at a time  \n \nPower Platform Simplification (August 1, 2023)  \n \n182. What is the transition timeline for these new offers?  \n \n \nPower Apps  per user  \n183. How will Power Apps  per user customers transition to the new Power Apps \nPremium offer?  \nNo changes will be required on the customer’s end. Power Apps per user is simply \nbeing renamed as Power Apps Premium.  \n \nPower Automate per user  \n184. Will Power "
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "Automate per user still be available to purchase?  \nOn August 1, 2023 , we announce d that Power Automate per user will be removed from \nthe pricelist. Effective February 1, 2024 , This SKU will be available in lead status o n the \nVL price list but will no longer be available via CSP or Direct.  \n \nPower Automate per user with attended RPA  (DPA)  \n185. Will the Power Automate per user with attended RPA still be available to \npurchase?  \nOn August 1, 2023,  Power Automate per user with attended RPA  was renamed “Power \nAutomate Premium .” This new offer includes all the benefits of the $40 per user/month \nPower Automate per user with attended RPA license , and Process Mining * capabilities \nsuch as task mining, cloud flows with process mining integration and the ability to \nvisualize and analyze processes.  \n*50 MB of Process Mining data storage per user license, cap on accrued capacity: 100 \nGB per tenant   \n\n52 \n Note: Process Advisor that comes with Power Automate Premium licenses includes out \nof the box process mining capabilities (pre -built templates) with very limited \ncustomization.  The Power Automate Premium license includes the Process Mining \ndesktop app with advanced analytics and optional Power BI customization w/separate \npurchase of Power BI.  \nPower Automate per flow   \n186. Will Power Automate per flow still be available to purchase?  \nPower Automate per flow will remain on the pricelist until further notice.  \n \nHowever, Power Automate Process , an all-encompassing license that is easier  to \nmanage , licenses a single ‘automation’ bot that can be used for unattended robotic \nprocess automation (unattended RPA), OR cloud flows using digital process automation \n(DPA)  and can be accessed by unlimited users in the organization . Power Automate \nProcess  is priced at $150 per bot/month.  \n \nPower Automate unattended RPA add -on \nWill the Power Automate unattended RPA add -on still be available to purchase?  \nPer the August 1, 2023,  announcement, t"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "he Power Automate unattended RPA add -on \n($150 per bot/month with required  licensing prerequisites) will be removed from the \npricelist on February 1, 2023. Th is offer  will be available in VL through lead status but \nwill no longer be available in CSP or Direct.  \n \n187. Will there be any other changes to other Power Platform products on August 1 , \n2023?  \nNo there are no other changes for the remaining Power Platform products . \n \n188. Which Power Platform products will go into lead status on February 1, 2024?  \nOn February 1, 2024, the following products will go into lead status  in VL .  \n• Power Automate per user  \n• Power Automate unattended RPA add -on \n \n \nPower Apps portals transition to Power Pages  (October 1, 2021)  \n \n189. How did this affect pricing for existing Power Apps per app customers?  \nExisting Power Apps per app customers can continue to true -up and down until the \nend of their agreement term.  \n \n190. How were  Power Apps per app entitlements transitioned for customers that \npurchased Power Apps per app licenses prior to October 1?  \nCustomers with existing per app subscriptions purchased prior to October 1, 2021, \nmaintain the current entitlement for the duration of their agreement term. Each existing \nper app license receive d a total of 3 app passes, entitling users to continue accessing \nup to two apps and one portal.  \n53 \n 191. How did existing Power Apps portals customers get Power Pages ?  \nPower Pages is an evolution of Power Apps portals. There weren’t  functionality changes \nfor Power Apps portals customers,  and they didn’t need to upgrade or migrate their \nexisting portals . All portals were  rebranded to Power Pages and simply  referred to as \nPower Pages. This was done automatically by Microsoft and did not require any \nmigration effort on the customer side.  \n \n192. What are the main differences between Power Apps portals and Power Pages \nlicensing models ?  \nThere were  a few changes :   \n• Instead of counting granular u"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "sage in terms of logins and page views, the licensing \nutilizes users as a common metric and counts unique users using a single website \nin a month.    \n• The Authenticated per user license is applicable for both employees and non -\nemployees.   \n• Users with Power Apps portals use rights through Power Apps and Dynamics 365 \nenterprise licenses continue to have access to Power Pages. No additional licenses \nare required.  \n• Dataverse Database and Dataverse File storage capacity is included with both the \nAuthenticated per user and the Anonymous per user licenses.    \n \n193. What were the key dates for the transition plan?  \nHere is an overview of key dates.  \n• Power Pages GA – November 1, 2022  \n• Grace period – November 1, 2022 – March 31, 2023  \n• Power Apps portals discontinued, no new deal or renewal – April 1, 2023  \n \n54 \n  \n \n194. What happen ed to Power Apps customers using Power Apps portals ?  \nThere were two potential scenarios for Power Apps customers using Power Apps \nportals:  \n• Authenticated users  - These users, typically employees or guest AAD users, had no \nchanges to their entitlements and are able to access any Power Pages website \nusing their Power Apps subscription licenses without requiring any additional \nlicenses.    \n• Authenticated/Anonymous users  - Authenticated and/or Anonymous users \nutilizing Power Apps portals per login and/or per pageview capacity need to \npurchase Power Pages Authenticated per user, or Anonymous per user capacity  at \nrenewal . \n \n195. What happen ed to existing Dynamics 365 customers using Power Apps portals ?  \nThere were two potential scenarios for Dynamics 365 enterprise customers using \nPower Apps portals:  \n• Dynamics 365 enterprise - Authenticated users  \nThese users are typically employee or guest AAD users using a website. They had \nno changes to their entitlements and are able to access any Power Pages website \nusing their Dynamics 365 enterprise licenses without requiring any additional \nlicenses.    "
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "\n• Authenticated/Anonymous users   \nAuthenticated and/or Anonymous users currently utilizing Power Apps portals per \nlogin and per pageview capacity need to purchase Power Pages Authenticated per \nuser, or Anonymous per user capacity at renewal .  \n \n\n55 \n 196. Do Microsoft 365 and Office 365 users get any Power Pages use rights?  \nMicrosoft 365 and Office 365 users do not have Power Pages use rights.  \n \n197. What is the difference between Power Apps portals login capacity and Power \nPages Authenticated per user/month capacity?  \n Power Pages Authenticated per user/month capacity counts the number of unique \nusers in a month that have accessed the website in an authenticated manner whereas \nPower Apps login capacity counts the number of total logins all users had on the \nwebsite over a 24-hour period.    \n   \ne.g., Consider a scenario where a website was accessed by a total of 100 authenticated \nusers in a month with each user logging in once every day to the website. In this \nscenario, if we apply both meters, then this is how they will wo rk.  \n \n• Power Pages Authenticated per user  \nWith Power Pages Authenticated per user per website monthly capacity, the total \nnumber of users would be 100 and the customer will need to purchase capacity for \n100 users for the website .  \n• Power Apps portal login  \nWith Power Apps portal logins, total number of logins would be 100  x 30= 3 ,000 \n(as each user is logging in once every day) and customer will need to purchase \ncapacity for 3 ,000 logins for the website.    \n \n198. If a user accesses a site anonymously and then logs in to the site in the same \nsession, will the user be counted as both an Anonymous and an Authenticated \nuser?  \nIf a user accesses a site in both an anonymous and an authenticated manner in the \nsame session, the user will only be counted as an Authenticated user and not as \nAnonymous user.  \n \n199. If a customer creates a Power Pages website which can potentially be used by \n100,000 users (Authentica"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "ted), however in a given month it will only be used by \n5,000 users (out of the 100,000). Do I need to purchase capacity for 100,000 users \nor 5,000 users?  \nPower Pages authenticated per users/website is licensed based on the number of \nunique Authenticated users who access the site in a month. So, in this case, the \ncustomer should purchase capacity for 5,000 users. The same is true if the users are \nAnonymous a nd not Authenticated.  \n   \n200. What is the difference between Power Apps portals page view and Power Pages \nAnonymous per/website monthly capacity?  \n Power  Pages Anonymous per user/month capacity counts the number of unique users \nin a month who have accessed the website in an anonymous manner whereas Power \nApps page view capacity counts how many total pages were interacted with by all users \n56 \n in a month.    \n   \ne.g., Consider a scenario where a website was accessed by a total of 1,000 anonymous \nusers in a month with each user interacting with an average of 150 pages in a month. In \nthis scenario, if we apply both meters, then this is how they will  work:   \n• Power Pages Anonymous per user  \nWith Power Pages Anonymous per user/website monthly capacity, the total \nnumber of users would be 1,000 and the customer will need to purchase capacity \nfor 1,000 anonymous users for the website.    \n• Power Apps portal page views  \nWith Power Apps portal page views, the total number of page views would be \n1,000*150= 150,000 (as each user is interacting with 150 pages) and the customer \nwill need to purchase capacity for 150k page views for the website.    \n   \n201. What are the entitlements for customers with the old Power Apps per app license  \nthat were granted access to two apps and one portal ?  \nCustomers who have not yet renewed their agreements and are still entitled to the old \nPower Apps per app SKU will be able to access two Power Apps and one Power Pages \nwebsite.  At renewal, they will renew with the new Power Apps per app SKU and will be \nent"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "itled to one Power App or one website.  \n \n \nPower Apps Pricing and Licensing Changes  (October 1, 2021)  \n \n202. What is the new SKU name for the Power Apps per app license and how will \ncustomers be able to differentiate between the two SKUs?  \nThe new Power Apps per app SKU name is, “Power Apps Per App 1 App or Portal” and \nthe existing SKU name “Power Apps per app plan,” will remain the same .  \n \n203. How were  per app plan entitlements being transitioned for customers that \npurchased the Power Apps per app Plan licenses prior to October 1 , 2021 ?  \nThe Power Apps per app plan entitlements at that time provide d users with an app pass \nthat gave  them the ability to run two apps and one portal. After  October 1, the app \npass was simplified to provide users with the ability to run one app or access one \nportal. Customers with existing per app plan subscriptions purchased prior to October \n1, 2021, maintain ed the current entitlement for the duration of their agreement term. \nEach existing per app plan license receive d a total of 3 app passes, entitling users to  \ncontinue accessing up to two apps and one portal. These app passes were  available for \nallocation to an environment and assignment to users beginning the first week of \nOctober. Power Apps per app plan subscriptions purchased after October 1, 2021, \nreceived 1 app pass for each license, entitling assigned users to access one app or one \nportal. Learn more about app passes here.   \n \n \n57 \n Power Platform Licensing Changes (October 1, 2019)  \n \n204. What are the transition plans  for EA, CSP, Web Direct and MPSA customers?  \nThe transition plans are outlined  per agreement type as outlined  below.  \n \n \n \n \n205.  Which customers were impacted by these licensing changes ? \nPowerApps  Plan 1 and/or PowerApps Plan 2 customers (as of Sep 30, 2019) using \nsolutions that read, update or delete records corresponding to the “Lead” entity  \n\n58 \n  Transition plan  \n \n• PowerApps Plan 1 and Plan 2 customers co"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "ntinue d with the list of restricted \nentities pre -October 1, 2019,  until the end of the transition period for these SKUs  \n• When  customers transition ed to the “Power Apps per app plan” or “Power Apps \nper user ,” the list of restricted entities effective October 1st, 2019,  applie d. \n \n206. What happen ed to Dynamics 365 Portals?  \n• Dynamics 365 Portals were  automatically transition to Power Apps portals  \no No action was required from customers  \n• Dynamics 365 Additional Portals and Dynamics 365 Additional Portal Page Views \nSKUs were  retired  \no Existing customers were  grandfathered  \n \n207. What were the transition plans for existing Dynamics 365 customers ? \nAll tenants with Dynamics 365 subscriptions (as of Sept 30, 2019) receive d an extension \nof existing licensing terms for 12 months from Oct 1, 2019,  OR expiration of current \nDynamics 365 subscription term, whichever was longer . \n \n \n1Dynamics 365 for Sales Enterprise, Dynamics 365 for Customer Service, Dynamics 365 \nfor Field Service, Dynamics 365 for Talent, Dynamics 365 for Project Service Automation, \nDynamics 365 for Retail, Dynamics 365 Customer Engagement Plan, Dynamics 365 \nUnified Operations Plan, Dynamics 365 Plan  \n \nPower Apps/Power Automate use rights – Dynamics 365 restricted entities  \nPower Apps & Power Automate plans continue d to have “read” access to Dynamics 365 \nrestricted entities . \n \n208. Which Dynamics 365 entities (tables) changed ?  \nList of Dynamics 365 restricted entities changed  – please see below  \nChanges to Power Apps and Power Automate use rights  \n\n59 \n  \n \n209. What were the t ransitions for existing Office 365 customers ? \nTenant wide grandfathering  \n \n \n210. How were existing Power Apps applications and flows  affected?  \nPower Apps applications and flows, created prior to October 1, 2019, that include one \nor more connectors w moved from “standard” to “premium” category were  \nautomatically grandfathered through October 1, 2024 . \n \nWhat can eligible Of"
  },
  {
    "blob_name": "Power Platform Licensing FAQ.PDF",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:35+00:00",
    "size": 1577287,
    "content": "fice 365 customers expect during the extension period ? \n \n  \n\n60 \n Evolution of the Microsoft Dataverse (December 1, 2019)  \n \n \n \n\n61 \n  \n \n \n  \n \n \nPower Platform Licensing Resources  \n \nPower Platform  Licensing Resources  \n• New!  Power Platform Pricing & Licensing Hub on Seismic  \n• Power Platform: Licensing Deck  \n• Power Platform: Licensing Guide  \n• Power Platform: Licensing FAQ  \n \nProduct Licensing Resources  \n• Power Apps : Pricing and Licensing  \n• Power Automate : Pricing and Licensing  \n• Microsoft Copilot Studio : Pricing and Licensing  \n• Power Pages : Pricing and Licensing  \n \nAdditional Resources  \n• Power Platform generative AI field FAQ"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "Power Platform  Licensing Guide | July 2024             =   \nFebruary  2023  \n   \nPower Platform  \nLicensing Guide  \nPower Platform  \nLicensing Guide  \nJuly 2024   \n\n Power Platform  Licensing Guide | July 2024          \nTable of Contents  \nTable of Contents  ................................ ................................ ................................ ................................ ................................ ..........  2 \nHow to buy  ................................ ................................ ................................ ................................ ................................ .........  4 \nMicrosoft Licensing Programs  ................................ ................................ ................................ ................................ ....... 4 \nProduct licensing  ................................ ................................ ................................ ................................ ...............................  4 \nRecommended offers  ................................ ................................ ................................ ................................ .......................  5 \nOther options  ................................ ................................ ................................ ................................ ................................ ..... 9 \nPower Apps  ................................ ................................ ................................ ................................ ................................ ....................  9 \nPower Automate  ................................ ................................ ................................ ................................ ................................ ........ 12 \nMicrosoft Copilot Studio  ................................ ................................ ................................ ................................ .........................  18 \nPower Pages  ................................ ........."
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "....................... ................................ ................................ ................................ ................  20 \nAI Builder  ................................ ................................ ................................ ................................ ................................ ......................  24 \nDataverse  ................................ ................................ ................................ ................................ ................................ ......................  26 \nAdditional Resources  ................................ ................................ ................................ ................................ ......................  29 \nMultiplexing  ................................ ................................ ................................ ................................ ................................ .................  29 \nLicensing Requirements for External Users  ................................ ................................ ................................ ..........................  29 \nTrials and Implementation ................................ ................................ ................................ ................................ ........................  29 \nDevelopment and Testing  ................................ ................................ ................................ ................................ ........................  29 \nPricing  ................................ ................................ ................................ ................................ ................................ ............................  29 \nPower Platform Service Support  ................................ ................................ ................................ ................................ .............  30 \nAppendix A: Terminology and Custom Tables  ................................ ................................ ............."
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "................... ........ 30 \nAppendix B: Dynamics 365, Microsoft/Office 365, and Windows licenses that include Power Platform \ncapabilities  ................................ ................................ ................................ ................................ ................................ ........ 33 \nAppendix C: Change Log  ................................ ................................ ................................ ................................ ...............  34 \n \n \n   \n \n Power Platform  Licensing Guide | July 2024   P a g e  | 3 Using This Guide   \nUse this guide to improve your understanding of how to license Microsoft Power Apps, Power Automate, Copilot Studio , \nPower Pages,  and Power Platform add -ons.  \n \nTo facilitate understanding of licensing requirements this guide is structured as follows:  \n1) How to buy  \n2) Product licensing  \n3) Additional resources  \n4) Notes: Change log  \n \nFor help determining the right technology solution for any given organization, including the license requirements for a \nspecific product or scenario, consult with your Microsoft account team or your Microsoft Certified Partner . This guide does \nnot supersede or replace any of the legal documentation covering use rights.  \n \nFor more information on purchasing Microsoft Products and Microsoft Licensing Programs, in the U.S. visit Microsoft \nLicensing Program Guides  or call Microsoft Sales at (855) 270 -0615, and internationally visit Microsoft Volume Licensing . \n \nWhat’s new in this licensing guide  \nSee the Change log Appendix C , for minor changes effective July 2024 . \n \nMicrosoft  reserves the right to review or update this document at any time without notice.  \n \nUsers should take care to always use the latest version of the licensing guide for the most up -to-date information.  \nThe latest version of this guide can be found here. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n   \n \n Power Platform  Licensing Guide | July 2024   P a"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": " g e  | 4 How to buy  \nMicrosoft Licensing Programs  \nPower Platform subscription licenses  \nPower Platform subscription licenses can be purchased through  these channels :  \n• Enterprise Agreement  (EA) \n• Enterprise Agreement Subscription  (EAS)  \n• Server and Cloud Enrollment  (SCE)  \n• Microsoft Products and Services Agreement  \n(MPSA)  \n• Enterprise Agreement for Government   \n• Enrollment for Education Solutions  (EES)  • Microsoft Partners  \n• Directly from Microsoft  \no Power Apps    \no Power Automate  \no Copilot Studio  \no Power Pages  \n \nProduct licensing  \nPower Apps, Power Automate, Copilot Studio and Power Pages provide licensed users the ability to create and run apps, \nbots, and custom websites. Any user or device that inputs data into, queries, views  data from or otherwise accesses Power \nApps, Power Automate, Copilot Studio  and Power Pages, directly or indirectly must be properly licensed. Power Apps, \nPower Automate, Copilot Studio  and Power Pages  use rights can be purchased through the Power Platform subscription \nlicenses, Power Platform subscription add -on licenses, and Power Platform pay -as-you-go meters.  \n \nPower Platform subscription licenses*  \n• Power Apps  \no Power Apps Premium  \no Power Apps per app  \n• Power Automate  \no Power Automate Premium  \no Power Automate Process  \no Power Automate Hosted Process  o Power Automate per user  \no Power Automate per flow  \n• Copilot Studio  \no Copilot Studio  \n• Power Pages  \no Power Pages Authenticated users  \no Power Pages Anonymous users  \n \nPower Platform subscription add -on licenses  \n• Power Automate Process Mining add -on \n• Power Automate unattended RPA add -on \n• AI Builder capacity add -on \n• Dataverse Database capacity add -on • Dataverse File capacity add -on \n• Dataverse Log capacity add -on \n• Power Platform Requests add -on \n \n*Power Platform products are licensed : per User Subscription (User SLs), per bot, p er tenant, and capacity add -ons per \ntenant. These license type s va"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "ry by product.    \n \nPower Platform pay -as-you-go meters  \n• Power Apps per app meter  \n• Power Pages Authenticated users meter  \n• Power Pages Anonymous users meter  • Dataverse Database capacity meter  \n• Dataverse File capacity meter  \n• Dataverse Log capacity meter  \n \nLimited Power Platform use rights are included with  select Dynamics 365, Microsoft/Office 365 and Windows licenses  \nenabling licensed users to create applications and flows based on Microsoft 365 data. These productivity apps can also \nutilize data outside of Microsoft 365 by connecting to common services including Box.com, Facebook, and many more via \nthe use of standard connectors. Please refer to the summary of Power Apps, Power Automate, Copilot Studio and Power \nPages tables for details.   \n \n \n   \n \n Power Platform  Licensing Guide | July 2024   P a g e  | 5 Power Platform  \nRecomm ended offers  \n \nFor Power BI and Fabric licensing information, refer to Power BI service per user and capacity -based licenses .  \n \nPower Apps   \nPower Apps Premium  \nPower Apps Premium is best for businesses that want one license for users, regardless of the number of apps they need to \nrun. This offer  allows licensed users to create and run unlimited custom applications and create and access unlimited \nPower Pages websites.  \n \n \nPower Apps  subscription  Power Apps use rights \nincluded with:  Power Apps  \nBasic  \nRECOMMENDED MOTION\nPower Apps Premium   \n$20 per user/month  \n(or $12 per user/month \nw/2,000+ new licenses)  Select  Dynamics 365 \nProfessional  and \nEnterprise licenses  1  Use rights with  \nselect  \nMicrosoft 365 \nand Office 365 \nlicenses  \nPlans  Capabilities  \nPower Apps  Run custom apps  Unlimited apps  Within same environ ment  as \nlicensed D365 application(s)  Unlimited  \nRun workflows within the custom app  2 Within app context  Within app context  ⚫ \nRun custom websites  Unlimited websites    \nAI Builder    Service credits3 500 credits    \nPower Platform connectors  Standard  connectors"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "  ⚫ ⚫ ⚫ \nPremium  and custom  connectors  ⚫ ⚫  \nOn prem and cloud services  data transfer  ⚫ ⚫  \nDataverse  Full Dataverse access  ⚫ ⚫ Dataverse for \nTeams only  \nCreate and access custom tables  4,5 ⚫ Pro limited to 15 per app   \nDataverse Database capacity (Accrued)  250 MB6   \nDataverse File capacity (Accrued)  2 GB6   \nManaged Environments  Admin and governance at scale  ⚫ 7 Within app context   \n \nSummary of  \nPower Apps  \n   \n \n Power Platform  Licensing Guide | July 2024   P a g e  | 6 1 Dynamics 365 Pro does not have use rights for Power Apps or Power Pages.  \n2 Power Automate use rights included with Power Apps do not include RPA functionality, which requires a separate purchase of Po wer Automate Premium.  \n3 Cap on accrued capacity: 1,000,000 credits per tenant. For more AI Builder service credits, use the AI Builder capacity add -on.  \n4 For Power Apps use rights with restricted tables and exceptions for case tables, see Restricted tables requiring Dynamics 365 licenses  \n5 For exceptions to Dynamics 365 Field Service use rights for Power Apps users, refer to the Dynamics 365 Licensing Guide . \n6 Dataverse Database and Dataverse  File capacity entitlements accrue at the tenant level. Additional Dataverse Database, File and Log subscription capacity is available  via the \nDataverse 1 GB capacity add -ons.  \n7 When Managed Environments is activated in a specific environment, all Power Apps, Power Automate, Power Pages or Copilot Stud io usage in that environment requires full \nPower Apps, Power Automate, Power Pages, Copilot Studio or Dynamics 365 licenses . Please review Power Platform Managed Environments  for details.   \n \nClick here to jump to more  information on Power Apps . \nPower Automate  \nPower Automate Premium  \nPower Automate Premium per user e nables licensed  users to automate modern applications via API -based digital process \nautomation (cloud flows) and legacy applications via UI -based robotic process automation (desktop flows) in attende"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "d \nmode . \n \nPower Automate Process  \nPower Automate Process licenses a single ‘automation’ bot or critical business process that can be used to automate a \nprocess via robotic process automation in unattended fashion, or UI -based digital process automation.  \n \n \n \nSummary of  \nPower Automate  Power Automate  \nsubscriptions  Power Automate use rights  \nincluded with:  Power Automate \nBasic  \nRECOMMENDED \nMOTION\nPower Automate \nPremium  \n$15 per user/month  1RECOMMENDED \nMOTION\nPower Automate  \nProcess  \n$150 per bot/month  2 Copilot Studio  Power Apps  Select  \nD365 Pro \n& Ent. \nlicenses  Windows  Use rights with  \nselect  Microsoft \n365 and Office \n365 licenses  \nPlans  Capabilities  \nPower \nAutomate3  Cloud flows: (DPA) \nAutomated, instant, \nand scheduled flows  ⚫ ⚫ ⚫4 ⚫4 ⚫4  ⚫ \nBusiness process flows  ⚫ ⚫  ⚫4 ⚫4   \nAttended desktop \nflows ( robotic ) ⚫     ⚫5   \nUnattended desktop \nflows (RPA)   ⚫      \nProcess \nMining  Task Mining  ⚫       \nCloud flows process \nmining integration  ⚫       \nVisualize and analyze \nprocesses    ⚫6,7       \nPower \nPlatform \nconnectors  Standard  connectors  ⚫ ⚫ ⚫4 ⚫4 ⚫4  ⚫ \nPremium  and custom  \nconnectors   ⚫8  ⚫8 ⚫4\n ⚫4 ⚫4   \nOn premises and cloud \nservices data transfer  ⚫ ⚫ ⚫4\n ⚫4 ⚫4   \nAI Builder  Service credits  9 5,000  5,000       \nDataverse  Dataverse use rights  ⚫ ⚫ ⚫4\n ⚫4 ⚫4  Within Teams \nonly \nDatabase (Accrued)  250 MB10 50 MB10      \nFile (Accrued)  2 GB10 200 MB10      \nManaged \nEnviron s. Admin and governance  \nat scale   ⚫11 ⚫11 ⚫ ⚫ ⚫4   \n \n \n1 Per tenant/month, one license allows user or capacity usage  in any environment in the tenant  \n2 Per environment/month, one license allows the bot or process to be used in a single environment. An additional license is req uired if the same bot or process is deployed in a \ndifferent environment.  \n3 See technical documentation  for definitions of each flow type.   \n4 Within app context   \n5 Via Power Automate desktop  only; a free application not intended for business -c"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "ritical functions, with no SLA or Microsoft support. cloud flows, standard/premium connectors,  \n \n \n   \n \n Power Platform  Licensing Guide | July 2024   P a g e  | 7  \n \n \n \n \n \nClick here to jump to more information on Power Automate . \n \nMicrosoft Copilot Studio  \nCopilot Studio is an end -to-end conversational AI platform that empowers you to create and customize copilots u sing \nnatural language or a graphical interface. With Copilot Studio, you can easily design, test, and publish copilots that suit \nyour specific needs for internal or external scenarios across your industry, department, or role.   \n \n \n \n Copilot Studio  \nsubscription s Copilot Studio use rights  with  \nCopilot for Microsoft 365  Copilot Stud io \nuse rights with : \nPlans  RECOMMENDED MOTION  \nCopilot Studio  \n$200 per tenant/month  Copilot Studio in Copilot for \nMicrosoft 365  \nUse rights with Copilot for M365 licenses  \n$30 per user/monthCopilot Studio for Teams  \n(was PVA for Teams)  \nUse rights included with select  \nM/O365 licenses  \nMessages/tenant/month  25,000 Messages1 Unlimited  Unlimited2 (Teams only)  \nGen AI: AI -enabled conversations   \n(Consumption rate of 2 messages)   ⚫3,4 ⚫  \nCreate and Publish your own standalone copilot  ⚫   \nCreate and Publish plugins to customize Copilot \nfor Microsoft 365   ⚫  \nCreate and iterate on  copilot topics using \nexpanded natural language capabilities  5 ⚫   ⚫ \nPower Automate for Copilot Studio cloud flows \n(Automated, instant, and scheduled  \nflows) within the context of Microsoft Copilot \nStudio creations  ⚫ ⚫  \nStandard  Power Platform connectors  ⚫ ⚫ ⚫ \nPremium  and custom  Power Platform connectors  ⚫ ⚫  \nOn premises and cloud services data transfer for \nPower Platform connectors  ⚫ ⚫  \nDataverse for Copilot Studio  ⚫6 ⚫6 Dataverse for Teams  \nManaged Environments  ⚫7   \nThe output you create is…  Your own standalone copilot  Plugins for Copilot for Microsoft 365  Teams chatbot  \nAvailable channels to publish your \ncopilot/plugins  External"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": " channels  \n(e.g., External Web, FB, WhatsApp etc.)  \nInternal Channels  \n(e.g., Internal Web, Teams, etc.)   Copilot for Microsoft 365 only  Teams channel/chat only  \n \n Summary of  \nCopilot Studio  \n1 Copilot Studio messages are the common currency across Copilot Studio capabilities. A billed message is a request or message sent to the copilot triggering an action \nand/or response. Examples: a) User asks copilot when a store is open, and copilot replies with store hours = 1 billed message b) Copilot proactively greets the user on a \nwebsite = 1 billed message, c) User asks copilot for store hours for the upcoming holiday, copilot responds using GenAnswers = 2 billed messages  \n2 A service limit applies, see  Quotas, limits, and configuration values for more information.  \n3 Message Consumption rates: 1) Regular (Non -generative AI) = 1 messag e, 2) Generative AI (Gen AI) answers over your data = 2 messages. Customers can use a mix of \nregular and Generative AI messages.  \n \n \norchestration (scheduled or automatic triggers for desktop flows, attended or unattended, combine cloud flows + desktop flows  in a single automation), sharing desktop flows \ndeveloping in a different environment than the default, Automation Lifecycle Manage ment (ALM), monitoring, execution logs are not included.  \n6 The Power Automate Premium license includes the Process Mining desktop app with advanced analytics and optional Power BI cust omization w ith a separate purchase of Power \nBI. Process Advisor that comes with Power Automate Premium licenses includes out of the box process mining capabilities (preb uilt templates) with very limited customization.  \n7 50 MB of Process Mining data storage per user license, cap on accrued capacity: 100 GB per tenant.   \n8 Desktop flow connector included (This desktop flow connector is not included with Windows licenses).  \n9 Cap on accrued capacity: 1,000,000 credits per tenant. For more AI Builder service credits, use the AI Builder capacity add -on"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": ".  \n10 Dataverse Database and Dataverse File subscription capacity is pooled at the tenant level. Additional Dataverse Database, Dat averse File and Dataverse Log subscription capacity \ncan be purchased in increments of 1 GB.  \n11 When Managed Environments is activated in a specific environment, all Power Apps, Power Automate, Power Pages or Copilot Stud io usage in that environment requires full \nPower Apps, Power Automate, Power Pages, Copilot Studio or Dynamics 365 licenses .. Please see Power Platform Managed Environments for details.  \n \n \n   \n \n Power Platform  Licensing Guide | July 2024   P a g e  | 8  \n \n \nClick here to jump to more information on Copilot Studio . \n \nPower Pages  \nPower Pages Authenticated users  \nBest for businesses that want to allow users to access low -code business websites securely with authenticated access and \nhave predictable licensing  \n \nPower Pages Anonymous users  \nBest for businesses that want to allow viewers to access low -code business websites anonymously and have predictable \nlicensing .  \n \n Power Pages subscriptions Power Pages use right with : \nRECOMMENDED \nMOTION  \nPower Pages  \nAuthenticated \nuser  \nTier 3 (100k+ users) \n$50/pack* RECOMMENDED \nMOTION  \nPower Pages  \nAnonymous \nuser \nTier 3 (100k+ users) \n$25/pack *  Power \nApps \nPremium Select D365 \nEnterprise licenses  \nPlans Capabilities  \nPower Pages  Create, access, host and administer \nwebsites  ⚫ ⚫ ⚫ Within same \nenvironment as licensed \nD365 app  \nSecure access authentication  ⚫    \nPower Platform connectors  Standard  connectors  ⚫ ⚫ ⚫ ⚫ \nPremium  and custom   connectors  ⚫ ⚫ ⚫ ⚫ \nDataverse  Full Dataverse access  ⚫ ⚫ ⚫ ⚫ \nCreate and access custom  \ntables and complex tables1 ⚫ ⚫ ⚫ ⚫ \nDataverse Database capacity (Accrued)  2 GB2 500 MB2 250 MB3  \nDataverse File capacity (Accrued)  16 GB2 4 GB2 2 GB3  \nDataverse Log capacity (Accrued)  1 GB  250 MB    \nManaged Environments  Admin and governance at scale  ⚫4 ⚫4 ⚫ Within app context  \n1 For Power Pages use right"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "s with restricted tables and exceptions for case tables, see Restricted tables requiring Dynamics 365 licenses . \n2 Per capacity pack  \n3 Per license capacity  \n4 When Managed Environments is activated in a specific environment, all Power Apps, Power Automate, Power Pages or Copilot Stud io usage in that \nenvironment requires full Power Apps, Power Automate, Power Pages, Copilot Studio or Dynamics 365 licenses.. Pleas e see  Power Platform Managed \nEnvironments for details.  \n \nClick here to jump to more information on Power Pages . \n \n \n \nSummary of  \nPower Pages  4 More information on Generative Answers capability can be found here. \n5 See Create with Copilot .  \n6 Dataverse for Copilot Studio default capacities: Dataverse Database 5 GB, Dataverse File 20 GB, Dataverse Log 2 GB  \n7 When Managed Environments is activated in a specific environment, all Power Apps, Power Automate, Power Pages or Copilot Stud io usage in that environment requires full \nPower Apps, Power Automate, Power Pages, Copilot Studio or Dynamics 365 licenses .. Please see Power Platform Managed Environments for details.  \nNote: A Copilot Studio User License ($0) is required for each user authoring bots with Copilot Studio. We recommend acquiring  the tenant license and user licenses as part of \na single transaction to simplify onboarding to Copilot Studio .  \n   \n \n Power Platform  Licensing Guide | July 2024   P a g e  | 9 Power Platform  \nOther options  \nPower A pps  \nService Overview  \nPower Apps is a low code/no code application platform that allows enterprises to build, \nmodernize, and deploy unlimited applications for team s, department s, or entire \norganization s and  customize  existing Dynamics 365 and Microsoft/ Office 365  \napplications. For more details, please visit https://powerapps.microsoft.com/ . \n  \nLicensing overview  \nGeneral purpose, full Power Apps capabilities are licensed via Power Apps subscriptions on a per user basis and via pay -\nas-you-go enabling licensed users to"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": " create, customize, share, and run business applications . These  offers  are fully \nfeatured.   \nAdditionally, limited Power Apps capabilities are included within select Dynamics 365 and Microsoft/Office 365 licenses. \nFor more information, please see the sections titled Power Apps use rights included with Dynamics 365  licenses and Power \nApps Basic  later in this document.  \nA high -level overview of the licensing structure is provided below.  \n Power Apps Premium  Power Apps  per app  Power Apps p er app  \npay-as-you-go \nLicensing scheme  Per user  Per user,  per app  Per Active User  \nDescription  Equips user to run \nunlimited applications  and \naccess unlimited Power \nPages websites  Licenses  individual user to \nrun 1 application or access \n1 Power Pages website  in \na specific environment  Allows user to access 1 \napplication  \n  \nPower Apps Premium  \nPower Apps Premium  is best for businesses that want one license for users, regardless of the number of apps  they need to \nrun. This offer enables  licensed users to run unlimited custom applications and access unlimited Power Pages websites.  \n \nPer user offer summary  \nSKU Name  Power  Apps Premium  \nLicense type  Per user  \n \nPower Apps per app   \nPower Apps per app licenses individual users to run 1 custom application or access 1 Power Pages website  in a specific \nenvironment  based on the full capabilities of Power Apps.  \n \nPer user, per app offer summary  \nSKU Name  Power  Apps  per app  \nLicense type  Per user , per app license  \nAre licenses stackable?  Yes \n \nPower Apps per app is b est for businesses that want to license users for each app or website,  with the flexibility to stack \nlicenses . Customers with per app typically start with 1 -2 leading use case scenarios before adopting the platform more \n\n   \n \n Power Platform  Licensing Guide | July 2024   P a g e  | 10 broadly. Power Apps per app is an attractive licensing option for licensing end users that run only a few apps  and/or \naccess only"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": " a few websites . \nNote:  \n• A single user might be covered by multiple ‘per app’ licenses to allow the user to use multiple solutions targeted \nat various business scenarios, without requiring a per user license.  \n• Once a pool of Power Apps per app licenses is purchased, individual licenses need to be assigned to specific \nenvironments and to individual users (i.e. , if the same app or website exists in two environments, a user will \nrequire two per app User SLs to access both ). \n• Power Apps per app is also available to qualified education customers under faculty and student pricing. Since \nthese licenses are sold as tenant level capacity and are not assigned to users in Active Directory, customers and \npartners will be responsible for ensuring that student pri cing is applied to students only.  \n \nPower Apps per app pay -as-you-go meter  \nThe Power Apps per app meter enables individual users to run one custom application. This option is best for businesses \nthat want to pay -as-you-go for only the users who access a Power App one more times in a month.  \n \nPower apps per app pay -as-you-go offer summary  \nSKU Name  Power Apps Per App Active User -1 \nMeter name  Power Apps per app meter  \n \nPower Apps per app pay -as-you-go m eter definition : A measure of the number of unique, active users who open a single \npay-as-you-go enabled app in an environment one or more times in a month.  \n \nPower Apps use rights included with Dynamics 365 licenses  \nLimited Power Apps  use rights are included within the same environment(s) as the licensed Dynamics 365 application(s) to \nallow users to customize and extend Dynamics 365 applications . Use of Power Apps capabilities included with Dynamics \n365 licenses must be only within the context of and in the same environment as the licensed Dynamics 365 application. \nUse rights vary by Dynamics 365 license type.  \n \nPower Apps Basic  \nPower Apps Basic (limited Power apps use rights included with select Microsoft 365 and Office 36"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "5 licenses ) allow s users \nto customize and extend Microsoft 365 and Office 365 for productivity scenarios , and t o deliver a comprehensive low -\ncode extensibility platform for Microsoft Teams  only. For a complete list of Microsoft 365 and Office 365 and licenses that \ninclude Power Apps and Dataverse for Teams use rights, please refer to Appendix B .  \n   \n \n Power Platform  Licensing Guide | July 2024   P a g e  | 11     Power Apps  \nSubscriptions  Power Apps  \nsubscription s Power Apps per app \npay-as-you-go  Power Apps use \nrights  included with:  Power Apps  \nBasic  \n \nRECOMMENDED MOTION  \nPower Apps \nPremium  \n$20 per user/month  \n(or $12 per user/month \nwith 2,000 + new per \nuser licenses)  Power Apps \nper app  \n$5 per  \nuser/month    Power Apps  \nper app meter1 \n$10 per active  \nuser/app/month   \n \nSelect  \nDynamics 365 \nPro & E nt \nlicenses2 \n  Use rights with  \nselect  Microsoft  \n365 and Office \n365 licenses  \nPlans  Capabilities    \nPower Apps   \nRun custom apps  Unlimited apps  1 app or  \n1 website  \n(In a specific \nenvironment)  \n  1 app  Within same \nenvir onment  as \nlicensed D365 \napplication(s)  Unlimited  \nRun custom websites  Unlimited websites        \nRun workflows within the custom \napp3 ⚫4 ⚫4  ⚫4 ⚫4 ⚫ \nAI Builder   Service credits5 500 credits  250 credits        \nPower Platform  \nconnectors  Standard  connectors  ⚫ ⚫ ⚫ ⚫ ⚫ \nPremium  and custom  connectors  ⚫ ⚫ ⚫ ⚫   \nOn premises and cloud services  \n⚫ ⚫ ⚫ ⚫   \ndata transfer  \nDataverse  Full Dataverse access  ⚫ ⚫ ⚫ ⚫ Dataverse for Teams \nonly \nCreate and access custom tables6,7 ⚫ ⚫ ⚫ Pro limited to 15 \nper app    \nDataverse Database capacity \n(Accrued)  250 MB8 50 MB8      \nDataverse File capacity (Accrued)  2 GB8 400 M B8      \nManaged \nEnvironments  Admin and governance at scale  ⚫9 ⚫9     ⚫4   \n \n \nSummary of \nPower Apps  \n \n   \n \n Power Platform  Licensing Guide | July 2024   P a g e  | 12 1 Environments that are configured to use Power Platform pay -as-you-go, receive a one -time ent"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "itlement of 1 GB of Dataverse Database capacity and 1 \nGB of Dataverse File capacity per environment. Additional Dataverse Database, Dataverse File and Dataverse Log  subscription capacity can be purchased \nin increments of 1 GB.  \n2 Dynamics 365 Pro does not have use rights for Power Apps or Power Pages.  \n3 Power Automate use rights included with Power Apps do not include RPA functionality, which requires a separate purchase of Po wer Automate \nPremium  \n4 Within app context  \n5 Cap on accrued capacity: 1,000,000 credits per tenant. For more AI Builder service credits, use the AI Builder capacity add -on. \n6 For Power Apps use rights with restricted tables and exceptions for case tables, see Restricted tables requiring Dynamics 365 licenses  \n7 For exceptions to Dynamics 365 Field Service use rights for Power Apps users, refer to the Dynamics 365 Licensing Guide . \n8 Dataverse Database and Data verse File capacity entitlements accrue at the tenant level. Additional Dataverse Database, Dataverse File and Dataverse \nLog subscription capacity can be purchased in increments of 1 GB via the Dataverse capacity add -ons. ` \n9 When Managed Environments is activated in a specific environment, all Power Apps, Power Automate, Power Pages or Copilot Stud io usage in that \nenvironment requires full Power Apps, Power Automate, Power Pages, Copilot Studio or Dynamics 365 licenses. Please  see Power Platform Managed \nEnvironments for details.  \n \nPower Automate  \nService Overview  \nPower Automate allows enterprises to implement automated workflows and business processes \nand achieve operational efficiencies. For more details, please visit  \nhttps://powerautomate.microsoft.com/ . \nLicensing overview  \nGeneral purpose Power Automate capabilities are licensed via Power Automate subscription licenses.  Additionally, l imited \nPower Automate capabilities are also included within Power Apps, Dynamics 365, Microsoft/ Office 365, and Windows \nlicenses . For more information, please see t"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "he sections titled Power Automate use rights included with Power \nApps/ Dynamics 365 /Microsoft/ Office 365  and Windows  licenses  later in this document.   \nA high-level overview of the licensing structure is provided below.   \nPower Automate  Premium Process  Hosted Process  Process Mining  \n(PM)  Per user  Per flow \n(min imum  5 licenses)  Unattended RPA  \nadd-on \nLicensing scheme  Per user/month1 Per bot/month2 Per bot/month2 100 GB of PM data \ncapacity /month3 Per user/month1 Per flow/month2 Per bot/month2 \nDescription  Enables licensed users \nto automate modern \napplications via API -\nbased Digital Process \nAutomation (cloud \nflows) and legacy \napplications via UI -\nbased Robotic Process \nAutomation (desktop \nflows) in attended \nmode  \n \n Licenses an \nautonomous bot \nthat run s \nunattended Robotic \nProcess Automation , \nor a core business \nprocess  (e.g., invoice \nprocessing or HR \nonboarding)  that \ncan be accessed  \norg-wide without \nlicensing individual \nusers  \n \n Superset of Power \nAutomate Process, \nproviding the same \nfunctionality but \nwith the addition of \na Microsoft hosted \nmachine capacity \nthat enables R obotic \nProcess Automation  \nwith zero \ninfrastructure  Capacity based \nlicense that enables \nrapid ROI for \ncustomers by \nidentifying critical \noptimization \nopportunities and \nimproving existing \nprocesses. Add -on \nto Power Automate \nPremium  \n \n Best for businesses \nthat want to license \nindividual users to \ncreate unlimited \ncloud flows  \n \n \n Best for businesses \nthat want to \nimplement flows \nwith reserved \ncapacity for \nunlimited users \nacross an \norganization   \n \n Add-on to Power \nAutomate Premium \nor Power Automate \nper flow that \nenables a bot to run \nautonomously on a \nlocal remote \ndesktop or \nvirtualized \nenvironment  \n \n \n1 Per tenant/month, one license allows user or capacity to use in any environment in the tenant.  \n2 Per environment/month, one license allows the bot or process to be used in a single environment. An additional "
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "license is req uired if the same bot or process is deployed in a different environment.  \n3 Per 100 GB of PM data stored per tenant/month, capacity -based license/tenant.  \n \n \nPower Automate  Premium  \nPower Automate Premium spans modern and legacy applications enabling licensed users to create and run unlimited \ncloud flows using Digital Process Automation (DPA), plus automate legacy applications with desktop flows through \nRobotic  Process Automation (RPA) in attended mode. This offer includes full Process Mining desktop functionality and a \n\n   \n \n Power Platform  Licensing Guide | July 2024   P a g e  | 13 limited amount of Process Mining data capacity  (50 MB that can be pooled to a max of 100GB per tenant ). Additionally, \nPower Automate Premium includes access to AI Builder capacity in support of scenarios like forms processing, object \ndetection, prediction, text classification and recognition, and provides the ability for a user to run an attended RPA bot o n \na workstation.   \nPlease note running an RPA bot in an unattended  scenario requires the addition of the Power Automate Hosted Process  \nlicense . \nPower Automate Premium  \nSKU Name  Power Automate Premium  \nLicense Type  Per user*  \nCloud Flows1 (Automated, instant, scheduled, and \nbusiness process flows)  Unlimited  \nDesktop flows (with attended RPA bots)2 1 bot  \nIncluded AI Builder service credits  5,000  per month  \nIncluded Process Mining data storage  50 MB per user license, up to 100 GB per tenant  \n \n \n \n \nNote:  \n• Desktop flow authoring, bot orchestration and management are included in th is offer.  \n• Additional AI Builder capacity can be purchased per 1M service credits for $500/month; AI Builder service credit \ncapacity is pooled at the tenant level .  \n \nPower Automate Process  \nThe Power Automate Pro cess license  can be used to license a single autonomous bot that can be used for unattended \nrobotic process automati on (unattended RPA),  independent of a user , or a critical business"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": " process that can be accessed \norg-wide without licensing individual users.  Power Automate Process also includes access to AI Builder capacity in support \nof scenarios like forms processing, object detection, prediction, text classification, and recognition.  \n \nWhen licensing bots for unattended automation : \n• Concurrent instances of a singular process require an additional unattended bot for each instance .  \n• Unattended bots can be deployed on a local, remote desktop, or other virtualized environment . This license does \nnot include  any of these resources. The Power Automate Hosted Process license includes all the value of the \nPower Automate Process license with a virtual machine hosted and managed by Microsoft  \n \nWhen licensing business processes (e.g., invoice processing or HR onboarding) :  \n• Every top -level flow needs to be licensed individually.  ‘Child flows’ triggered by another flow do not need to be \nadditionally licensed.   \n• Scheduled flows may be configured to trigger every minute, irrespective of license type. There are no limits on the \nfrequency of flow runs beyond what a connector supports.  \n  \nPower Automate Process  \nSKU Name  Power Automate Process  \nLicense Type  Per bot*  \nIncluded AI Builder service credits  5,000  per month  \nMinimum initial p urchase  None  \n*Per environment/month, one license allows the bot or process to be used in a single environment.  \nAn additional license is required if the same bot or process is deployed in a different environment.  \n \n \nPower Automate Hosted Process  \nLicensed per bot, Power Automate Hosted Process is a superset of Power Automate Process, providing the same 1Unlimited flows within service limits . See technical documentation  for definitions of each flow type.   \n2Multiple desktop flows may be authored/recorded for the RPA bot to execute. However, a bot can only execute one discrete \ndesktop flow (i.e., process) at a time. Multiple processes must be serialized to run sequentially.  \n*Per "
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "tenant/month, one license allows user or capacity to use in any environment in the tenant . \n \n \n   \n \n Power Platform  Licensing Guide | July 2024   P a g e  | 14 functionality , but also includes a virtual machine  for running una ttended automation  with zero infrastructure . Each Hosted \nProcess license provides capacity for a single Microsoft hosted machine.  \nPower Automate Hosted Process  \nSKU Name  Power Automate Hosted Process  \nLicense Type  Per bot*  \nIncluded AI Builder service credits  5,000 per month  \nAdditional licensing may be \nrequired  Any software automated with an unattended bot may require additional licensing. \nFor example, unattended RPA scenarios incorporating M/O365 require the Microsoft \n365 - Unattended License. Please see the Product Terms  for more information.  \n \n*Per environment/month, one license allows the bot or process to be used in a single environment. An additional license is re quired if the same bot or process is \ndeployed in a different environment.  \n \n• One Hosted Process license includes the capacity for one Microsoft hosted machine and an unattended RPA bot. \nAll desktop flows (RPA) running on the machine and cloud flows (DPA) that are part of the business process are \nalso covered by the license.  \n• One Hosted Process license can also be used as a Process license to run unattended automation on a customer \nmanaged machine.  \n• Additional AI Builder capacity can be purchased per 1M service credits for $500/month; AI Builder service credit \ncapacity is pooled at the tenant level.  \n• Any services or applications the unattended bot accesses must be licensed separately. For instance, if the bot is \naccessing Windows or Office, the Microsoft 365 – Unattended License must also be purchased in addition to the \nPower Automate Hosted Process li cense.  \nNote : Hosted Process licenses the machine and not the user. The Power Automate Premium user license is required to \nrun attended RPA, and for RPA developers to build and manag"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "e desktop flows on the Power Automate portal. To \nlearn more about the Premium RPA feat ures that come with the Premium user license, go to Premium RPA features . \n \nPower Automate Process Mining  \nProcess Mining is a capacity -based , add-on license that enables rapid ROI for customers by identifying critical \noptimization opportunities and improving existing processes. There are no limits to the number of users per tenant.  \n \nCapacity should be purchased for peak  utilization over a 12 -month contract period. If customers experience monthly or \nseasonal spikes, they must purchase enough capacity to allow for this high \"watermark” when estimating the amount of \ncapacity needed per month.  \n \nProcess Mining  add-on \nSKU Name  Power Automate Process Mining  \nLicense Type  Per 100 GB of data  stored  /month * \nQualifying base license  Power Automate Premium  \nCapacity per license  100 GB of data stored/month  \n                                                *Per 100 GB of data stored per tenant/month, capacity -based license/tenant.  \n \nPower Automate per user  \nPower Automate per user equips individual users to create and run unlimited workflows and business processes based on \ntheir unique needs. The per user license  is intended to support the broad adoption of an automation culture in an \norganization. Should the entire organization be licensed with the Power Automate per user, admins will have minimal \noverhead with tracking how many flows are  being activated and used within the organization.  \n \nPer user offer details  \nSKU Name  Power Automate  per user  \nLicense Type  Per user*  \nEnabled flows Unlimited  \n   \n \n Power Platform  Licensing Guide | July 2024   P a g e  | 15 * Per tenant/month, one license allows user or capacity to use in any environment in the tenant.  \n \nPower Automate per flow  \nPower Automate per flow is licensed by top-level flow and allows customers to implement critical business processes with \ncapacity that serve s teams, departments, o"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "r the entire organization without individually licensing each end user that \ntriggers the licensed flow.  \nPer flow offer details  \nSKU Name  Power Automate per flow  \nLicense Type  Per flow*  \nMinimum initial p urchase  5 units  \n*Per environment/month, one license allows the bot or process to be used in a single environment.  \nAn additional license is required if the same bot or process  is deployed in a different environment.  \n \n• All top-level flows  need to be licensed  individually  (scheduled flows, automated flows, instant flows, and business \nprocess flows). Flows that are only used as “child” flows (triggered by another flow) do not need to be additionally \nlicensed . \n• Customers wishing  to license more top -level flows, should purchase more units of the “Power Automate per flow. ” \nNote : scheduled flows may be configured to trigger every minute, irrespective of license type. There are no limits on the \nfrequency of flow runs beyond what the connector supports.  \n \nPower Automate unattended RPA add -on \nThe Power Automate unattended RPA add -on extends desktop -based automation by enabling a bot to run autonomously, \ni.e., independent of a user . Unattended bots c an be deployed on a local , remote desktop, or other virtualized environment . \nPower Automate Premium or Power Automate per flow qualify as base licenses for the unattended RPA add -on. M ultiple \nunattended RPA add -on licenses  can be added with  a single qualifying base license . \nThe Power Automate unattended RPA add -on is licensed by bot. C oncurrent instances of a singular process require an \nadditional unattended bot for each instance .  \nPower Automate Unattended RPA add -on \nSKU Name  Power Automate  unattended RPA add -on  \nLicense Type  Per bot*  \nQualifying base licenses  Power Automate Premium, Power Automate per flow  \nIncluded AI Builder service credits  5,000/month  \nAdditional licensing may be required  Any software automated with an unattended bot may require additional \nl"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "icensing. For example, unattended RPA scenarios incorporating M/O365 \nrequire the Microsoft 365 - Unattended License . Please see the Product \nTerms  for more information.  \n*Per environment/month, one license allows the bot or process to be used in a single environment. An additional license is re quired if the same bot or process is \ndeployed in a different environment.  \n \n• One unattended RPA add -on license i ncludes the rights to one unattended RPA bot, a s well as all necessary \nfunctions tied t o desktop  flow authoring, bot orchestration and management . \n• Running the unattended RPA bot in a VM requires the separate purchase of any necessary compute resources . \n• Additional AI Builder capacity can be purchased per 1M service credits for $500/month; AI Builder service credit \ncapacity is pooled at the tenant level .  \n \nPower Automate use rights included with Power Apps licenses  \nThe Power Apps Premium, Power Apps per app and Power Apps pay -as-you-go licenses  include Power Automate use \nrights for the purpose of automating workflows associated with Power Apps applications. Power Automate use within \n   \n \n Power Platform  Licensing Guide | July 2024   P a g e  | 16 Power Apps is limited to the context of the Power Apps application. What this means is that for both triggers  and actions , \na flow  included within a Power Apps application connect to:  \n• Any data source within the use rights of the  Power Apps application . \n• Directly with the Power Apps  application (via built in trigger/action) . \nIf the flow is isolated and has nothing to do with the Power Apps application, then a full Power Automate license will need \nto be purchased.  \n \nExample of Power Automate use within Power Apps application context  \nA user with a full Power Apps license runs an app that uses a SQL Server database  as the data source and includes flows \nthat: \n• Read from OR write to the SQL Server database.  \n• Use a built -in Power Apps  trigger and/or action – e.g., sends a"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": " push notification to the app . \n \nExample of Power Automate use outside of Power Apps application context  \nThe same user (in the example above) now also wants to use a flow that updates an Oracle database , that: \n• Is completely unrelated to the Power Apps app.  \n• Does not interact in any way with the Power Apps  app (or its data sources) . \nThis user will then require a full Power Automate license.  \n \nPower Automate use rights included with Dynamics 365 licenses  \nDynamics 365 licenses include Power Automate use rights for the purpose of customizing and extending Dynamics 365 \napplications.  Power Automate use within Dynamics 365 is limited to the context of the embedding Dynamics 365  \napplication. F or both triggers and actions, flows  included within the Dynamics 365 application can connect:  \n• To any data source within the use rights of the  Dynamics 365 application  \n• Directly with the Dynamics 365  application (via built in trigger/action)  \nIf the embedded flow is not within the context of the Dynamics 365 application, then full  Power Automate licenses will \nneed to be purchased.   \n \nPower Automate Basic  \nPower Automate Basic (Power Automate use rights included with select M icrosoft  365/Office 365 licenses ) allow s users to \ncustomize and extend Microsoft 365/Office 365 for productivity scenarios , and t o deliver a comprehensive low -code \nextensibility platform for Microsoft Teams  only. For a complete list Microsoft 365/Office 365 licenses that include Power \nAutomate and Dataverse for Teams use rights, please refer to Appendix B . \n \nPower Automate use rights included with Windows licenses  \nLimited Power Automate use rights are included with select Windows licenses to create and execute personal desktop \nautomation for attended RPA capabilities in Power Automate Desktop. This expands the digital workforce’s ability to \nautomate legacy tasks tha t can slow down workflows, empowering Windows users to start automating redundant and \ntime-consu"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "ming tasks with low -code automation through RPA. For a complete list of Windows licenses that include these \nuse rights, please refer to Appendix B.  \n \nPower Automate use within Windows is available for all applications and websites (across all web browsers). Enterprise \nautomation and administrative rights are not available in Windows. \n   \n \n Power Platform  Licensing Guide | July 2024   P a g e  | 17  \nPower Automate  \nsubscriptions  Power Automate  \n use rights included with:  Power Automate \nBasic \nRECOMMENDED \nMOTION  \nPower Automate  \nPremium  \n$15 per user/month1 RECOMMENDED \nMOTION  \nPower Automate  \nProcess  \n$150 per bot/month2 Power Automate  \nHosted Process  \n$215 per bot/month2 Process Mining3 \n$5,000 per  \n 100 GB of data \nstored/month4 Per  \nuser \n$15 per \nuser/month1 Per flow  \n$100 per  \nflow/month2  \n(Min . purchase  \n 5 licenses) Unattended  \nRPA add-on5 \n$150 per bot/month2 Copilot  \nStudio  Power \nApps  Select  \nD365 \nlicenses  Windows  Use rights with Select  \nM365/O365 licenses  \nPlans  Capabilities  \nPower \nAutomate6  Cloud flows ( DPA) Automated, \ninstant, scheduled flows  ⚫ ⚫ ⚫  ⚫ ⚫ ⚫ ⚫7 ⚫7 ⚫7  ⚫ \nBusiness process flows  ⚫ ⚫ ⚫  ⚫ ⚫ ⚫  ⚫7 ⚫7   \nAttended desktop flows  ⚫           ⚫8  \nUnattended desktop flows  \n(RPA)   \n⚫ ⚫  \n  \n⚫  \n    \nMicrosoft hosted machine    ⚫          \nProcess Mining  Task Mining  ⚫   ⚫         \nCloud flows process mining \nintegration  ⚫   ⚫         \nVisualize and analyze \nprocesses   ⚫9,10   ⚫ ⚫        \nPower \nPlatform \nconnectors  Standard  connectors  ⚫ ⚫ ⚫  ⚫ ⚫   ⚫7 ⚫7  ⚫7  ⚫ \nPremium  and custom  \nconnectors  ⚫11  ⚫11 ⚫  ⚫  ⚫11\n  \n ⚫7 ⚫7 ⚫7   \nOn prem & cloud services  data \ntransfer  ⚫ ⚫ ⚫  ⚫ ⚫  \n ⚫7 ⚫7 ⚫7   \nAI Builder  Service credits12 5,000  5,000  5,000     5,000       \nDataverse  Dataverse use rights  ⚫ ⚫ ⚫  ⚫ ⚫   ⚫7  ⚫7  ⚫7  Within Teams only  \nDatabase capacity (Accrued)  250 MB13 50 MB13 50 MB13\n 2 GB13 250 MB13 5 0MB13       \nFile capacity (Accrued)  2 GB13 200 MB13 20013 1 TB13 2 GB13 200 MB13    "
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "   \n    Managed \nEnvirons.  Admin & governance at scale  ⚫14\n ⚫14\n ⚫14\n  ⚫14\n ⚫14\n  ⚫ ⚫  ⚫7   \n1 Per tenant/month, one license allows user or capacity to use in any environment in the tenant.  \n2 Per environment/month, one license allows the bot or process to be used in a single environment. An additional license is req uired if the same bot or process is deployed in a different environment.  \n3 Process Mining qualifying prerequisite: Power Automate Premium. Multiple add -ons can be applied against a single qualifying prerequisite license.  \n4 Per 100 GB of PM data stored per tenant/month, capacity -based license/tenant.  \n5 Qualifying prerequisites  for the  Unattended  RPA add -on: Power Automate Premium and Power Automate per flow. Multiple add -ons can be applied against a single qualifying prerequisite license.  \n6 See technical documentation  for definitions of each flow type.  \n7 Within app context. For both triggers and actions, flows within an embedding app, can connect to any data source within the u se rights of the embedding application and directly with the embedding application.  \n8 Via Power Automate desktop  only; a free application not intended for business -critical functions, with no SLA or Microsoft support. cloud flows, standard/premium connectors, orchestration (scheduled or a utomatic triggers for desktop flows, attended or un attended, combine \ncloud flow s + desktop flows in a single automation), sharing desktop flows, developing in a different environment than the default, Aut omation Lifecycle Management (ALM), monitoring, execution logs are not included.  \n  \n \n \n \nSummary of \nPower Automate  \n   \n \n Power Platform  Licensing Guide | July 2024   P a g e  | 18  \n \n \nMicrosoft Copilot Studio  \n \nService Overview  \nCopilot Studio is an end -to-end conversational AI platform that \nempowers you to create and customize copilots using natural \nlanguage or a graphical interface. With Copilot Studio, you can \neasily design, test, and publish copil"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "ots that suit your specific \nneeds for internal or external scenarios across your industry, \ndepartment, or role.  For more information please visit:  \naka.ms/copilotstudio .  \n \nLicensing overview  \nCopilot Studio capabilities are licensed via capacity packs, (1 capacity pack = 25,000 messages/mont h). \nFor additional capacity, add more capacity packs.  \n \n \nMicrosoft Copilot Studio Offer Summary  \nSKU Name  Copilot Studio  \nLicense type  Tenant license  \n1 Capacity Pack 25,000 messages  per month  \nBilled Messages  \n \n \n \n \n \n \n \n \n \n \n \nA Copilot Studio User License ($0) is required for each user authoring bots with Copilot Studio. We \nrecommend acquiring the tenant license and user licenses as part of a single transaction to simplify \nonboarding to Copilot Studio . Customers will be charged according to the consumption of “billed messages,” the common currency \nacross Copilot Studio capabilities. A billed message is a request or message sent to the copilot \ntriggering an action and/or response . \n \nMessage Consumption rates  \n• Regular (Non -generative AI) = 1 message  \n• Generative AI (Gen AI) answers over your data = 2 messages  \n \nExamples  \na) User asks copilot when a store is open, and copilot replies with store hours = 1 billed message   \nb) Copilot proactively greets the user on a website = 1 billed message   \nc) User asks copilot for store hours for the upcoming holiday, copilot responds using GenAnswers \n= 2 billed messages  \n \nCustomers can use a mix of Regular and Generative AI messages.  \n \n9 The Power Automate Premium license includes the Process Mining desktop app with advanced analytics and optional Power BI cust omization with a separate purchase of Power BI. Process \nAdvisor that comes with Power Automate Premium licenses includes out of th e box process mining capabilities (pre -built templates) with very limited customization.  \n10 50 MB of Process Mining data storage per user license, cap on accrued capacity: 100 GB per tenant.  \n11 Desktop f"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "low connector is included. (This desktop flow connector is not included in Windows licenses.)  \n12 Cap on accrued capacity 1,000,000 credits per tenant. Additional AI Builder capacity can be purchased per 1M service credits for $500/month via the AI Builder capacity add -on. \n13 Dataverse Database and File subscription capacity is pooled at the tenant level. Additional Dataverse Database, Dataverse Fil e and Dataverse Log subscription capacity can be purchased in \nincrements of 1 GB.  \n14 When Managed Environments is activated in a specific environment, all Power Apps, Power Automate, Power Pages or Copilot Stud io usage in that environment requires full Power Apps, \nPower Automate, Power Pages, Copilot Studio or Dynamics 365 licenses. Please  see Power Platform Managed Environments for details.  \n   \n \n Power Platform  Licensing Guide | July 2024   P a g e  | 19 Copilot Studio  \nSubscription  Copilot Studio use rights  \nwith Copilot for Microsoft 365  Copilot Studio use rights  \nincluded with:  \nPlans RECOMMENDED MOTION  \nCopilot Studio  \n$200 per tenant/month  Copilot Studio in Copilot for Microsoft 365  \nUse rights with Copilot for Microsoft 365 licenses  \n$30 per user/month  Copilot Studio for Teams  \n(was PVA for Teams)  \nUse rights included with select  M/O365 licenses  \nMessages/tenant/month  25,000 Messages 1 Unlimited  Unlimited2 (Teams only)  \nGen AI: AI -enabled conversations       ⚫ 3, 4 ⚫  \nCreate and Publish  your own standalone copilot  ⚫    \nCreate and Publish plugins to customize Copilot  for Microsoft 365   ⚫  \nCreate and iterate on  copilot topics using expanded natural  \nlanguage capabilities  5 ⚫  ⚫ \nPower Automate for Copilot Studio cloud flows ( Automated, instant, \nand scheduled flows) within the context of Copilot Studio creations  ⚫ ⚫  \nStandard  Power Platform connectors  ⚫ ⚫ ⚫ \nPremium  and Custom  Power Platform connectors  ⚫ ⚫  \nOn premises and cloud services data transfer for Power Platform \nConnectors  ⚫ ⚫  \nDataverse for Copilot Stud"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "io     ⚫ 6   ⚫ 6 Dataverse for Teams  \nManaged Environments     ⚫ 7   \nThe output you create is…  Your own standalone copilot  Plugins for Copilot for Microsoft 365  Teams chatbot  \nAvailable channels to publish your copilot/plugins  External channels  \n(e.g., External Web, FB, WhatsApp etc.)   \nInternal Channels  \n(e.g., Internal Web, Teams, etc.)   Copilot for Microsoft 365 only  Teams channel/chat only  Summary of \nCopilot Studio  \n \n \n \n1Copilot Studio messages are the common currency across Copilot Studio capabilities. A billed message is a request or message sent to the copilot triggering an action and/or response. Examples: a) User asks copilot when a store is open, and copilot re plies with store \nhours = 1 billed message b) Copilot proactively greets the user on a website = 1 billed message, c) User asks copilot for sto re hours for the upcoming holiday, copilot responds using GenAnswers = 2 billed messages \n2A service limit applies, see Quotas, limits, and configuration values for more information. \n3Message Consumption rates: 1) Regular (Non -generative AI) = 1 message, 2) Generative AI (Gen AI) answers over your data = 2 messages. Customers can use a mix of regular  and Generative AI messages. \n4More information on Generative Answers capability can be found here.  \n5See Create with Copilot .  \n \n   \n \n Power Platform  Licensing Guide | July 2024   P a g e  | 20  \n \n \n \n \nCapacity enforcement  \nAll Copilot Studio  purchased capacity is enforced monthly and unused messages  do not carry over month \nto month. While occasional and reasonable overages will be tolerated, customers exceeding purchased \ncapacity should adjust their purchase quantity per standard Microsoft terms to remain in compliance. \nComprehensive monitoring, reporting,  and alerting mechanisms will be instituted to assist customers with \nmanaging Copilot Studio  capacity. More stringent technical enforcement (including service denial) will \nresult for usage that is significantly over the pur"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "chased capacity.  \nCopilot Studio in Copilot for Microsoft 365  \nLicensed Copilot Studio in Copilot for Microsoft 3 65 users can create , manage and publish plugins from \nCopilot Studio to Copilot for Microsoft 365. You can also use Copilot Studio to extend other Microsoft \ncopilot experiences that use plugins.  \nMicrosoft Copilot Studio  for Teams use rights included with Microsoft/Office 365 licenses  \nMicrosoft Copilot Studio  for Teams enables customers with select M icrosoft /Office 365 licenses to build \nand deploy custom chatbots directly within Teams, using Dataverse for Teams.  For a complete list of \nM/O365 licenses that include Microsoft Copilot Studio  for Teams use rights, please refer to Appendix B .  \nMicrosoft Copilot Studio  use rights included with Dynamics 365 licenses  \nSelect Dynamics 365 licenses include limited Microsoft Copilot Studio  use rights and session capacity for \nthe purpose of extending Dynamics 365 applications. Please refer to the Dynamics 365 Licensing Guide  \nfor information related to these entitlements.  \n \nPower Pages  \n \nService Overview  \nPower Pages delivers a secure, enterprise -grade platform for \ncreating, hosting,  and administering modern external -facing \nbusiness websites. For more details, please visit  \nhttps://powerpages.microsoft.com/    \n \nLicensing overview  \nPower Pages licensing is based on two user types, authenticated users per website /month and \nanonymous users per website /month. Sufficient user capacity must be assigned to the environment to \ncover the total number of unique users who access the website/month.    \n• Authenticated users definition:  Power Pages authenticated users are users who obtain secure access \nto a website by logging in through an authentication provider on the website.  \n• Anonymous users definition:  Power Pages anonymous users are users who access a website and do \nnot log in.  \n6 Dataverse for Copilot Studio default capacities: Dataverse Database 5 GB, Dataverse File 20 GB, Da"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "taverse Log 2 GB \n7 When Managed Environments is activated in a specific environment, all Power Apps, Power Automate, Power Pages or Copilot Stud io usage in that environment requires full Power Apps, Power \nAutomate, Power Pages, Copilot Studio or Dynamics 365 licenses.. Pleas e see Power Platform Managed Environments for details. \nNote: A Copilot Studio User License ($0) is required for each user authoring bots with Copilot Studio. We recommend acquiring the t enant license and user licenses as part of a single transaction \nto simplify onboarding to Copilot Studio.  \n \n   \n \n Power Platform  Licensing Guide | July 2024   P a g e  | 21 Power Pages  \nAll Power Pages licenses include  the full capabilities of Power Pages . Organizations  that need full -fledged  \ngeneral purpose Power Pages websites to create, host and administer rich, interactive, data first, business \nweb apps worldwide should purchase  Power Pages  capacity packs .  \nPower Pages Authenticated user subscriptions  \nAuthenticated user subscription licenses are offered for the number of unique, authenticated users  \naccessing a website. These licenses are offered  through capacity packs with 100 users per capacity pack. \nThree tiers of pricing are offered . Once the minimum  purchase requirement is met , additional packs  can \nbe purchased in units of one.  \nPower Pages authenticated user capacity packs  \nCapacity Pack Tiers  Capacity Packs  \nMinimum purchase  Total Number of users  \n(1 capacity pack  = 100 users ) Pricing  \nTier 1   1 capacity pack 100+ users  $200/pack  \nTier 2  100 capacity packs  10,000+ users  $75/pack  \nTier 3   1,000 capacity packs  100,000+ users  $50/pack  \nCustomers should purchase the necessary number of capacity pack licenses  to cover the anticipated \nnumber of authenticated users that will access each Power Pages website over a monthly period. Unused \ncapacity does not carry over to the next month. Note: A uthenticated user capacity needs to be  assigned \nto an environme"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "nt.  \nPer Authenticated user offer details  \nSKU Name  Power Pages Authenticated users per site  \nLicense type  Per authenticated user/website  \n \nPower Pages Anonymous user subscriptions  \n \nAnonymous user subscription licenses are offered for the number of anonymous users who access a \nwebsite and do not log in.  These licenses are offered through capacity packs with 500 users per capacity \npack. Three tiers of pricing are offered. O nce the minimum purchase requirement is met, additional packs  \ncan be purchased in units of 1.  \nPower Pages anonymous user capacity packs  \nCapacity Pack Tiers  Capacity Packs  \nMinimum purchase  Number of users  \n(1 capacity pack  = 500 user s) Pricing  \nTier 1  1 capacity pack 500+ users  $75/pack  \nTier 2  20 capacity packs  10,000+ users  $37.50/pack  \nTier 3  200 capacity packs  100,000+ users  $25/pack  \nCustomers should purchase the necessary number of capacity pack licenses  to cover the anticipated \nnumber of anonymous  users that will access each Power Pages website over a monthly period. Unused \ncapacity does not carry over to the next month. Note: Anonymous  user capacity packs  do not need to be \nassigned to individual users. These capacities are assigned to an environment.  \nPer Anonymous user offer details  \nSKU Name  Power Pages Anonymous users per site  \nLicense Type  Per anonymous user/website  \n \nPower Pages pay -as-you-go meters  \nWith the Power Pages pay -as-you-go meters, customers can postpay based on the actual number of \nAuthenticated and/or Anonymous users who have accessed a website.  \nPlease note: Power Pages subscription licenses cannot be used in a pay -as-you-go environment.  \n \n \n   \n \n Power Platform  Licensing Guide | July 2024   P a g e  | 22 Power Pages Authenticated user meter  \nThe authenticated pay -as-you-go meter enables customers to pay -as-you-go based on the actual number \nof authenticated users who have accessed a website in a month.  \n \nPower Pages Authenticated pay-as-you-go meter defin"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "ition : A measure of the number of unique \nauthenticated users per website per month.  \n \nPower Pages Anonymous user meter  \nThe Anonymous user pay -as-you-go meter enables customers to pay -as-you-go based on the actual \nnumber of Anonymous users who have accessed a website in a month.  \n \nPower Pages Anonymous pay-as-you-go meter definition : A measure of the number of unique \nanonymous users per website per month.  \n \nPower Pages use rights included with Power Apps and Dynamics 365 licenses  \nPower Pages  use rights within Power Apps and Dynamics 365 Enterprise Apps are  limited to the context \nof the Power Apps and Dynamics Enterprise Apps. Dynamics 365 Enterprise Apps are granted use rights \nfor Power Pages , however, restricted tables and the associated Dynamics 365 license requirements for \nusers who create, update , or delete data stored within these tables remain in place. For a full list of \nrestricted tables, see  Restricted tables requiring Dynamics 365 licenses . \n \nLicense  Power Pages  use rights  \nPower Apps per app  Run 1 Power App or access 1 website  \nPower Apps Premium  Unlimited Power Apps and Power Pages websites  \nDynamics 365 Team Members  None  \nDynamics 365 Operations – Activity  None  \nDynamics 365 Apps1 None  \nDynamics 365 Enterprise and Premium \nApps2 • Power Pages websites that map to licensed Dynamics 365 application context  \n• Power Pages websites that map to the same environment as the licensed Dynamics \n365 application  \n• Unlimited Power Pages websites  \nMicrosoft 365 / Office 365  None  \n \n \n \n \n \n \n \n \n \n \n \n \n 1Dynamics 365 Sales Professional, Dynamics 365 Customer Service Professional, Dynamics 365 Team Members, Dynamics 365 Operatio ns – \nActivity, Dynamics 365 Human Resources Self Service, Dynamics 365 Business Central Team Members  \n2Dynamics 365 Sales Enterprise, Dynamics 365 Sales Premium, Dynamics 365 Customer Service Enterprise, Dynamics 365 Field Servi ce, Dynamics \n365 Finance, Dynamics 365 Finance Premium, Dynamics 3"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "65 Supply Chain Management, Dynamics 365 Supply Chain Management Premium, \nDynamics 365 Project Operations, Dynamics 365 Commerce, Dynamics 365 Human Resources, Dynamics 365 Business Central, Dynamics  365 \nIntelligent Order Management  \n \n   \n \n Power Platform  Licensing Guide | July 2024   P a g e  | 23   \nPower Pages subscriptions  Power Pages  \npay-as-you-go meters  Power Pages use rights  \nincluded with:  \n  RECOMMENDED \nMOTION  \nPower Pages \nAuthenticated users  \nTier 3 (100k+ users)  \n$50 for 100  users /mo.  RECOMMENDED \nMOTION  \nPower Pages \nAnonymous users  \nTier 3 (100k+ users)  \n$25 for 500 users/mo.  Power Pages \nAuthenticated user \nmeter1 \n$4 per user  Power Pages \nAnonymous user \nmeter1 \n$0.30 per user  Power Apps  \nper app  Power  \nApps \nPremium  Select  D365 Enterprise licenses  \nPlans  Capabilities  \nPower Pages  Create, access, host \nand administer \nwebsites  ⚫ ⚫ ⚫ ⚫ 1 app o r \nwebsite  ⚫ Within same envir onment  \n as licensed D365 app  \nSecure access \nauthentication  ⚫   ⚫ ⚫       \nPower Platform \nconnectors  Standard connectors  ⚫ ⚫ ⚫ ⚫ ⚫ ⚫ ⚫ \nPremium  and custom \nconnectors  ⚫ ⚫ ⚫ ⚫ ⚫ ⚫ ⚫ \nDataverse  Full Dataverse access  ⚫ ⚫   ⚫ ⚫ ⚫ \nCreate and access \ncustom tables and \ncomplex tables2 ⚫ ⚫   \n⚫ ⚫ ⚫ \nDataverse Database \ncapacity (Accrued)  2 GB3 500 MB3   \n50 MB4 250 MB4 ⚫ \nDataverse File \ncapacity (Accrued)  16 GB3 4 GB3   \n400 MB4 2 GB4   \nDataverse Log \ncapacity (Accrued)  1 GB  250 MB    \n   \nManaged \nEnvironments  Admin and \ngovernance at scale  ⚫5 ⚫5   \n⚫ ⚫ Within app context  \n \n 1 Environments that are configured to use Power Platform pay -as-you-go, receive a one -time entitlement of 1 GB of Dataverse Database capacity and 1 GB of Dataverse File capacity per environment. Additional Datav erse \nDatabase, Dataverse File and Dataverse Log  subscription capacity can be purchased in increments of 1 GB.  \n2 For Power Pages use rights with restricted tables and exceptions for case tables, see Restricted tables requiring Dynamics 365 licens"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "es . \n3 Per capacity pack  \n4 Per license capacity  \n5 When Managed Environments is activated in a specific environment, all Power Apps, Power Automate, Power Pages or Copilot Studio us age in that environment requires full Power Apps, Power Automate, Power Pages, Copilot \nStudio or Dynamics 365 licenses.. Please see  Power Platform Managed Environments for details. \n \n Summary of \nPower Pages  \n\n   \n \n Power Platform  Licensing Guide | July 2024   P a g e  | 24 AI Builder   \nService overview  \nAI Builder helps empower everyone , regardless of their technical experience , to work with Artificial \nIntelligence (AI). This solution helps businesses to easily add AI capabilities to both apps and business \nprocesses. AI Builder supports various scenarios such as predictions, business card reader, and many \nmore. For more information on AI Builder, please visit AI Builder licensing . \nLicensing  overview  \nAI Builder is licensed on a monthly capacity basis  via the AI Builder capacity add -on. This capacity is \nexpressed in the form of “service credits.” Service credits serve as the single , common currency across all \ncapabilities supported by AI Builder. Qualifying prerequisites for the AI Builder add -on include  Power \nApps  Premium , Power Apps per app , Power Automate Premium , Power Automate Process, Power \nAutomate Hosted Process , Power Automate unattended RPA add -on and Dynamics 365 Finance \nsubscription licenses.  Multiple AI Builder capacity add-ons can be applied against a single qualifying \nprerequisite  license.  \nThe AI Builder capacity add-on is offered  via capacity packs  with tiered pricing . Each capacity pack \nincludes  1 million service credits per month . Service credits are pooled across t he tenant and available \nservice credits are deducted when AI Builder services are used ; (e.g. , If a customer requires 4.7 million \nservice credits per month based on anticipated usage, they should purchase 5 capacity pack s.)  \nDifferent capabilities , for e"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "xample, forms processing, prediction, burn down service credits at different \nrates. (See the AI Builder rate card for details). Customers should purchase the appropriate number of AI \nBuilder capacity packs based on anticipated usage across all scenarios . \n \n• Purchased service credits can be used from AI Builder models included within Power Automate,  \nPower Apps  and Dynamics 365 applications . \n• Service credits are deducted/consumed for both training and production usage . \n \n AI Builder capacity packs  (1 capacity pack  includes 1 million service credits per month.)  \nCapacity Pack  \nTiers  AI Builder add -on  \nSKU Names  Capacity Packs  \nMinimum Purchase  Capacity pack  \nprice/month  \nTier 1  AI Builder Capacity T1 add-on   1 capacity pack  $500/capacity pack  \nTier 2  AI Builder Capacity T2 add-on  10 capacity packs  $375/capacity pack  \nTier 3  AI Builder Capacity T3 add-on  50 capacity packs   $250/capacity pack  \n \n   \n \n Power Platform  Licensing Guide | July 2024   P a g e  | 25 AI Builder rate card  \nEach AI builder capability consumes service credits at different rate s. AI Builder Capacity add -on capacity packs  should  be purchased based on the anticipated \nusage of various AI Builder capabilities . Administrators can download an Excel capacity consumptio n report for the tenant here.  \nCapability  Operation  Type  Service Credit  Consumption Rate  $ Equivalent Price per Operation1 \n \nAI prompts, Create text with GPT 3. 5 Real-time Prediction  Prebuilt  6 credits/1k tokens2  $0.003 / 1k tokens   \nDocument processing  Training  Custom  Free    \nReal-time Prediction  Custom  100 credits/Page  $0.05 / Page   \nReceipt, Invoice, Identity document \nor Business card analysis  Real-time Prediction  Prebuilt  32 credits/Page  $0.016 / Page   \nText translation  Real-time Prediction  Prebuilt  22 credits/1k chars  $0.011 / 1k chars   \nText analysis   \nSentiment analysis, Language detection,  Key \nphrase extraction  Real-time Prediction  Prebuilt  2 credits/1"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "k chars  $0.001 / 1k chars   \n \nText analysis   \nCategory classification, Entity extraction  Training  Custom  Free    \nReal-time Prediction  Custom  20 credits/1k chars  $0.01 / 1k chars   \nReal-time Prediction  Prebuilt  20 credits/1k chars  $0.01 / 1k chars   \nText recognition (OCR)  Real-time Prediction  Prebuilt  3 credits/Image  $0.0015 / Image   \nImage classification  Training  Custom  Free (performed on -premises)     \nReal-time Prediction  Custom  4 credits/Image  $0.002 / Image   \nObject detection  Training  Custom  Standard: 10 credits/Image  \nDomains: 160 credits/Image for first 500 \nimages, then 10 credits/Image  Standard: $0.005 / Image  \nDomains: $0.08 / Image for first 500 \nimages, then $0.005 / Image   \n \nReal-time Prediction  Custom  8 credits/Image (standard and domains)  $0.004 / Image   \nPrediction  Training  Custom  Free    \nScheduled  \nPrediction  Custom  1 credit/5 rows  $0.0005 / 5 rows   \nReal-time Prediction  Custom  10 credits/1 row  $0.005 / 1 row   \n1 Disclaimer: Pricing based on Tier 1 pricing. $ Equivalent price per operation shown only for guidance based on List Price ).  \n2 This includes both input tokens (customer + system prompts) and output tokens (result). For common English text, 1000 tokens = ~700 words. See https://platform.openai.com/tokenizer .  \n \n   \n \n Power Platform  Licensing Guide | July 2024   P a g e  | 26 Capacity enforcement  \n \nFor AI Builder capacity add -on SKUs, purchased capacity is enforced monthly and unused service credits \ndo not carry over month to month.  \n \nOverage handling  \n \nWhile occasional and reasonable overages will be tolerated, customers exceeding purchased capacity \nshould adjust their purchase quantity per standard Microsoft terms to remain in compliance. In case of \ncredit overuse, Edit and Creation of AI Builder models  will be blocked while in overage. For AI Builder \nmodels used in flows and apps, more stringent technical enforcement (including service denial) will result \nfor usage that"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": " is significantly over the purchased capacity.  \nComprehensive monitoring, reporting, and alerting mechanisms will be instituted to assist customers with \nmanaging AI Builder capacity.   \n \nAssignment of purchased capacity  \n \nAssignment of purchased capacity to appropriate Power Automate, Power Apps applications and \nDynamics 365 workloads is managed in product. Assignment helps ensure capacity for critical AI models. \nThe minimum capacity to be assigned is 1 service credit.  \nDataverse  \nDataverse default and accrued subscription capacity entitlements  \nPower Apps , Power Automate,  Copilot Studio  and Power Pages default subscription  capacities leverage \nthe same tenant and infrastructure and will accrue across one tenant . Every tenant with a Power Apps , \nPower Automate , Copilot Studio  or Power Pages license receives default capacity. In addition, for each \nPower Apps Premium , Power Apps per app,  Power Automate Premium , Power Automate Process, Power \nAutomate Process Mining  and Power Pages license there  is additional accrued  capacity added to  the \ntenant. For Dat averse for Teams capacity and service limits, please refer to the documentation here. \n \nPower Apps capacity per tenant  Default  \nPremium  Default  \nPer app  Accrued   \nPremium  Accrued  \nPer app  \nDataverse Database capacity  10 GB  5 GB 250 MB 50 MB \nDataverse File capacity  20 GB 20 GB 2 GB 400 MB \nDataverse Log capacity  2 GB 2 GB   \n \nPower \nAutomate \ncapacity  \nper tenant  Default  \nPremium  Default  \nPer user  Default  \nProcess  Default  \nper flow  Accrued  \nPremium  Accrued  \nper user  Accrued  \nProcess  Accrued  \nPer flow  Accrued  \nProcess \nMining  \nDataverse \nDatabase \ncapacity  10 GB  10 GB  5 GB  5 GB  250 MB 250 MB 50 MB  50 MB  2 GB \nDataverse \nFile capacity  20 GB 20 GB 2 GB  2 GB  2 GB 2 GB 200 MB  200 MB  1 TB \nDataverse \nLog capacity  2 GB 2 GB 200 MB  200 MB      \n \n \nNote, customers may have as many flows as needed with Power Automate Process and Power Automate \nper flow"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": " . Each flow will increase  capacity limits.  \n \nCopilot Studio  capacity per tenant   Default  \nper tenant  \n  Dataverse Database capacity   5 GB  \n  Dataverse File capacity   20 GB \n  Dataverse Log capacity   2 GB  \n   \n \n Power Platform  Licensing Guide | July 2024   P a g e  | 27  \nPower Pages capacity  (Authenticated) \nDefault   \nper tenant  (Anonymous) \nDefault  \nper tenant  Accrued per \nAuthenticated user \ncapacity pack  Accrued per \nAnonymous user \ncapacity pack  \nDataverse Database capacity  5 GB  5 GB  2 GB  500 MB  \nDataverse File capacity    16 GB  4 GB  \nDataverse Log capacity  2 GB  2 GB  1 GB  250 MB  \n \nPower Apps, Power Automate , Copilot Studio , Power Pages and Dynamics 365 Sales, Customer Service, \nand Field Service applications leverage the same tenant and infrastructure. Dataverse capacity (Dataverse \nDatabase, Dataverse File, and Dataverse Log) is accrued across the tenant and shared amongst relevant \napplicati on workloads.  \n \nThere are additional Microsoft subscriptions beyond Power Platform that grant Dataverse capacity  \nentitlements.  Please see this page  for details related to Project for the web, as well as the Dynamics 365 \nLicensing Guide  for information related to other entitlements.  \n \nDataverse allows integration with Outlook and SharePoint.  \n \nDataverse capacity types and purpose s \nDataverse  Purposes  \nDatabase  Stores and manages table definitions and data  \nFile Stores attachments to notes or emails in Dynamics 365 Sales, Customer Service, and Field Service \napplications and Power Apps. These include documents, image files, videos, PDF files and other \ncrucial files needed in an organization.  \nLog Records table and column data changes over time for use in analysis and reporting purposes. Log \ncapacity is designed to help organizations meet their auditing, compliance, and governance policies.  \nThe first Power Apps OR Power Automate OR Copilot Studio  OR Power Pages OR Dynamics 365 Sales, \nCustomer Service, and Field Serv"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "ice subscription provides the one -time default capacity entitlement for \nthe tenant.  For example, if a new customer purchases Power Apps Premium, the tenant will receive 10 GB \nof default Dataverse Database capacity. Additional subscriptions do not add to the tenant’s default \ncapacity.  \nWhen additional subscriptions are added to the tenant, additional Dataverse capacity may accrue  to the \ntenant. Example: Assume that a new customer purchases 10 Power Apps Premium licenses and 20 Power \nApps per app licenses. The total tenant wide pooled capacity will be as follows (note 1GB = 1,024MB) : \nDefault and Accrued Capacity Allocation  Default/  \ntenant  Accrued/10 Enterprise USL  Total Tenant  \nwide capacity  \nDataverse Database capacity  10 GB  10*250MB + 20*50MB = 3.5GB 10GB + 3. 5GB = 13. 5GB \nDataverse File capacity  20 GB  10*2GB + 20*400MB = 28GB  20GB+28GB = 48 GB  \nDataverse Log capacity  2 GB  NA 2GB \n \nDataverse capacity add -ons \nApps , flows,  bots or websites  utilizing Dataverse will consume varying quantities of Dataverse Database \ncapacity, Dataverse File capacity, and Dataverse Log capacity . Additional capacity is available through the \nDataverse capacity add -ons.  \n   \n \n Power Platform  Licensing Guide | July 2024   P a g e  | 28 Subscription Capacity/tenant  Additional Increment  Minimum Quantity  \nDataverse Database capacity add -on  1 GB 1 \nDataverse Database capacity Tier 2 add-on  1 GB  1,000  \nDataverse File capacity add -on 1 GB 1 \nDataverse Log capacity add -on 1 GB 1 \n \nPlease note that Dataverse capacity add -ons do not apply to Dataverse for Teams  scenarios (i.e. , when a \nDataverse for Teams  environment reaches its limit, customers need to step up to full Power Apps, Power \nAutomate, Copilot Studio  or Power Pages licenses  for additional capacity).  \n \nDataverse default capacity for Power Platform pay-as-you-go environments  \nDataverse default capacity  \nEnvironments configured to use Power Platform pay -as-you-go, receive a one-tim"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "e entitlement of 1GB of \nDataverse Database and 1GB of Dataverse File capacity per environment . These  entitlements do not \nchange based on the number of users using apps or custom websites in an environment. These pay -as-\nyou-go environments do not consume tenant -wide Dataverse capacity. More information available here.   \n \nPay-as-you-go environments  Included per  \npay-as-you-go environment  \nDataverse Database capacity  1 GB \nDataverse File capacity  1 GB \nDataverse Log capacity  N/A \n \nDataverse capacity meters  \nWith a pay -as-you-go enabled environment, Dataverse capacity meters can be used to pay-as-you-go for \nDataverse usage as alternatives to the existing subscription capacity add -ons for overages. Dataverse pay -\nas-you-go capacity is billed based on the amount of capacity used in the environment, beyond the 1GB \nDataverse Database capacity and 1GB Datavers e File capacity entitlements per environment. No capacity \nis allocated for Dataverse Logs. (Fractional usage is calculated to 2 decimal places in local currencies .) \n \nMeter definition : Amount of capacity used in the environment beyond any entitled amounts (1GB \ndatabase capacity and 1GB of file capacity per environment).  \n \nDataverse Capacity/environment  Additional Increment  \nDataverse Database capacity  1 GB \nDataverse File capacity  1 GB \nDataverse Log capacity  1 GB \n \n \n \n \n   \n \n Power Platform  Licensing Guide | July 2024   P a g e  | 29 Additional Resources  \n \nMultiplexing  \n \nMicrosoft’s Multiplexing rules protect against customers looking for ways to purchase fewer licenses than \nwould otherwise be required to access a software or service. “Multiplexing” refers to the use of hardware \nor software to pool connections, reroute or indirectly access information, and/or reduce the number of \ndevices or users that directly access or use a product. The most common form of Multiplexing is often \nthought of as “connection pooling”, where many users are accessing an application through a si"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "n gle \ncontact point. As technology in the world has advanced, there are many other forms of Multiplexing that \nhave emerged, such as automated processes to migrate data, accessing applications indirectly, and more.  \n \nMultiplexing does not reduce the number of subscription licenses of any type required to access the \nPower Platform services.  Any user or device that  input s data into, quer ies, view s data from or otherwise \naccesses Power Apps, Power Automate, Copilot Studio  and Power Pages  apps, directly or indirectly must \nbe properly licensed. The number of tiers of hardware or software between Power Platform apps and the \nusers or devices that ultimately use Power Platform indirectly does not affect the number of User SLs \nrequired. For additional information about multiplexing refer to the Microsoft Multiplexing Overview . \n \nLicensing Requirements for External Users  \nExternal users* must be appropriately licensed to access Power Platform services and data. Applicable \nlicensing includes:  \n• An appropriate Power Platform User SL  \n• Power Pages Authenticated or Anonymous users/website capacity  license s \n• Accessing via Power Automate per flow or Power Automate Process licenses  \n• Limited  capabilities included with  Dynamics 365, Office 365, or Windows licenses  \nUsers must be appropriately licensed whether they are accessing directly or indirectly per multiplexing \nguidelines.  More  information on external guest user access is available here.   \n* External Users are defined as users that are not employees, onsite contractors or onsite agents of \nCustomer or its Affiliates.  \n \nTrials and Implementation  \nSign-up for a free trial of \n• Power Apps here \n• Power Pages here \n• Power Automate  here \n• Copilot Studio  here \n• AI Builder here \n \nDevelopment and Testing   \nThe free Developer Plan is intended for individual use allowing developers to learn and build skills on \nPower Apps, Power Automate and Dataverse. To learn more, click here. \n \nPricing  "
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "\nPower Apps, Power Automate, Copilot Studio  and Power Pages price lists are located here:  \n• Power Apps: https://powerapps.microsoft.com/en -us/pricing/   \n• Power Automate: https://powerautomate.microsoft.com/en -us/pricing/  \n• Copilot Studio :  aka.ms/copilotstudio   \n   \n \n Power Platform  Licensing Guide | July 2024   P a g e  | 30 • Power Pages:  https://powerpages.microsoft.com/en -us/pricing/  \n \nPower Platform Service Support  \nSupport Plans  \nThe benefits included in the Subscription Support Plan  are applicable for customers who license Power \nPlatform solutions via MOSP, EA, MPSA, EAS, and EES.   Learn more about Power Apps, Power Automate, \nCopilot Studio , Power Pages,  and Dynamics 365 support options : \n• Professional Direct Support for Dynamics 365 and Power Platform   \n• Unified Support  (for enterprise solutions)  \n \nSKU Name  Description  Price/month  Licensed  \nProfessional Direct Support for \nDynamics 365 and Power Platform  ProDirect Support Subs Per User  \nfor D365 and Power Platform  $9  User*  \n*Customer must acquire enough Professional Direct Support licenses to cover each Power Platform and \nDynamics 365 license on its agreement, up to a maximum of 250 licenses . \nAppendix A: Terminology and Custom Tables  \nAdministration : Administration is critical in order to establish boundaries and policies around the use of \nPower Apps in organizations  \n• Manage environments – space to store, and manage, and share data, apps, and flows  \n• Data policies – create and enforce policies that define how data can be shared  \nApp (definition of Power Apps per app): An “app” is a combination of Power Platform assets that solves a \nspecific business scenario.  \n• Each “per app” license provides use rights to run 1 custom app (canvas or model driven), or \naccess 1 custom website.  \n• No limits on other components (e.g., forms, dashboards, etc.).  \nApplication Program Interface (API):  Any form of application programming interface that provides access \nto a"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": " Microsoft service and any associated tools, including sample code that enables interactions with \nMicrosoft's services, and documentation that Microsoft makes available under these TOU,  and includes all \nelements, components, and executables of such API.   \nApplication Types:  \n• Canvas Apps:  Design and build a business application from a canvas in Microsoft Power Apps \nwithout writing code in a traditional programming language. Design the application by dragging and \ndropping elements onto a canvas, the designer has complete control over app lay out. \n• Model -driven Apps:  Design is a component -focused approach to app development based on data \nmodel and business processes. Unlike canvas app development where the designer has complete \ncontrol over application layout, with model -driven apps much of the layout is determined for  you \nand largely designated by the components you add to the application.  \nConnector : It provides a way for users to connect their business data and leverage a set of pre -built \nactions and triggers to build their applications and workflows. Examples  of connections: Dataverse \n(formerly Common Data Service), SharePoint, SQL, OneDrive, Excel, Dynamics 365.  \n• Standard Connector:  Data sources within the Microsoft 365 ecosystem. Examples: Excel, Outlook, \nSharePoint, LinkedIn. A list of standard connectors is located here. \n• Premium Connector:  Business systems beyond Microsoft 365. Examples: DocuSign, Zendesk, Jira \nSoftware.  \n• Custom Connector:  To support more tailored scenarios, users can build custom connectors with \ntheir own triggers and actions. These connectors are function -based ; data is returned based on \ncalling specific functions in the underlying service. Example:  Services that are not available as \nprebuilt connectors.  \n• On-premises Connector:  Access es on-premises data using a gateway. Example:  Microsoft SQL \nServer.  \n   \n \n Power Platform  Licensing Guide | July 2024   P a g e  | 31 CRUD:  Create, read, u"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "pdate, and delete operations.  \nCopilot : Copilot is an AI assistant powered by Large Language Models (LLMs) that offer s innovative \nsolutions across the Microsoft Cloud. Copilots  aim to enhance productivity, creativity, and data \naccessibility while providing enterprise -grade data security and privacy features. They bridge the gap \nbetween complex tasks and user -friendly solutions, providing a natural language conversational interfa ce \nto interact with data, create automations, build applications, and even assist with coding tasks. Their \nintegration within Microsoft platforms /products provides a more efficient digital workspace.  \nDataverse (formerly Common Data Service):  Dataverse lets you store and manage data that is used by \nbusiness applications.  \nDataverse for Teams , built atop Dataverse, delivers a built -in low code data platform for Microsoft Teams, \nand provides relational data storage, rich data types, enterprise grade governance, and one -click solution \ndeployment.  \nDataverse is designed to be used in any application (not just Teams) and includes additional security \nfeatures such as auditing, sharing, column level and hierarchical security. For a detailed comparison on \nDataverse for Teams and Dataverse capabilities, p lease refer to the public documentation here. \nDesktop flow:  A feature in Power Automate targeting the RPA market by enabling legacy apps to be \nautomated via GUI vs API.  \n• Processes executed via desktop flows can be contained within a broader API -based automation \nscenario or  exist standalone . \nFlow (definition of flow within app context):  For both triggers and actions, flows included within an \nembedding application can connect:  \n• To any data source within the use rights of the embedding application  \n• Directly with the embedding application (via built in trigger/action)  \nGenerative AI : Generative AI is a type of artificial intelligence focused on the ability of computers to use \nmodels to create content like im"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "ages, text, code, and synthetic data.  \nGenerative AI applications are built on top of large language models (LLMs) and foundation models.  \n• LLMs  are deep learning models that consume and train on massive datasets to excel in \nlanguage processing tasks. They create new combinations of text that mimic natural \nlanguage based on its training data.  \n• Foundation models  are large ML models pre -trained with the intention that they are to be \nfine-tuned for more specific language understanding and generation tasks. These models \nare utilized to discern patterns within the input data.  \nAfter these models have completed their learning processes, together they generate statistically probable \noutputs when prompted and they can be employed to accomplish various tasks, including:  \n• Image generation based on existing ones or utilizing the style of one image to modify or \ncreate a new one.  \n• Speech tasks such as transcription, translation, question/answer generation, and \ninterpretation of the intent or meaning of text.  \nRobotic Process Automation (RPA):  A market for process automation that encompasses the use of an \napplication's graphical user interface (GUI), where a user records a series of steps/actions/tasks for the \nautomation technology to then perform as a process by repeating directly in the GUI.  \nRPA robot or \"bot\": A GUI -based process running on a desktop or virtualized environment.  \n• Attended bot:  Triggered by an explicit user action on their workstation, i.e. , a local or remote \ndesktop  \no Must operate concurrently with the user on the same workstation  \no Can run more than one discrete process, but each process must be serialized to run \nsequentially  \n• Unattended bot:  Runs autonomously without requiring user actuation  \no Can be deployed on a local or remote desktop, or other virtualized environment  \no Can run more than one discrete process, but each process must be serialized to run \nsequentially  \no Concurrent instances of a singular proc"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "ess require an additional unattended bot for each \ninstance  \n   \n \n Power Platform  Licensing Guide | July 2024   P a g e  | 32 Tables:   A set of records used to store data. Tables let users model business data for use within an \norganization’s business applications. Examples of tables: Account, Contact, Lead, Opportunity.  \n• Standard tables:  Dataverse provides business tables, out of the box, which  represent most \ncommonly used tables across business applications. Examples:  Account, Appointment, Contact, \nEmail, etc.  \n• Custom tables:  Tables that are created by the customer/partner for a specific business need. For  \nexample , type of machine is not a standard table, so it can be created  as a custom table.  \n• Restricted tables:  Tables  that requires a Dynamics 365 license for full access. Examples : Case, SAL, \nKnowledge Articles. For list of restricted tables click here. \n• Complex tables:  These are tables that use complex server -side business logic. Any table (whether \nstandard or custom) becomes complex once the customer/partner associates the table with the \ncustom business logic. Example: any table that uses a real -time workflow or code pl ug-in. \nWorkflows : \n• Background workflows:  Task automation across systems and services. Runs in the background.  \n• Real-time workflows:  Task automation across systems and services. Runs in a real time manner.  \n• Business process flows:  Structured stateful human interactive workflows which are composed of \nmultiple steps, allows branching/stage gating, and includes process KPIs and reporting.\n   \n \n Power Platform  Licensing Guide | July 2024   P a g e  | 33 Appendix B: Dynamics 365, Microsoft/Office 365, and Windows licenses that include Power  Platform capabilities  \nDynamics 365  \nQualifying License  Limited Use Rights Included with Qualifying License  \nPower Apps  Power Automate  Power Pages  \nDynamics 365 Sales Premium     \nDynamics 365 Sales Enterprise     \nDynamics 365 Sales Professional    "
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": " \nDynamics 365 Customer Service Enterprise     \nDynamics 365 Customer Service Professional     \nDynamics 365 Field Service     \nDynamics 365 Project Operations     \nDynamics 365 Team Members     \nDynamics 365 Finance     \nDynamics 365 Finance Premium     \nDynamics 365 Supply Chain Management     \nDynamics 365 Supply Chain Management Premium     \nDynamics 365 Commerce     \nDynamics 365 Human Resources     \nDynamics 365 Operations – Activity     \nDynamics 365 Business Central     \nDynamics 365 Business Central Team Members     \nDynamics 365 Intelligent Order Management     \n \nMicrosoft 365*, Office 365, and Windows  \nQualifying License  Limited Use Rights Included with Qualifying License  \nPower Apps  Power Automate  Microsoft \nCopilot \nStudio  for  \nTeams  Dataverse for  \n Teams   \nCloud  \n flows  Desktop  \n flows   \nOffice 365 E1  ○ ○   ○ ○  \nOffice 365 E3  ○ ○   ○ ○  \nOffice 365 E5  ○ ○   ○ ○  \nOffice 365 F3  ○ ○   ○ ○  \nM365 Business Basic  ○ ○   ○ ○  \nM365 Business Standard  ○ ○   ○ ○  \nM365 Business Premium  ○ ○ ○ ○ ○  \nMicrosoft 365 F1             \nMicrosoft 365 F3  ○ ○ ○ ○ ○  \nMicrosoft 365 E3  ○ ○ ○ ○ ○  \nMicrosoft 365 E5  ○ ○ ○ ○ ○  \nWindows 10 Pro      ○      \nWindows Enterprise E3      ○      \nWindows Enterprise E5      ○      \nOffice 365 A1  ○ ○        \nOffice 365 A31 ○ ○   ○ ○  \nOffice 365 A51 ○ ○   ○ ○  \nMicrosoft 365 A12 ○ ○        \nMicrosoft 365 A31 ○ ○ ○ ○ ○  \nMicrosoft 365 A51 ○ ○ ○ ○ ○  \nWindows Education A31     ○      \nWindows Education A51     ○      \n1Also included in Student Use Benefit  \n2Included via accompanying Office 365 A1  \n*Microsoft 365 is governed by the License Terms of the individual products and services comprising Microsoft 365, as modified  by the \nLicens e Terms in the Microsoft 365 Product Entry. For more information on Microsoft 365 and Office 365 Suites licensing channels and \nsegment availability, refer to the Product Terms . \n \n   \n \n Power Platform  Licensing Guide | July 2024   P a g "
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "e  | 34 Appendix C: Change Log  \nPage (s) Topic  Change  Action  Date  \n28 Dataverse  New Dataverse capacity Tier 2 add -on July 2024  \nVarious  Managed Environments  Update  Dynamics 365 Professional and Dynamics 365 Team \nMembers eligible for Managed Environments  July 2024  \n25 AI Builder  Update  Rate card: AI Prompts , create text with GPT \n3.5 updated from $0.008/1k tokens to $0.003/1k \ntokens  June 2024  \n25 AI Builder  Update  Rate card: Object detection updated from \n$0.01/Image to $0.005/Image  June 2024  \n8, 23, 27  Power Pages  Update  Dataverse Log capacity  (Accrued) added  June 2024  \n12-14, 17 Power Automate Hosted Process  New Full license replace s Hosted RPA add -on May 2024  \nVarious  Power Apps /Automate use rights \nw/M/O365  Update  Renamed Power Apps  Basic and Power Automate \nBasic  April 2024  \n19-20 Copilot Studio  New Copilot Studio in Copilot for Microsoft 365  February 2024  \n7, 18 -20 Microsoft Copilot Studio  New Formerly Power Virtual Agents  December 2023  \nVarious  Power Automate  Clarified  Entitlement per tenant /environment  October  2023  \n7,14 Power Automate  New Power Automate Process  August 2023  \n7,13 Power Automate  Rebranded  Power Automate per user w/attended RPA \nrenamed to Power Automate Premium  August 2023  \n5,10 Power Apps  Rebranded  Power Apps per user renamed to Power Apps \nPremium  August 2023  \n20, 21  AI Builder  Updated  Tiered pricing  May 2023  \n28 AI Builder  Updated  Rate card update  February 2023  \nVarious  Managed Environments  Updated  D365 requirement, within app context  February 2023  \n12, 17  Power Automate  New Hosted RPA  January 2023  \nVarious  Power Platform  New Managed Environments  January 2023  \nVarious  Power Pages  New Power Pages  Nov 2022  \n24 AI Builder  Updated  Image Classification added to rate card  June 2022  \nVarious  Power Platform  Clarified  Minor clarifications  May 2022  \n24 AI Builder  New Service credit consumption rates by capability and \noperation listed  April 2022  \n2"
  },
  {
    "blob_name": "Power-Platform-Licensing-Guide-July-2024.pdf",
    "container": "contentiq",
    "last_modified": "2025-06-16T06:22:34+00:00",
    "size": 1071484,
    "content": "0 Power Virtual Agents for Teams  Clarified  Chat sessions per user/24 hours  April 2022  \n5 Power Apps  New Power Apps per app pay -as-you-go plan  March 2022  \n22, 23  Dataverse  New Power Platform pay-as-you-go Dataverse capacity  March 2022  \n10, 17  Power Apps and Power \nAutomate capacity add -on Rebranded  Rebranded as Power Platform Requests add -on Feb 2022  \n4, 5 Power Apps  New AI Builder service credits  Dec 2021  \n5 Power Apps  New Dynamics 365 Field Service use rights  for work \norders  Dec 2021  \nVarious  Power Platform requests  Updated  Updated footnotes  Nov 2021  \n28 Appendix B  Updated  Dynamics 365 Intelligent Order Management \nadded  Oct 2021  \n3, 4 Power Apps per app  Updated  Entitlements updated  Oct 2021  \nVarious  WinAutomation  Updated  End of support  Oct 2021  \n8 Power Apps Portals  Updated  Channels for per login add -on June 2021  \n11, 17  Power Automate  New Process Advisor  June 2021  \nVarious  Microsoft Dataverse  Updated  Terminology change from entities to tables  May 2021  \n© 20 20 Microsoft Corporation. All rights reserved.   \n   \n \n Power Platform  Licensing Guide | July 2024   P a g e  | 35 This document is for informational purposes only. MICROSOFT MAKES NO WARRANTIES, EXPRESS OR IMPLIED, IN THIS DOCUMENT. This i nformation is provided to help \nguide your authorized use of products you license; it is not your agreement. Your use of products li censed under your license agreement is governed by the terms and \nconditions of that agreement. In the case of any conflict between this information and your agreement, the terms  and conditions  of your agreement control. Prices for licenses \nacquired through  Microsoft resellers are determined by the reseller ."
  }
]